{"2024-03-21T00:00:00Z":{"Robotics":[{"id":"http://arxiv.org/abs/2403.14626v1","updated":"2024-03-21T17:59:55Z","published":"2024-03-21T17:59:55Z","title":"ODTFormer: Efficient Obstacle Detection and Tracking with Stereo Cameras\n  Based on Transformer","summary":"  Obstacle detection and tracking represent a critical component in robot\nautonomous navigation. In this paper, we propose ODTFormer, a Transformer-based\nmodel to address both obstacle detection and tracking problems. For the\ndetection task, our approach leverages deformable attention to construct a 3D\ncost volume, which is decoded progressively in the form of voxel occupancy\ngrids. We further track the obstacles by matching the voxels between\nconsecutive frames. The entire model can be optimized in an end-to-end manner.\nThrough extensive experiments on DrivingStereo and KITTI benchmarks, our model\nachieves state-of-the-art performance in the obstacle detection task. We also\nreport comparable accuracy to state-of-the-art obstacle tracking models while\nrequiring only a fraction of their computation cost, typically ten-fold to\ntwenty-fold less. The code and model weights will be publicly released.\n","authors":["Tianye Ding","Hongyu Li","Huaizu Jiang"],"pdf_url":"https://arxiv.org/pdf/2403.14626v1.pdf","comment":"8 pages"},{"id":"http://arxiv.org/abs/2310.16828v2","updated":"2024-03-21T17:56:19Z","published":"2023-10-25T17:57:07Z","title":"TD-MPC2: Scalable, Robust World Models for Continuous Control","summary":"  TD-MPC is a model-based reinforcement learning (RL) algorithm that performs\nlocal trajectory optimization in the latent space of a learned implicit\n(decoder-free) world model. In this work, we present TD-MPC2: a series of\nimprovements upon the TD-MPC algorithm. We demonstrate that TD-MPC2 improves\nsignificantly over baselines across 104 online RL tasks spanning 4 diverse task\ndomains, achieving consistently strong results with a single set of\nhyperparameters. We further show that agent capabilities increase with model\nand data size, and successfully train a single 317M parameter agent to perform\n80 tasks across multiple task domains, embodiments, and action spaces. We\nconclude with an account of lessons, opportunities, and risks associated with\nlarge TD-MPC2 agents. Explore videos, models, data, code, and more at\nhttps://tdmpc2.com\n","authors":["Nicklas Hansen","Hao Su","Xiaolong Wang"],"pdf_url":"https://arxiv.org/pdf/2310.16828v2.pdf","comment":"ICLR 2024. Explore videos, models, data, code, and more at\n  https://tdmpc2.com"},{"id":"http://arxiv.org/abs/2403.14605v1","updated":"2024-03-21T17:54:56Z","published":"2024-03-21T17:54:56Z","title":"SDP Synthesis of Maximum Coverage Trees for Probabilistic Planning under\n  Control Constraints","summary":"  The paper presents Maximal Covariance Backward Reachable Trees (MAXCOVAR\nBRT), which is a multi-query algorithm for planning of dynamic systems under\nstochastic motion uncertainty and constraints on the control input with\nexplicit coverage guarantees. In contrast to existing roadmap-based\nprobabilistic planning methods that sample belief nodes randomly and draw edges\nbetween them \\cite{csbrm_tro2024}, under control constraints, the reachability\nof belief nodes needs to be explicitly established and is determined by\nchecking the feasibility of a non-convex program. Moreover, there is no\nexplicit consideration of coverage of the roadmap while adding nodes and edges\nduring the construction procedure for the existing methods. Our contribution is\na novel optimization formulation to add nodes and construct the corresponding\nedge controllers such that the generated roadmap results in provably maximal\ncoverage under control constraints as compared to any other method of adding\nnodes and edges. We characterize formally the notion of coverage of a roadmap\nin this stochastic domain via introduction of the h-$\\operatorname{BRS}$\n(Backward Reachable Set of Distributions) of a tree of distributions under\ncontrol constraints, and also support our method with extensive simulations on\na 6 DoF model.\n","authors":["Naman Aggarwal","Jonathan P. How"],"pdf_url":"https://arxiv.org/pdf/2403.14605v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.14597v1","updated":"2024-03-21T17:50:22Z","published":"2024-03-21T17:50:22Z","title":"Extended Reality for Enhanced Human-Robot Collaboration: a\n  Human-in-the-Loop Approach","summary":"  The rise of automation has provided an opportunity to achieve higher\nefficiency in manufacturing processes, yet it often compromises the flexibility\nrequired to promptly respond to evolving market needs and meet the demand for\ncustomization. Human-robot collaboration attempts to tackle these challenges by\ncombining the strength and precision of machines with human ingenuity and\nperceptual understanding. In this paper, we conceptualize and propose an\nimplementation framework for an autonomous, machine learning-based manipulator\nthat incorporates human-in-the-loop principles and leverages Extended Reality\n(XR) to facilitate intuitive communication and programming between humans and\nrobots. Furthermore, the conceptual framework foresees human involvement\ndirectly in the robot learning process, resulting in higher adaptability and\ntask generalization. The paper highlights key technologies enabling the\nproposed framework, emphasizing the importance of developing the digital\necosystem as a whole. Additionally, we review the existent implementation\napproaches of XR in human-robot collaboration, showcasing diverse perspectives\nand methodologies. The challenges and future outlooks are discussed, delving\ninto the major obstacles and potential research avenues of XR for more natural\nhuman-robot interaction and integration in the industrial landscape.\n","authors":["Yehor Karpichev","Todd Charter","Homayoun Najjaran"],"pdf_url":"https://arxiv.org/pdf/2403.14597v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.14594v1","updated":"2024-03-21T17:49:26Z","published":"2024-03-21T17:49:26Z","title":"VXP: Voxel-Cross-Pixel Large-scale Image-LiDAR Place Recognition","summary":"  Recent works on the global place recognition treat the task as a retrieval\nproblem, where an off-the-shelf global descriptor is commonly designed in\nimage-based and LiDAR-based modalities. However, it is non-trivial to perform\naccurate image-LiDAR global place recognition since extracting consistent and\nrobust global descriptors from different domains (2D images and 3D point\nclouds) is challenging. To address this issue, we propose a novel\nVoxel-Cross-Pixel (VXP) approach, which establishes voxel and pixel\ncorrespondences in a self-supervised manner and brings them into a shared\nfeature space. Specifically, VXP is trained in a two-stage manner that first\nexplicitly exploits local feature correspondences and enforces similarity of\nglobal descriptors. Extensive experiments on the three benchmarks (Oxford\nRobotCar, ViViD++ and KITTI) demonstrate our method surpasses the\nstate-of-the-art cross-modal retrieval by a large margin.\n","authors":["Yun-Jin Li","Mariia Gladkova","Yan Xia","Rui Wang","Daniel Cremers"],"pdf_url":"https://arxiv.org/pdf/2403.14594v1.pdf","comment":"Project page https://yunjinli.github.io/projects-vxp/"},{"id":"http://arxiv.org/abs/2403.14583v1","updated":"2024-03-21T17:37:43Z","published":"2024-03-21T17:37:43Z","title":"Co-Optimization of Environment and Policies for Decentralized\n  Multi-Agent Navigation","summary":"  This work views the multi-agent system and its surrounding environment as a\nco-evolving system, where the behavior of one affects the other. The goal is to\ntake both agent actions and environment configurations as decision variables,\nand optimize these two components in a coordinated manner to improve some\nmeasure of interest. Towards this end, we consider the problem of decentralized\nmulti-agent navigation in cluttered environments. By introducing two\nsub-objectives of multi-agent navigation and environment optimization, we\npropose an $\\textit{agent-environment co-optimization}$ problem and develop a\n$\\textit{coordinated algorithm}$ that alternates between these sub-objectives\nto search for an optimal synthesis of agent actions and obstacle configurations\nin the environment; ultimately, improving the navigation performance. Due to\nthe challenge of explicitly modeling the relation between agents, environment\nand performance, we leverage policy gradient to formulate a model-free learning\nmechanism within the coordinated framework. A formal convergence analysis shows\nthat our coordinated algorithm tracks the local minimum trajectory of an\nassociated time-varying non-convex optimization problem. Extensive numerical\nresults corroborate theoretical findings and show the benefits of\nco-optimization over baselines. Interestingly, the results also indicate that\noptimized environment configurations are able to offer structural guidance that\nis key to de-conflicting agents in motion.\n","authors":["Zhan Gao","Guang Yang","Amanda Prorok"],"pdf_url":"https://arxiv.org/pdf/2403.14583v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2402.01477v2","updated":"2024-03-21T17:31:00Z","published":"2024-02-02T15:06:00Z","title":"A Modular Aerial System Based on Homogeneous Quadrotors with\n  Fault-Tolerant Control","summary":"  The standard quadrotor is one of the most popular and widely used aerial\nvehicle of recent decades, offering great maneuverability with mechanical\nsimplicity. However, the under-actuation characteristic limits its\napplications, especially when it comes to generating desired wrench with six\ndegrees of freedom (DOF). Therefore, existing work often compromises between\nmechanical complexity and the controllable DOF of the aerial system. To take\nadvantage of the mechanical simplicity of a standard quadrotor, we propose a\nmodular aerial system, IdentiQuad, that combines only homogeneous\nquadrotor-based modules. Each IdentiQuad can be operated alone like a standard\nquadrotor, but at the same time allows task-specific assembly, increasing the\ncontrollable DOF of the system. Each module is interchangeable within its\nassembly. We also propose a general controller for different configurations of\nassemblies, capable of tolerating rotor failures and balancing the energy\nconsumption of each module. The functionality and robustness of the system and\nits controller are validated using physics-based simulations for different\nassembly configurations.\n","authors":["Mengguang Li","Kai Cui","Heinz Koeppl"],"pdf_url":"https://arxiv.org/pdf/2402.01477v2.pdf","comment":"ICRA2024"},{"id":"http://arxiv.org/abs/2403.14545v1","updated":"2024-03-21T16:44:49Z","published":"2024-03-21T16:44:49Z","title":"Learning Hierarchical Control For Constrained Dynamic Task Assignment","summary":"  This paper introduces a novel data-driven hierarchical control scheme for\nmanaging a fleet of nonlinear, capacity-constrained autonomous agents in an\niterative environment. We propose a control framework consisting of a\nhigh-level dynamic task assignment and routing layer and low-level motion\nplanning and tracking layer. Each layer of the control hierarchy uses a\ndata-driven MPC policy, maintaining bounded computational complexity at each\ncalculation of a new task assignment or actuation input. We utilize collected\ndata to iteratively refine estimates of agent capacity usage, and update MPC\npolicy parameters accordingly. Our approach leverages tools from iterative\nlearning control to integrate learning at both levels of the hierarchy, and\ncoordinates learning between levels in order to maintain closed-loop\nfeasibility and performance improvement of the connected architecture.\n","authors":["Charlott Vallon","Alessandro Pinto","Bartolomeo Stellato","Francesco Borrelli"],"pdf_url":"https://arxiv.org/pdf/2403.14545v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2402.17587v2","updated":"2024-03-21T16:40:43Z","published":"2024-02-25T07:59:10Z","title":"Instance-aware Exploration-Verification-Exploitation for Instance\n  ImageGoal Navigation","summary":"  As a new embodied vision task, Instance ImageGoal Navigation (IIN) aims to\nnavigate to a specified object depicted by a goal image in an unexplored\nenvironment.\n  The main challenge of this task lies in identifying the target object from\ndifferent viewpoints while rejecting similar distractors.\n  Existing ImageGoal Navigation methods usually adopt the simple\nExploration-Exploitation framework and ignore the identification of specific\ninstance during navigation.\n  In this work, we propose to imitate the human behaviour of ``getting closer\nto confirm\" when distinguishing objects from a distance.\n  Specifically, we design a new modular navigation framework named\nInstance-aware Exploration-Verification-Exploitation (IEVE) for instance-level\nimage goal navigation.\n  Our method allows for active switching among the exploration, verification,\nand exploitation actions, thereby facilitating the agent in making reasonable\ndecisions under different situations.\n  On the challenging HabitatMatterport 3D semantic (HM3D-SEM) dataset, our\nmethod surpasses previous state-of-the-art work, with a classical segmentation\nmodel (0.684 vs. 0.561 success) or a robust model (0.702 vs. 0.561 success).\nOur code will be made publicly available at https://github.com/XiaohanLei/IEVE.\n","authors":["Xiaohan Lei","Min Wang","Wengang Zhou","Li Li","Houqiang Li"],"pdf_url":"https://arxiv.org/pdf/2402.17587v2.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.14526v1","updated":"2024-03-21T16:26:19Z","published":"2024-03-21T16:26:19Z","title":"Click to Grasp: Zero-Shot Precise Manipulation via Visual Diffusion\n  Descriptors","summary":"  Precise manipulation that is generalizable across scenes and objects remains\na persistent challenge in robotics. Current approaches for this task heavily\ndepend on having a significant number of training instances to handle objects\nwith pronounced visual and/or geometric part ambiguities. Our work explores the\ngrounding of fine-grained part descriptors for precise manipulation in a\nzero-shot setting by utilizing web-trained text-to-image diffusion-based\ngenerative models. We tackle the problem by framing it as a dense semantic part\ncorrespondence task. Our model returns a gripper pose for manipulating a\nspecific part, using as reference a user-defined click from a source image of a\nvisually different instance of the same object. We require no manual grasping\ndemonstrations as we leverage the intrinsic object geometry and features.\nPractical experiments in a real-world tabletop scenario validate the efficacy\nof our approach, demonstrating its potential for advancing semantic-aware\nrobotics manipulation. Web page: https://tsagkas.github.io/click2grasp\n","authors":["Nikolaos Tsagkas","Jack Rome","Subramanian Ramamoorthy","Oisin Mac Aodha","Chris Xiaoxuan Lu"],"pdf_url":"https://arxiv.org/pdf/2403.14526v1.pdf","comment":"8 pages, 4 figures"},{"id":"http://arxiv.org/abs/2303.12157v2","updated":"2024-03-21T16:09:57Z","published":"2023-03-21T19:34:20Z","title":"Learning a Depth Covariance Function","summary":"  We propose learning a depth covariance function with applications to\ngeometric vision tasks. Given RGB images as input, the covariance function can\nbe flexibly used to define priors over depth functions, predictive\ndistributions given observations, and methods for active point selection. We\nleverage these techniques for a selection of downstream tasks: depth\ncompletion, bundle adjustment, and monocular dense visual odometry.\n","authors":["Eric Dexheimer","Andrew J. Davison"],"pdf_url":"https://arxiv.org/pdf/2303.12157v2.pdf","comment":"CVPR 2023. Project page: https://edexheim.github.io/DepthCov/"},{"id":"http://arxiv.org/abs/2403.14488v1","updated":"2024-03-21T15:36:26Z","published":"2024-03-21T15:36:26Z","title":"Physics-Based Causal Reasoning for Safe & Robust Next-Best Action\n  Selection in Robot Manipulation Tasks","summary":"  Safe and efficient object manipulation is a key enabler of many real-world\nrobot applications. However, this is challenging because robot operation must\nbe robust to a range of sensor and actuator uncertainties. In this paper, we\npresent a physics-informed causal-inference-based framework for a robot to\nprobabilistically reason about candidate actions in a block stacking task in a\npartially observable setting. We integrate a physics-based simulation of the\nrigid-body system dynamics with a causal Bayesian network (CBN) formulation to\ndefine a causal generative probabilistic model of the robot decision-making\nprocess. Using simulation-based Monte Carlo experiments, we demonstrate our\nframework's ability to successfully: (1) predict block tower stability with\nhigh accuracy (Pred Acc: 88.6%); and, (2) select an approximate next-best\naction for the block stacking task, for execution by an integrated robot\nsystem, achieving 94.2% task success rate. We also demonstrate our framework's\nsuitability for real-world robot systems by demonstrating successful task\nexecutions with a domestic support robot, with perception and manipulation\nsub-system integration. Hence, we show that by embedding physics-based causal\nreasoning into robots' decision-making processes, we can make robot task\nexecution safer, more reliable, and more robust to various types of\nuncertainty.\n","authors":["Ricardo Cannizzaro","Michael Groom","Jonathan Routley","Robert Osazuwa Ness","Lars Kunze"],"pdf_url":"https://arxiv.org/pdf/2403.14488v1.pdf","comment":"8 pages, 9 figures, submitted to 2024 IEEE/RSJ International\n  Conference on Intelligent Robots and Systems (IROS)"},{"id":"http://arxiv.org/abs/2304.03133v2","updated":"2024-03-21T15:18:20Z","published":"2023-04-06T15:06:28Z","title":"Deep learning reduces sensor requirements for gust rejection on a small\n  uncrewed aerial vehicle morphing wing","summary":"  There is a growing need for uncrewed aerial vehicles (UAVs) to operate in\ncities. However, the uneven urban landscape and complex street systems cause\nlarge-scale wind gusts that challenge the safe and effective operation of UAVs.\nCurrent gust alleviation methods rely on traditional control surfaces and\ncomputationally expensive modeling to select a control action, leading to a\nslower response. Here, we used deep reinforcement learning to create an\nautonomous gust alleviation controller for a camber-morphing wing. This method\nreduced gust impact by 84%, directly from real-time, on-board pressure signals.\nNotably, we found that gust alleviation using signals from only three pressure\ntaps was statistically indistinguishable from using six signals. This\nreduced-sensor fly-by-feel control opens the door to UAV missions in previously\ninoperable locations.\n","authors":["Kevin PT. Haughn","Christina Harvey","Daniel J. Inman"],"pdf_url":"https://arxiv.org/pdf/2304.03133v2.pdf","comment":null},{"id":"http://arxiv.org/abs/2309.12001v3","updated":"2024-03-21T15:07:30Z","published":"2023-09-21T12:16:32Z","title":"Exploring Human's Gender Perception and Bias toward Non-Humanoid Robots","summary":"  As non-humanoid robots increasingly permeate various sectors, understanding\ntheir design implications for human acceptance becomes paramount. Despite their\nubiquity, studies on how to improve human interaction are sparse. Our\ninvestigation, conducted through two surveys, addresses this gap. The first\nsurvey emphasizes non-humanoid robots and human perceptions about gender\nattributions, suggesting that both design and perceived gender influence\nacceptance. Survey 2 investigates the effects of varying gender cues on robot\ndesigns and their consequent impacts on human-robot interactions. Our findings\nhighlighted that distinct gender cues can bolster or impede interaction\ncomfort.\n","authors":["Mahya Ramezani","Jose Luis Sanchez-Lopez"],"pdf_url":"https://arxiv.org/pdf/2309.12001v3.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.14449v1","updated":"2024-03-21T14:56:46Z","published":"2024-03-21T14:56:46Z","title":"Bringing Robots Home: The Rise of AI Robots in Consumer Electronics","summary":"  On March 18, 2024, NVIDIA unveiled Project GR00T, a general-purpose\nmultimodal generative AI model designed specifically for training humanoid\nrobots. Preceding this event, Tesla's unveiling of the Optimus Gen 2 humanoid\nrobot on December 12, 2023, underscored the profound impact robotics is poised\nto have on reshaping various facets of our daily lives. While robots have long\ndominated industrial settings, their presence within our homes is a burgeoning\nphenomenon. This can be attributed, in part, to the complexities of domestic\nenvironments and the challenges of creating robots that can seamlessly\nintegrate into our daily routines.\n","authors":["Haiwei Dong","Yang Liu","Ted Chu","Abdulmotaleb El Saddik"],"pdf_url":"https://arxiv.org/pdf/2403.14449v1.pdf","comment":"Accepted by IEEE Consumer Electronics Magazine"},{"id":"http://arxiv.org/abs/2403.14447v1","updated":"2024-03-21T14:53:50Z","published":"2024-03-21T14:53:50Z","title":"Exploring 3D Human Pose Estimation and Forecasting from the Robot's\n  Perspective: The HARPER Dataset","summary":"  We introduce HARPER, a novel dataset for 3D body pose estimation and forecast\nin dyadic interactions between users and \\spot, the quadruped robot\nmanufactured by Boston Dynamics. The key-novelty is the focus on the robot's\nperspective, i.e., on the data captured by the robot's sensors. These make 3D\nbody pose analysis challenging because being close to the ground captures\nhumans only partially. The scenario underlying HARPER includes 15 actions, of\nwhich 10 involve physical contact between the robot and users. The Corpus\ncontains not only the recordings of the built-in stereo cameras of Spot, but\nalso those of a 6-camera OptiTrack system (all recordings are synchronized).\nThis leads to ground-truth skeletal representations with a precision lower than\na millimeter. In addition, the Corpus includes reproducible benchmarks on 3D\nHuman Pose Estimation, Human Pose Forecasting, and Collision Prediction, all\nbased on publicly available baseline approaches. This enables future HARPER\nusers to rigorously compare their results with those we provide in this work.\n","authors":["Andrea Avogaro. Andrea Toaiari","Federico Cunico","Xiangmin Xu","Haralambos Dafas","Alessandro Vinciarelli","Emma Li","Marco Cristani"],"pdf_url":"https://arxiv.org/pdf/2403.14447v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.14414v1","updated":"2024-03-21T13:59:32Z","published":"2024-03-21T13:59:32Z","title":"Efficient Model Learning and Adaptive Tracking Control of Magnetic\n  Micro-Robots for Non-Contact Manipulation","summary":"  Magnetic microrobots can be navigated by an external magnetic field to\nautonomously move within living organisms with complex and unstructured\nenvironments. Potential applications include drug delivery, diagnostics, and\ntherapeutic interventions. Existing techniques commonly impart magnetic\nproperties to the target object,or drive the robot to contact and then\nmanipulate the object, both probably inducing physical damage. This paper\nconsiders a non-contact formulation, where the robot spins to generate a\nrepulsive field to push the object without physical contact. Under such a\nformulation, the main challenge is that the motion model between the input of\nthe magnetic field and the output velocity of the target object is commonly\nunknown and difficult to analyze. To deal with it, this paper proposes a\ndata-driven-based solution. A neural network is constructed to efficiently\nestimate the motion model. Then, an approximate model-based optimal control\nscheme is developed to push the object to track a time-varying trajectory,\nmaintaining the non-contact with distance constraints. Furthermore, a\nstraightforward planner is introduced to assess the adaptability of non-contact\nmanipulation in a cluttered unstructured environment. Experimental results are\npresented to show the tracking and navigation performance of the proposed\nscheme.\n","authors":["Yongyi Jia","Shu Miao","Junjian Zhou","Niandong Jiao","Lianqing Liu","Xiang Li"],"pdf_url":"https://arxiv.org/pdf/2403.14414v1.pdf","comment":"7 pages, 6 figures, received by 2024 IEEE International Conference on\n  Robotics and Automation"},{"id":"http://arxiv.org/abs/2402.16348v2","updated":"2024-03-21T13:58:30Z","published":"2024-02-26T07:02:05Z","title":"Star-Searcher: A Complete and Efficient Aerial System for Autonomous\n  Target Search in Complex Unknown Environments","summary":"  This paper tackles the challenge of autonomous target search using unmanned\naerial vehicles (UAVs) in complex unknown environments. To fill the gap in\nsystematic approaches for this task, we introduce Star-Searcher, an aerial\nsystem featuring specialized sensor suites, mapping, and planning modules to\noptimize searching. Path planning challenges due to increased inspection\nrequirements are addressed through a hierarchical planner with a\nvisibility-based viewpoint clustering method. This simplifies planning by\nbreaking it into global and local sub-problems, ensuring efficient global and\nlocal path coverage in real-time. Furthermore, our global path planning employs\na history-aware mechanism to reduce motion inconsistency from frequent map\nchanges, significantly enhancing search efficiency. We conduct comparisons with\nstate-of-the-art methods in both simulation and the real world, demonstrating\nshorter flight paths, reduced time, and higher target search completeness. Our\napproach will be open-sourced for community benefit at\nhttps://github.com/SYSU-STAR/STAR-Searcher.\n","authors":["Yiming Luo","Zixuan Zhuang","Neng Pan","Chen Feng","Shaojie Shen","Fei Gao","Hui Cheng","Boyu Zhou"],"pdf_url":"https://arxiv.org/pdf/2402.16348v2.pdf","comment":"Aceepted to IEEE RA-L. Code:\n  https://github.com/SYSU-STAR/STAR-Searcher. Video:\n  https://www.youtube.com/watch?v=08ll_oo_DtU"},{"id":"http://arxiv.org/abs/2401.15174v2","updated":"2024-03-21T13:16:13Z","published":"2024-01-26T19:39:33Z","title":"Large Language Models for Multi-Modal Human-Robot Interaction","summary":"  This paper presents an innovative large language model (LLM)-based robotic\nsystem for enhancing multi-modal human-robot interaction (HRI). Traditional HRI\nsystems relied on complex designs for intent estimation, reasoning, and\nbehavior generation, which were resource-intensive. In contrast, our system\nempowers researchers and practitioners to regulate robot behavior through three\nkey aspects: providing high-level linguistic guidance, creating \"atomics\" for\nactions and expressions the robot can use, and offering a set of examples.\nImplemented on a physical robot, it demonstrates proficiency in adapting to\nmulti-modal inputs and determining the appropriate manner of action to assist\nhumans with its arms, following researchers' defined guidelines.\nSimultaneously, it coordinates the robot's lid, neck, and ear movements with\nspeech output to produce dynamic, multi-modal expressions. This showcases the\nsystem's potential to revolutionize HRI by shifting from conventional, manual\nstate-and-flow design methods to an intuitive, guidance-based, and\nexample-driven approach.\n","authors":["Chao Wang","Stephan Hasler","Daniel Tanneberg","Felix Ocker","Frank Joublin","Antonello Ceravola","Joerg Deigmoeller","Michael Gienger"],"pdf_url":"https://arxiv.org/pdf/2401.15174v2.pdf","comment":"10 pages, 6 figures"},{"id":"http://arxiv.org/abs/2401.16899v2","updated":"2024-03-21T12:56:24Z","published":"2024-01-30T11:05:43Z","title":"MAkEable: Memory-centered and Affordance-based Task Execution Framework\n  for Transferable Mobile Manipulation Skills","summary":"  To perform versatile mobile manipulation tasks in human-centered\nenvironments, the ability to efficiently transfer learned tasks and experiences\nfrom one robot to another or across different environments is key. In this\npaper, we present MAkEable, a versatile uni- and multi-manual mobile\nmanipulation framework that facilitates the transfer of capabilities and\nknowledge across different tasks, environments, and robots. Our framework\nintegrates an affordance-based task description into the memory-centric\ncognitive architecture of the ARMAR humanoid robot family, which supports the\nsharing of experiences and demonstrations for transfer learning. By\nrepresenting mobile manipulation actions through affordances, i.e., interaction\npossibilities of the robot with its environment, we provide a unifying\nframework for the autonomous uni- and multi-manual manipulation of known and\nunknown objects in various environments. We demonstrate the applicability of\nthe framework in real-world experiments for multiple robots, tasks, and\nenvironments. This includes grasping known and unknown objects, object placing,\nbimanual object grasping, memory-enabled skill transfer in a drawer opening\nscenario across two different humanoid robots, and a pouring task learned from\nhuman demonstration.\n","authors":["Christoph Pohl","Fabian Reister","Fabian Peller-Konrad","Tamim Asfour"],"pdf_url":"https://arxiv.org/pdf/2401.16899v2.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.14353v1","updated":"2024-03-21T12:28:44Z","published":"2024-03-21T12:28:44Z","title":"DaCapo: Accelerating Continuous Learning in Autonomous Systems for Video\n  Analytics","summary":"  Deep neural network (DNN) video analytics is crucial for autonomous systems\nsuch as self-driving vehicles, unmanned aerial vehicles (UAVs), and security\nrobots. However, real-world deployment faces challenges due to their limited\ncomputational resources and battery power. To tackle these challenges,\ncontinuous learning exploits a lightweight \"student\" model at deployment\n(inference), leverages a larger \"teacher\" model for labeling sampled data\n(labeling), and continuously retrains the student model to adapt to changing\nscenarios (retraining). This paper highlights the limitations in\nstate-of-the-art continuous learning systems: (1) they focus on computations\nfor retraining, while overlooking the compute needs for inference and labeling,\n(2) they rely on power-hungry GPUs, unsuitable for battery-operated autonomous\nsystems, and (3) they are located on a remote centralized server, intended for\nmulti-tenant scenarios, again unsuitable for autonomous systems due to privacy,\nnetwork availability, and latency concerns. We propose a hardware-algorithm\nco-designed solution for continuous learning, DaCapo, that enables autonomous\nsystems to perform concurrent executions of inference, labeling, and training\nin a performant and energy-efficient manner. DaCapo comprises (1) a\nspatially-partitionable and precision-flexible accelerator enabling parallel\nexecution of kernels on sub-accelerators at their respective precisions, and\n(2) a spatiotemporal resource allocation algorithm that strategically navigates\nthe resource-accuracy tradeoff space, facilitating optimal decisions for\nresource allocation to achieve maximal accuracy. Our evaluation shows that\nDaCapo achieves 6.5% and 5.5% higher accuracy than a state-of-the-art GPU-based\ncontinuous learning systems, Ekya and EOMU, respectively, while consuming 254x\nless power.\n","authors":["Yoonsung Kim","Changhun Oh","Jinwoo Hwang","Wonung Kim","Seongryong Oh","Yubin Lee","Hardik Sharma","Amir Yazdanbakhsh","Jongse Park"],"pdf_url":"https://arxiv.org/pdf/2403.14353v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.14347v1","updated":"2024-03-21T12:24:01Z","published":"2024-03-21T12:24:01Z","title":"A Comparative Study of Real-Time Implementable Cooperative Aerial\n  Manipulation Systems","summary":"  This survey paper focuses on quadrotor- and multirotor- based cooperative\naerial manipulation. Emphasis is first given on comparing and evaluating\nprototype systems that have been implemented and tested in real-time in diverse\napplication environments. Underlying modeling and control approaches are also\ndiscussed and compared. The outcome of the survey allows for understanding the\nmotivation and rationale to develop such systems, their applicability and\nimplementability in diverse applications and also challenges that need to be\naddressed and overcome. Moreover, the survey provides a guide to develop the\nnext generation of prototype systems based on preferred characteristics,\nfunctionality, operability and application domain.\n","authors":["Stamatina C. Barakou","Costas S. Tzafestas","Kimon P. Valavanis"],"pdf_url":"https://arxiv.org/pdf/2403.14347v1.pdf","comment":"Submitted to MDPI Drones"},{"id":"http://arxiv.org/abs/2403.14344v1","updated":"2024-03-21T12:22:47Z","published":"2024-03-21T12:22:47Z","title":"Tell Me What You Want (What You Really, Really Want): Addressing the\n  Expectation Gap for Goal Conveyance from Humans to Robots","summary":"  Conveying human goals to autonomous systems (AS) occurs both when the system\nis being designed and when it is being operated. The design-step conveyance is\ntypically mediated by robotics and AI engineers, who must appropriately capture\nend-user requirements and concepts of operations, while the operation-step\nconveyance is mediated by the design, interfaces, and behavior of the AI.\nHowever, communication can be difficult during both these periods because of\nmismatches in the expectations and expertise of the end-user and the\nroboticist, necessitating more design cycles to resolve. We examine some of the\nbarriers in communicating system design requirements, and develop an\naugmentation for applied cognitive task analysis (ACTA) methods, that we call\nrobot task analysis (RTA), pertaining specifically to the development of\nautonomous systems. Further, we introduce a top-down view of an underexplored\narea of friction between requirements communication -- implied human\nexpectations -- utilizing a collection of work primarily from experimental\npsychology and social sciences. We show how such expectations can be used in\nconjunction with task-specific expectations and the system design process for\nAS to improve design team communication, alleviate barriers to user rejection,\nand reduce the number of design cycles.\n","authors":["Kevin Leahy","Ho Chit Siu"],"pdf_url":"https://arxiv.org/pdf/2403.14344v1.pdf","comment":"Presented at the End-User Development for Human-Robot Interaction\n  (EUD4HRI) workshop at HRI 2024"},{"id":"http://arxiv.org/abs/2403.12670v2","updated":"2024-03-21T12:14:14Z","published":"2024-03-19T12:11:57Z","title":"Driving Animatronic Robot Facial Expression From Speech","summary":"  Animatronic robots aim to enable natural human-robot interaction through\nlifelike facial expressions. However, generating realistic, speech-synchronized\nrobot expressions is challenging due to the complexities of facial biomechanics\nand responsive motion synthesis. This paper presents a principled,\nskinning-centric approach to drive animatronic robot facial expressions from\nspeech. The proposed approach employs linear blend skinning (LBS) as the core\nrepresentation to guide tightly integrated innovations in embodiment design and\nmotion synthesis. LBS informs the actuation topology, enables human expression\nretargeting, and allows speech-driven facial motion generation. The proposed\napproach is capable of generating highly realistic, real-time facial\nexpressions from speech on an animatronic face, significantly advancing robots'\nability to replicate nuanced human expressions for natural interaction.\n","authors":["Boren Li","Hang Li","Hangxin Liu"],"pdf_url":"https://arxiv.org/pdf/2403.12670v2.pdf","comment":"Under review. For associated project page, see\n  https://library87.github.io/animatronic-face-iros24"},{"id":"http://arxiv.org/abs/2402.16068v3","updated":"2024-03-21T11:58:49Z","published":"2024-02-25T11:37:23Z","title":"ROS-Causal: A ROS-based Causal Analysis Framework for Human-Robot\n  Interaction Applications","summary":"  Deploying robots in human-shared spaces requires understanding interactions\namong nearby agents and objects. Modelling cause-and-effect relations through\ncausal inference aids in predicting human behaviours and anticipating robot\ninterventions. However, a critical challenge arises as existing causal\ndiscovery methods currently lack an implementation inside the ROS ecosystem,\nthe standard de facto in robotics, hindering effective utilisation in robotics.\nTo address this gap, this paper introduces ROS-Causal, a ROS-based framework\nfor onboard data collection and causal discovery in human-robot spatial\ninteractions. An ad-hoc simulator, integrated with ROS, illustrates the\napproach's effectiveness, showcasing the robot onboard generation of causal\nmodels during data collection. ROS-Causal is available on GitHub:\nhttps://github.com/lcastri/roscausal.git.\n","authors":["Luca Castri","Gloria Beraldo","Sariah Mghames","Marc Hanheide","Nicola Bellotto"],"pdf_url":"https://arxiv.org/pdf/2402.16068v3.pdf","comment":"Accepted by the \"Causal-HRI: Causal Learning for Human-Robot\n  Interaction\" workshop at the 2024 ACM/IEEE International Conference on\n  Human-Robot Interaction (HRI)"},{"id":"http://arxiv.org/abs/2403.14328v1","updated":"2024-03-21T11:54:45Z","published":"2024-03-21T11:54:45Z","title":"Distilling Reinforcement Learning Policies for Interpretable Robot\n  Locomotion: Gradient Boosting Machines and Symbolic Regression","summary":"  Recent advancements in reinforcement learning (RL) have led to remarkable\nachievements in robot locomotion capabilities. However, the complexity and\n``black-box'' nature of neural network-based RL policies hinder their\ninterpretability and broader acceptance, particularly in applications demanding\nhigh levels of safety and reliability. This paper introduces a novel approach\nto distill neural RL policies into more interpretable forms using Gradient\nBoosting Machines (GBMs), Explainable Boosting Machines (EBMs) and Symbolic\nRegression. By leveraging the inherent interpretability of generalized additive\nmodels, decision trees, and analytical expressions, we transform opaque neural\nnetwork policies into more transparent ``glass-box'' models. We train expert\nneural network policies using RL and subsequently distill them into (i) GBMs,\n(ii) EBMs, and (iii) symbolic policies. To address the inherent distribution\nshift challenge of behavioral cloning, we propose to use the Dataset\nAggregation (DAgger) algorithm with a curriculum of episode-dependent\nalternation of actions between expert and distilled policies, to enable\nefficient distillation of feedback control policies. We evaluate our approach\non various robot locomotion gaits -- walking, trotting, bounding, and pacing --\nand study the importance of different observations in joint actions for\ndistilled policies using various methods. We train neural expert policies for\n205 hours of simulated experience and distill interpretable policies with only\n10 minutes of simulated interaction for each gait using the proposed method.\n","authors":["Fernando Acero","Zhibin Li"],"pdf_url":"https://arxiv.org/pdf/2403.14328v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.14326v1","updated":"2024-03-21T11:50:00Z","published":"2024-03-21T11:50:00Z","title":"Evaluation and Deployment of LiDAR-based Place Recognition in Dense\n  Forests","summary":"  Many LiDAR place recognition systems have been developed and tested\nspecifically for urban driving scenarios. Their performance in natural\nenvironments such as forests and woodlands have been studied less closely. In\nthis paper, we analyzed the capabilities of four different LiDAR place\nrecognition systems, both handcrafted and learning-based methods, using LiDAR\ndata collected with a handheld device and legged robot within dense forest\nenvironments. In particular, we focused on evaluating localization where there\nis significant translational and orientation difference between corresponding\nLiDAR scan pairs. This is particularly important for forest survey systems\nwhere the sensor or robot does not follow a defined road or path. Extending our\nanalysis we then incorporated the best performing approach, Logg3dNet, into a\nfull 6-DoF pose estimation system -- introducing several verification layers\nfor precise registration. We demonstrated the performance of our methods in\nthree operational modes: online SLAM, offline multi-mission SLAM map merging,\nand relocalization into a prior map. We evaluated these modes using data\ncaptured in forests from three different countries, achieving 80% of correct\nloop closures candidates with baseline distances up to 5m, and 60% up to 10m.\n","authors":["Haedam Oh","Nived Chebrolu","Matias Mattamala","Leonard Freißmuth","Maurice Fallon"],"pdf_url":"https://arxiv.org/pdf/2403.14326v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.14320v1","updated":"2024-03-21T11:41:39Z","published":"2024-03-21T11:41:39Z","title":"Exosense: A Vision-Centric Scene Understanding System For Safe\n  Exoskeleton Navigation","summary":"  Exoskeletons for daily use by those with mobility impairments are being\ndeveloped. They will require accurate and robust scene understanding systems.\nCurrent research has used vision to identify immediate terrain and geometric\nobstacles, however these approaches are constrained to detections directly in\nfront of the user and are limited to classifying a finite range of terrain\ntypes (e.g., stairs, ramps and level-ground). This paper presents Exosense, a\nvision-centric scene understanding system which is capable of generating rich,\nglobally-consistent elevation maps, incorporating both semantic and terrain\ntraversability information. It features an elastic Atlas mapping framework\nassociated with a visual SLAM pose graph, embedded with open-vocabulary room\nlabels from a Vision-Language Model (VLM). The device's design includes a wide\nfield-of-view (FoV) fisheye multi-camera system to mitigate the challenges\nintroduced by the exoskeleton walking pattern. We demonstrate the system's\nrobustness to the challenges of typical periodic walking gaits, and its ability\nto construct accurate semantically-rich maps in indoor settings. Additionally,\nwe showcase its potential for motion planning -- providing a step towards safe\nnavigation for exoskeletons.\n","authors":["Jianeng Wang","Matias Mattamala","Christina Kassab","Lintong Zhang","Maurice Fallon"],"pdf_url":"https://arxiv.org/pdf/2403.14320v1.pdf","comment":"8 pages, 10 figures"},{"id":"http://arxiv.org/abs/2403.14305v1","updated":"2024-03-21T11:21:17Z","published":"2024-03-21T11:21:17Z","title":"Bayesian Optimization for Sample-Efficient Policy Improvement in Robotic\n  Manipulation","summary":"  Sample efficient learning of manipulation skills poses a major challenge in\nrobotics. While recent approaches demonstrate impressive advances in the type\nof task that can be addressed and the sensing modalities that can be\nincorporated, they still require large amounts of training data. Especially\nwith regard to learning actions on robots in the real world, this poses a major\nproblem due to the high costs associated with both demonstrations and\nreal-world robot interactions. To address this challenge, we introduce\nBOpt-GMM, a hybrid approach that combines imitation learning with own\nexperience collection. We first learn a skill model as a dynamical system\nencoded in a Gaussian Mixture Model from a few demonstrations. We then improve\nthis model with Bayesian optimization building on a small number of autonomous\nskill executions in a sparse reward setting. We demonstrate the sample\nefficiency of our approach on multiple complex manipulation skills in both\nsimulations and real-world experiments. Furthermore, we make the code and\npre-trained models publicly available at http://bopt-gmm. cs.uni-freiburg.de.\n","authors":["Adrian Röfer","Iman Nematollahi","Tim Welschehold","Wolfram Burgard","Abhinav Valada"],"pdf_url":"https://arxiv.org/pdf/2403.14305v1.pdf","comment":"7 pages, 5 figures, 2 tables, submitted to IROS2024"},{"id":"http://arxiv.org/abs/2403.14300v1","updated":"2024-03-21T11:16:28Z","published":"2024-03-21T11:16:28Z","title":"DexDribbler: Learning Dexterous Soccer Manipulation via Dynamic\n  Supervision","summary":"  Learning dexterous locomotion policy for legged robots is becoming\nincreasingly popular due to its ability to handle diverse terrains and resemble\nintelligent behaviors. However, joint manipulation of moving objects and\nlocomotion with legs, such as playing soccer, receive scant attention in the\nlearning community, although it is natural for humans and smart animals. A key\nchallenge to solve this multitask problem is to infer the objectives of\nlocomotion from the states and targets of the manipulated objects. The implicit\nrelation between the object states and robot locomotion can be hard to capture\ndirectly from the training experience. We propose adding a feedback control\nblock to compute the necessary body-level movement accurately and using the\noutputs as dynamic joint-level locomotion supervision explicitly. We further\nutilize an improved ball dynamic model, an extended context-aided estimator,\nand a comprehensive ball observer to facilitate transferring policy learned in\nsimulation to the real world. We observe that our learning scheme can not only\nmake the policy network converge faster but also enable soccer robots to\nperform sophisticated maneuvers like sharp cuts and turns on flat surfaces, a\ncapability that was lacking in previous methods. Video and code are available\nat https://github.com/SysCV/soccer-player\n","authors":["Yutong Hu","Kehan Wen","Fisher Yu"],"pdf_url":"https://arxiv.org/pdf/2403.14300v1.pdf","comment":"8 pages, 7 figures, submitted to IROS 2024"},{"id":"http://arxiv.org/abs/2312.07214v3","updated":"2024-03-21T11:12:31Z","published":"2023-12-12T12:26:48Z","title":"Exploring Large Language Models to Facilitate Variable Autonomy for\n  Human-Robot Teaming","summary":"  In a rapidly evolving digital landscape autonomous tools and robots are\nbecoming commonplace. Recognizing the significance of this development, this\npaper explores the integration of Large Language Models (LLMs) like Generative\npre-trained transformer (GPT) into human-robot teaming environments to\nfacilitate variable autonomy through the means of verbal human-robot\ncommunication. In this paper, we introduce a novel framework for such a\nGPT-powered multi-robot testbed environment, based on a Unity Virtual Reality\n(VR) setting. This system allows users to interact with robot agents through\nnatural language, each powered by individual GPT cores. By means of OpenAI's\nfunction calling, we bridge the gap between unstructured natural language input\nand structure robot actions. A user study with 12 participants explores the\neffectiveness of GPT-4 and, more importantly, user strategies when being given\nthe opportunity to converse in natural language within a multi-robot\nenvironment. Our findings suggest that users may have preconceived expectations\non how to converse with robots and seldom try to explore the actual language\nand cognitive capabilities of their robot collaborators. Still, those users who\ndid explore where able to benefit from a much more natural flow of\ncommunication and human-like back-and-forth. We provide a set of lessons\nlearned for future research and technical implementations of similar systems.\n","authors":["Younes Lakhnati","Max Pascher","Jens Gerken"],"pdf_url":"https://arxiv.org/pdf/2312.07214v3.pdf","comment":"Frontiers in Robotics and AI, Variable Autonomy for Human-Robot\n  Teaming"},{"id":"http://arxiv.org/abs/2403.14293v1","updated":"2024-03-21T11:00:11Z","published":"2024-03-21T11:00:11Z","title":"Human Reactions to Incorrect Answers from Robots","summary":"  As robots grow more and more integrated into numerous industries, it is\ncritical to comprehend how humans respond to their failures. This paper\nsystematically studies how trust dynamics and system design are affected by\nhuman responses to robot failures. The three-stage survey used in the study\nprovides a thorough understanding of human-robot interactions. While the second\nstage concentrates on interaction details, such as robot precision and error\nacknowledgment, the first stage collects demographic data and initial levels of\ntrust. In the last phase, participants' perceptions are examined after the\nencounter, and trust dynamics, forgiveness, and propensity to suggest robotic\ntechnologies are evaluated. Results show that participants' trust in robotic\ntechnologies increased significantly when robots acknowledged their errors or\nlimitations to participants and their willingness to suggest robots for\nactivities in the future points to a favorable change in perception,\nemphasizing the role that direct engagement has in influencing trust dynamics.\nBy providing useful advice for creating more sympathetic, responsive, and\nreliable robotic systems, the study advances the science of human-robot\ninteraction and promotes a wider adoption of robotic technologies.\n","authors":["Ponkoj Chandra Shill","Md. Azizul Hakim","Muhammad Jahanzeb Khan","Bashira Akter Anima"],"pdf_url":"https://arxiv.org/pdf/2403.14293v1.pdf","comment":"6 pages, 6 figures, 1 table, Ro-Man 2024"},{"id":"http://arxiv.org/abs/2403.14281v1","updated":"2024-03-21T10:41:31Z","published":"2024-03-21T10:41:31Z","title":"UAV-Assisted Maritime Search and Rescue: A Holistic Approach","summary":"  In this paper, we explore the application of Unmanned Aerial Vehicles (UAVs)\nin maritime search and rescue (mSAR) missions, focusing on medium-sized\nfixed-wing drones and quadcopters. We address the challenges and limitations\ninherent in operating some of the different classes of UAVs, particularly in\nsearch operations. Our research includes the development of a comprehensive\nsoftware framework designed to enhance the efficiency and efficacy of SAR\noperations. This framework combines preliminary detection onboard UAVs with\nadvanced object detection at ground stations, aiming to reduce visual strain\nand improve decision-making for operators. It will be made publicly available\nupon publication. We conduct experiments to evaluate various Region of Interest\n(RoI) proposal methods, especially by imposing simulated limited bandwidth on\nthem, an important consideration when flying remote or offshore operations.\nThis forces the algorithm to prioritize some predictions over others.\n","authors":["Martin Messmer","Benjamin Kiefer","Leon Amadeus Varga","Andreas Zell"],"pdf_url":"https://arxiv.org/pdf/2403.14281v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2402.00823v2","updated":"2024-03-21T10:21:37Z","published":"2024-02-01T18:07:33Z","title":"SLIM: Skill Learning with Multiple Critics","summary":"  Self-supervised skill learning aims to acquire useful behaviors that leverage\nthe underlying dynamics of the environment. Latent variable models, based on\nmutual information maximization, have been successful in this task but still\nstruggle in the context of robotic manipulation. As it requires impacting a\npossibly large set of degrees of freedom composing the environment, mutual\ninformation maximization fails alone in producing useful and safe manipulation\nbehaviors. Furthermore, tackling this by augmenting skill discovery rewards\nwith additional rewards through a naive combination might fail to produce\ndesired behaviors. To address this limitation, we introduce SLIM, a\nmulti-critic learning approach for skill discovery with a particular focus on\nrobotic manipulation. Our main insight is that utilizing multiple critics in an\nactor-critic framework to gracefully combine multiple reward functions leads to\na significant improvement in latent-variable skill discovery for robotic\nmanipulation while overcoming possible interference occurring among rewards\nwhich hinders convergence to useful skills. Furthermore, in the context of\ntabletop manipulation, we demonstrate the applicability of our novel skill\ndiscovery approach to acquire safe and efficient motor primitives in a\nhierarchical reinforcement learning fashion and leverage them through planning,\nsignificantly surpassing baseline approaches for skill discovery.\n","authors":["David Emukpere","Bingbing Wu","Julien Perez","Jean-Michel Renders"],"pdf_url":"https://arxiv.org/pdf/2402.00823v2.pdf","comment":"Accepted at IEEE ICRA 2024"},{"id":"http://arxiv.org/abs/2403.14270v1","updated":"2024-03-21T10:15:57Z","published":"2024-03-21T10:15:57Z","title":"Scene-Graph ViT: End-to-End Open-Vocabulary Visual Relationship\n  Detection","summary":"  Visual relationship detection aims to identify objects and their\nrelationships in images. Prior methods approach this task by adding separate\nrelationship modules or decoders to existing object detection architectures.\nThis separation increases complexity and hinders end-to-end training, which\nlimits performance. We propose a simple and highly efficient decoder-free\narchitecture for open-vocabulary visual relationship detection. Our model\nconsists of a Transformer-based image encoder that represents objects as tokens\nand models their relationships implicitly. To extract relationship information,\nwe introduce an attention mechanism that selects object pairs likely to form a\nrelationship. We provide a single-stage recipe to train this model on a mixture\nof object and relationship detection data. Our approach achieves\nstate-of-the-art relationship detection performance on Visual Genome and on the\nlarge-vocabulary GQA benchmark at real-time inference speeds. We provide\nanalyses of zero-shot performance, ablations, and real-world qualitative\nexamples.\n","authors":["Tim Salzmann","Markus Ryll","Alex Bewley","Matthias Minderer"],"pdf_url":"https://arxiv.org/pdf/2403.14270v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.11567v2","updated":"2024-03-21T10:04:26Z","published":"2024-03-18T08:41:36Z","title":"R2SNet: Scalable Domain Adaptation for Object Detection in Cloud-Based\n  Robots Ecosystems via Proposal Refinement","summary":"  We introduce a novel approach for scalable domain adaptation in cloud\nrobotics scenarios where robots rely on third-party AI inference services\npowered by large pre-trained deep neural networks. Our method is based on a\ndownstream proposal-refinement stage running locally on the robots, exploiting\na new lightweight DNN architecture, R2SNet. This architecture aims to mitigate\nperformance degradation from domain shifts by adapting the object detection\nprocess to the target environment, focusing on relabeling, rescoring, and\nsuppression of bounding-box proposals. Our method allows for local execution on\nrobots, addressing the scalability challenges of domain adaptation without\nincurring significant computational costs. Real-world results on mobile service\nrobots performing door detection show the effectiveness of the proposed method\nin achieving scalable domain adaptation.\n","authors":["Michele Antonazzi","Matteo Luperto","N. Alberto Borghese","Nicola Basilico"],"pdf_url":"https://arxiv.org/pdf/2403.11567v2.pdf","comment":null},{"id":"http://arxiv.org/abs/2203.09337v4","updated":"2024-03-21T09:34:49Z","published":"2022-03-17T14:13:19Z","title":"CoBRA: A Composable Benchmark for Robotics Applications","summary":"  Selecting an optimal robot, its base pose, and trajectory for a given task is\ncurrently mainly done by human expertise or trial and error. To evaluate\nautomatic approaches to this combined optimization problem, we introduce a\nbenchmark suite encompassing a unified format for robots, environments, and\ntask descriptions. Our benchmark suite is especially useful for modular robots,\nwhere the multitude of robots that can be assembled creates a host of\nadditional parameters to optimize. We include tasks such as machine tending and\nwelding in synthetic environments and 3D scans of real-world machine shops. All\nbenchmarks are accessible through https://cobra.cps.cit.tum.de, a platform to\nconveniently share, reference, and compare tasks, robot models, and solutions.\n","authors":["Matthias Mayer","Jonathan Külz","Matthias Althoff"],"pdf_url":"https://arxiv.org/pdf/2203.09337v4.pdf","comment":"7 pages, 5 Figures, 5 Tables Final version for IEEE ICRA'24"},{"id":"http://arxiv.org/abs/2308.03574v2","updated":"2024-03-21T09:13:17Z","published":"2023-08-07T13:25:48Z","title":"Generalized Early Stopping in Evolutionary Direct Policy Search","summary":"  Lengthy evaluation times are common in many optimization problems such as\ndirect policy search tasks, especially when they involve conducting evaluations\nin the physical world, e.g. in robotics applications. Often when evaluating\nsolution over a fixed time period it becomes clear that the objective value\nwill not increase with additional computation time (for example when a two\nwheeled robot continuously spins on the spot). In such cases, it makes sense to\nstop the evaluation early to save computation time. However, most approaches to\nstop the evaluation are problem specific and need to be specifically designed\nfor the task at hand. Therefore, we propose an early stopping method for direct\npolicy search. The proposed method only looks at the objective value at each\ntime step and requires no problem specific knowledge. We test the introduced\nstopping criterion in five direct policy search environments drawn from games,\nrobotics and classic control domains, and show that it can save up to 75% of\nthe computation time. We also compare it with problem specific stopping\ncriteria and show that it performs comparably, while being more generally\napplicable.\n","authors":["Etor Arza","Leni K. Le Goff","Emma Hart"],"pdf_url":"https://arxiv.org/pdf/2308.03574v2.pdf","comment":null},{"id":"http://arxiv.org/abs/2311.08244v2","updated":"2024-03-21T08:02:59Z","published":"2023-11-14T15:29:52Z","title":"Language and Sketching: An LLM-driven Interactive Multimodal Multitask\n  Robot Navigation Framework","summary":"  The socially-aware navigation system has evolved to adeptly avoid various\nobstacles while performing multiple tasks, such as point-to-point navigation,\nhuman-following, and -guiding. However, a prominent gap persists: in\nHuman-Robot Interaction (HRI), the procedure of communicating commands to\nrobots demands intricate mathematical formulations. Furthermore, the transition\nbetween tasks does not quite possess the intuitive control and user-centric\ninteractivity that one would desire. In this work, we propose an LLM-driven\ninteractive multimodal multitask robot navigation framework, termed LIM2N, to\nsolve the above new challenge in the navigation field. We achieve this by first\nintroducing a multimodal interaction framework where language and hand-drawn\ninputs can serve as navigation constraints and control objectives. Next, a\nreinforcement learning agent is built to handle multiple tasks with the\nreceived information. Crucially, LIM2N creates smooth cooperation among the\nreasoning of multimodal input, multitask planning, and adaptation and\nprocessing of the intelligent sensing modules in the complicated system.\nExtensive experiments are conducted in both simulation and the real world\ndemonstrating that LIM2N has superior user needs understanding, alongside an\nenhanced interactive experience.\n","authors":["Weiqin Zu","Wenbin Song","Ruiqing Chen","Ze Guo","Fanglei Sun","Zheng Tian","Wei Pan","Jun Wang"],"pdf_url":"https://arxiv.org/pdf/2311.08244v2.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.14176v1","updated":"2024-03-21T06:57:28Z","published":"2024-03-21T06:57:28Z","title":"ReFeree: Radar-based efficient global descriptor using a Feature and\n  Free space for Place Recognition","summary":"  Radar is highlighted for robust sensing capabilities in adverse weather\nconditions (e.g. dense fog, heavy rain, or snowfall). In addition, Radar can\ncover wide areas and penetrate small particles. Despite these advantages,\nRadar-based place recognition remains in the early stages compared to other\nsensors due to its unique characteristics such as low resolution, and\nsignificant noise. In this paper, we propose a Radarbased place recognition\nutilizing a descriptor called ReFeree using a feature and free space. Unlike\ntraditional methods, we overwhelmingly summarize the Radar image. Despite being\nlightweight, it contains semi-metric information and is also outstanding from\nthe perspective of place recognition performance. For concrete validation, we\ntest a single session from the MulRan dataset and a multi-session from the\nOxford Radar RobotCar and the Boreas dataset.\n","authors":["Byunghee Choi","Hogyun Kim","Younggun Cho"],"pdf_url":"https://arxiv.org/pdf/2403.14176v1.pdf","comment":"5 pages, 4 figures"},{"id":"http://arxiv.org/abs/2403.14173v1","updated":"2024-03-21T06:53:20Z","published":"2024-03-21T06:53:20Z","title":"HCTO: Optimality-Aware LiDAR Inertial Odometry with Hybrid Continuous\n  Time Optimization for Compact Wearable Mapping System","summary":"  Compact wearable mapping system (WMS) has gained significant attention due to\ntheir convenience in various applications. Specifically, it provides an\nefficient way to collect prior maps for 3D structure inspection and robot-based\n\"last-mile delivery\" in complex environments. However, vibrations in human\nmotion and the uneven distribution of point cloud features in complex\nenvironments often lead to rapid drift, which is a prevalent issue when\napplying existing LiDAR Inertial Odometry (LIO) methods on low-cost WMS. To\naddress these limitations, we propose a novel LIO for WMSs based on Hybrid\nContinuous Time Optimization (HCTO) considering the optimality of Lidar\ncorrespondences. First, HCTO recognizes patterns in human motion\n(high-frequency part, low-frequency part, and constant velocity part) by\nanalyzing raw IMU measurements. Second, HCTO constructs hybrid IMU factors\naccording to different motion states, which enables robust and accurate\nestimation against vibration-induced noise in the IMU measurements. Third, the\nbest point correspondences are selected using optimal design to achieve\nreal-time performance and better odometry accuracy. We conduct experiments on\nhead-mounted WMS datasets to evaluate the performance of our system,\ndemonstrating significant advantages over state-of-the-art methods. Video\nrecordings of experiments can be found on the project page of HCTO:\n\\href{https://github.com/kafeiyin00/HCTO}{https://github.com/kafeiyin00/HCTO}.\n","authors":["Jianping Li","Shenghai Yuan","Muqing Cao","Thien-Minh Nguyen","Kun Cao","Lihua Xie"],"pdf_url":"https://arxiv.org/pdf/2403.14173v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.14163v1","updated":"2024-03-21T06:32:36Z","published":"2024-03-21T06:32:36Z","title":"Leveraging Large Language Model-based Room-Object Relationships\n  Knowledge for Enhancing Multimodal-Input Object Goal Navigation","summary":"  Object-goal navigation is a crucial engineering task for the community of\nembodied navigation; it involves navigating to an instance of a specified\nobject category within unseen environments. Although extensive investigations\nhave been conducted on both end-to-end and modular-based, data-driven\napproaches, fully enabling an agent to comprehend the environment through\nperceptual knowledge and perform object-goal navigation as efficiently as\nhumans remains a significant challenge. Recently, large language models have\nshown potential in this task, thanks to their powerful capabilities for\nknowledge extraction and integration. In this study, we propose a data-driven,\nmodular-based approach, trained on a dataset that incorporates common-sense\nknowledge of object-to-room relationships extracted from a large language\nmodel. We utilize the multi-channel Swin-Unet architecture to conduct\nmulti-task learning incorporating with multimodal inputs. The results in the\nHabitat simulator demonstrate that our framework outperforms the baseline by an\naverage of 10.6% in the efficiency metric, Success weighted by Path Length\n(SPL). The real-world demonstration shows that the proposed approach can\nefficiently conduct this task by traversing several rooms. For more details and\nreal-world demonstrations, please check our project webpage\n(https://sunleyuan.github.io/ObjectNav).\n","authors":["Leyuan Sun","Asako Kanezaki","Guillaume Caron","Yusuke Yoshiyasu"],"pdf_url":"https://arxiv.org/pdf/2403.14163v1.pdf","comment":"will soon submit to the Elsevier journal, Advanced Engineering\n  Informatics"},{"id":"http://arxiv.org/abs/2310.11792v2","updated":"2024-03-21T06:26:50Z","published":"2023-10-18T08:33:08Z","title":"Real-time Perceptive Motion Control using Control Barrier Functions with\n  Analytical Smoothing for Six-Wheeled-Telescopic-Legged Robot Tachyon 3","summary":"  To achieve safe legged locomotion, it is important to generate motion in\nreal-time considering various constraints in robots and environments. In this\nstudy, we propose a lightweight real-time perspective motion control system for\nthe newly developed six-wheeled-telescopic-legged robot, Tachyon 3. In the\nproposed method, analytically smoothed constraints including Smooth Separating\nAxis Theorem (Smooth SAT) as a novel higher order differentiable collision\ndetection for 3D shapes is applied to the Control Barrier Function (CBF). The\nproposed system integrating the CBF achieves online motion generation in a\nshort control cycle of 1 ms that satisfies joint limitations, environmental\ncollision avoidance and safe convex foothold constraints. The efficiency of\nSmooth SAT is shown from the collision detection time of 1 us or less and the\nCBF constraint computation time for Tachyon3 of several us. Furthermore, the\neffectiveness of the proposed system is verified through the stair-climbing\nmotion, integrating online recognition in a simulation and a real machine.\n","authors":["Noriaki Takasugi","Masaya Kinoshita","Yasuhisa Kamikawa","Ryoichi Tsuzaki","Atsushi Sakamoto","Toshimitsu Kai","Yasunori Kawanami"],"pdf_url":"https://arxiv.org/pdf/2310.11792v2.pdf","comment":"8 pages, 8 figures, This work has been submitted to the IEEE for\n  possible publication. Copyright may be transferred without notice, after\n  which this version may no longer be accessible"},{"id":"http://arxiv.org/abs/2403.14161v1","updated":"2024-03-21T06:24:01Z","published":"2024-03-21T06:24:01Z","title":"Extrinsic Calibration of Multiple LiDARs for a Mobile Robot based on\n  Floor Plane And Object Segmentation","summary":"  Mobile robots equipped with multiple light detection and ranging (LiDARs) and\ncapable of recognizing their surroundings are increasing due to the\nminitualization and cost reduction of LiDAR. This paper proposes a target-less\nextrinsic calibration method of multiple LiDARs with non-overlapping field of\nview (FoV). The proposed method uses accumulated point clouds of floor plane\nand objects while in motion. It enables accurate calibration with challenging\nconfiguration of LiDARs that directed towards the floor plane, caused by biased\nfeature values. Additionally, the method includes a noise removal module that\nconsiders the scanning pattern to address bleeding points, which are noises of\nsignificant source of error in point cloud alignment using high-density LiDARs.\nEvaluations through simulation demonstrate that the proposed method achieved\nhigher accuracy extrinsic calibration with two and four LiDARs than\nconventional methods, regardless type of objects. Furthermore, the experiments\nusing a real mobile robot has shown that our proposed noise removal module can\neliminate noise more precisely than conventional methods, and the estimated\nextrinsic parameters have successfully created consistent 3D maps.\n","authors":["Shun Niijima","Atsushi Suzuki","Ryoichi Tsuzaki","Masaya Kinoshita"],"pdf_url":"https://arxiv.org/pdf/2403.14161v1.pdf","comment":"8pages, 10figures"},{"id":"http://arxiv.org/abs/2403.14160v1","updated":"2024-03-21T06:23:57Z","published":"2024-03-21T06:23:57Z","title":"Development of a Compact Robust Passive Transformable Omni-Ball for\n  Enhanced Step-Climbing and Vibration Reduction","summary":"  This paper introduces the Passive Transformable Omni-Ball (PTOB), an advanced\nomnidirectional wheel engineered to enhance step-climbing performance,\nincorporate built-in actuators, diminish vibrations, and fortify structural\nintegrity. By modifying the omni-ball's structure from two to three segments,\nwe have achieved improved in-wheel actuation and a reduction in vibrational\nfeedback. Additionally, we have implemented a sliding mechanism in the follower\nwheels to boost the wheel's step-climbing abilities. A prototype with a 127 mm\ndiameter PTOB was constructed, which confirmed its functionality for\nomnidirectional movement and internal actuation. Compared to a traditional\nomni-wheel, the PTOB demonstrated a comparable level of vibration while\noffering superior capabilities. Extensive testing in varied settings showed\nthat the PTOB can adeptly handle step obstacles up to 45 mm, equivalent to 35\n$\\%$ of the wheel's diameter, in both the forward and lateral directions. The\nPTOB showcased robust construction and proved to be versatile in navigating\nthrough environments with diverse obstacles.\n","authors":["Kazuo Hongo","Takashi Kito","Yasuhisa Kamikawa","Masaya Kinoshita","Yasunori Kawanami"],"pdf_url":"https://arxiv.org/pdf/2403.14160v1.pdf","comment":"8 pages, 16 figures"},{"id":"http://arxiv.org/abs/2403.14159v1","updated":"2024-03-21T06:23:38Z","published":"2024-03-21T06:23:38Z","title":"Robust Locomotion via Zero-order Stochastic Nonlinear Model Predictive\n  Control with Guard Saltation Matrix","summary":"  This paper presents a stochastic/robust nonlinear model predictive control\n(NMPC) to enhance the robustness of legged locomotion against contact\nuncertainties. We integrate the contact uncertainties into the covariance\npropagation of stochastic/robust NMPC framework by leveraging the guard\nsaltation matrix and an extended Kalman filter-like covariance update. We\nachieve fast stochastic/robust NMPC computation by utilizing the zero-order\nstochastic/robust NMPC algorithm with additional improvements in computational\nefficiency concerning the feedback gains. We conducted numerical experiments\nand demonstrate that the proposed method can accurately forecast future state\ncovariance and generate trajectories that satisfies constraints even in the\npresence of the contact uncertainties. Hardware experiments on the perceptive\nlocomotion of a wheeled-legged robot were also carried out, validating the\nfeasibility of the proposed method in a real-world system with limited on-board\ncomputation.\n","authors":["Sotaro Katayama","Noriaki Takasugi","Mitsuhisa Kaneko","Norio Nagatsuka","and Masaya Kinoshita"],"pdf_url":"https://arxiv.org/pdf/2403.14159v1.pdf","comment":"8 pages, 8 figures"},{"id":"http://arxiv.org/abs/2311.10678v2","updated":"2024-03-21T05:47:22Z","published":"2023-11-17T18:00:20Z","title":"Distilling and Retrieving Generalizable Knowledge for Robot Manipulation\n  via Language Corrections","summary":"  Today's robot policies exhibit subpar performance when faced with the\nchallenge of generalizing to novel environments. Human corrective feedback is a\ncrucial form of guidance to enable such generalization. However, adapting to\nand learning from online human corrections is a non-trivial endeavor: not only\ndo robots need to remember human feedback over time to retrieve the right\ninformation in new settings and reduce the intervention rate, but also they\nwould need to be able to respond to feedback that can be arbitrary corrections\nabout high-level human preferences to low-level adjustments to skill\nparameters. In this work, we present Distillation and Retrieval of Online\nCorrections (DROC), a large language model (LLM)-based system that can respond\nto arbitrary forms of language feedback, distill generalizable knowledge from\ncorrections, and retrieve relevant past experiences based on textual and visual\nsimilarity for improving performance in novel settings. DROC is able to respond\nto a sequence of online language corrections that address failures in both\nhigh-level task plans and low-level skill primitives. We demonstrate that DROC\neffectively distills the relevant information from the sequence of online\ncorrections in a knowledge base and retrieves that knowledge in settings with\nnew task or object instances. DROC outperforms other techniques that directly\ngenerate robot code via LLMs by using only half of the total number of\ncorrections needed in the first round and requires little to no corrections\nafter two iterations. We show further results, videos, prompts and code on\nhttps://sites.google.com/stanford.edu/droc .\n","authors":["Lihan Zha","Yuchen Cui","Li-Heng Lin","Minae Kwon","Montserrat Gonzalez Arenas","Andy Zeng","Fei Xia","Dorsa Sadigh"],"pdf_url":"https://arxiv.org/pdf/2311.10678v2.pdf","comment":"8 pages, 4 figures, videos and code links on website\n  https://sites.google.com/stanford.edu/droc"},{"id":"http://arxiv.org/abs/2403.14138v1","updated":"2024-03-21T05:13:34Z","published":"2024-03-21T05:13:34Z","title":"Evidential Semantic Mapping in Off-road Environments with\n  Uncertainty-aware Bayesian Kernel Inference","summary":"  Robotic mapping with Bayesian Kernel Inference (BKI) has shown promise in\ncreating semantic maps by effectively leveraging local spatial information.\nHowever, existing semantic mapping methods face challenges in constructing\nreliable maps in unstructured outdoor scenarios due to unreliable semantic\npredictions. To address this issue, we propose an evidential semantic mapping,\nwhich can enhance reliability in perceptually challenging off-road\nenvironments. We integrate Evidential Deep Learning into the semantic\nsegmentation network to obtain the uncertainty estimate of semantic prediction.\nSubsequently, this semantic uncertainty is incorporated into an\nuncertainty-aware BKI, tailored to prioritize more confident semantic\npredictions when accumulating semantic information. By adaptively handling\nsemantic uncertainties, the proposed framework constructs robust\nrepresentations of the surroundings even in previously unseen environments.\nComprehensive experiments across various off-road datasets demonstrate that our\nframework enhances accuracy and robustness, consistently outperforming existing\nmethods in scenes with high perceptual uncertainties.\n","authors":["Junyoung Kim","Junwon Seo","Jihong Min"],"pdf_url":"https://arxiv.org/pdf/2403.14138v1.pdf","comment":"Our project website can be found at\n  https://kjyoung.github.io/Homepage/#/Projects/Evidential-Semantic-Mapping"},{"id":"http://arxiv.org/abs/2303.03757v3","updated":"2024-03-21T05:11:08Z","published":"2023-03-07T09:33:49Z","title":"Deep Learning for Inertial Positioning: A Survey","summary":"  Inertial sensors are widely utilized in smartphones, drones, robots, and IoT\ndevices, playing a crucial role in enabling ubiquitous and reliable\nlocalization. Inertial sensor-based positioning is essential in various\napplications, including personal navigation, location-based security, and\nhuman-device interaction. However, low-cost MEMS inertial sensors' measurements\nare inevitably corrupted by various error sources, leading to unbounded drifts\nwhen integrated doubly in traditional inertial navigation algorithms,\nsubjecting inertial positioning to the problem of error drifts. In recent\nyears, with the rapid increase in sensor data and computational power, deep\nlearning techniques have been developed, sparking significant research into\naddressing the problem of inertial positioning. Relevant literature in this\nfield spans across mobile computing, robotics, and machine learning. In this\narticle, we provide a comprehensive review of deep learning-based inertial\npositioning and its applications in tracking pedestrians, drones, vehicles, and\nrobots. We connect efforts from different fields and discuss how deep learning\ncan be applied to address issues such as sensor calibration, positioning error\ndrift reduction, and multi-sensor fusion. This article aims to attract readers\nfrom various backgrounds, including researchers and practitioners interested in\nthe potential of deep learning-based techniques to solve inertial positioning\nproblems. Our review demonstrates the exciting possibilities that deep learning\nbrings to the table and provides a roadmap for future research in this field.\n","authors":["Changhao Chen","Xianfei Pan"],"pdf_url":"https://arxiv.org/pdf/2303.03757v3.pdf","comment":"Accepted by IEEE Transactions on Intelligent Transportation Systems"},{"id":"http://arxiv.org/abs/2403.13331v2","updated":"2024-03-21T04:01:10Z","published":"2024-03-20T06:22:37Z","title":"AMP: Autoregressive Motion Prediction Revisited with Next Token\n  Prediction for Autonomous Driving","summary":"  As an essential task in autonomous driving (AD), motion prediction aims to\npredict the future states of surround objects for navigation. One natural\nsolution is to estimate the position of other agents in a step-by-step manner\nwhere each predicted time-step is conditioned on both observed time-steps and\npreviously predicted time-steps, i.e., autoregressive prediction. Pioneering\nworks like SocialLSTM and MFP design their decoders based on this intuition.\nHowever, almost all state-of-the-art works assume that all predicted time-steps\nare independent conditioned on observed time-steps, where they use a single\nlinear layer to generate positions of all time-steps simultaneously. They\ndominate most motion prediction leaderboards due to the simplicity of training\nMLPs compared to autoregressive networks.\n  In this paper, we introduce the GPT style next token prediction into motion\nforecasting. In this way, the input and output could be represented in a\nunified space and thus the autoregressive prediction becomes more feasible.\nHowever, different from language data which is composed of homogeneous units\n-words, the elements in the driving scene could have complex spatial-temporal\nand semantic relations. To this end, we propose to adopt three factorized\nattention modules with different neighbors for information aggregation and\ndifferent position encoding styles to capture their relations, e.g., encoding\nthe transformation between coordinate systems for spatial relativity while\nadopting RoPE for temporal relativity. Empirically, by equipping with the\naforementioned tailored designs, the proposed method achieves state-of-the-art\nperformance in the Waymo Open Motion and Waymo Interaction datasets. Notably,\nAMP outperforms other recent autoregressive motion prediction methods: MotionLM\nand StateTransformer, which demonstrates the effectiveness of the proposed\ndesigns.\n","authors":["Xiaosong Jia","Shaoshuai Shi","Zijun Chen","Li Jiang","Wenlong Liao","Tao He","Junchi Yan"],"pdf_url":"https://arxiv.org/pdf/2403.13331v2.pdf","comment":null},{"id":"http://arxiv.org/abs/2307.13122v2","updated":"2024-03-21T01:15:02Z","published":"2023-07-24T20:40:18Z","title":"Redundancy parameterization and inverse kinematics of 7-DOF revolute\n  manipulators","summary":"  Seven degree-of-freedom (DOF) robot arms have one redundant DOF which does\nnot change the motion of the end effector. The redundant DOF offers greater\nmanipulability of the arm configuration to avoid obstacles and singularities,\nbut it must be parameterized to fully specify the joint angles for a given end\neffector pose. For 7-DOF revolute (7R) manipulators, we introduce a new concept\nof generalized shoulder-elbow-wrist (SEW) angle, a generalization of the\nconventional SEW angle but with an arbitrary choice of the reference direction\nfunction. The SEW angle is widely used and easy for human operators to\nvisualize as a rotation of the elbow about the shoulder-wrist line. Since other\nredundancy parameterizations including the conventional SEW angle encounter an\nalgorithmic singularity along a line in the workspace, we introduce a special\nchoice of the reference direction function called the stereographic SEW angle\nwhich has a singularity only along a half-line, which can be placed out of\nreach. We prove that such a singularity is unavoidable for any\nparameterization. We also include expressions for the SEW angle Jacobian along\nwith singularity analysis. Finally, we provide efficient and singularity-robust\ninverse kinematics solutions for most known 7R manipulators using the general\nSEW angle and the subproblem decomposition method. These solutions are often\nclosed-form but may sometimes involve a 1D or 2D search in the general case.\nSearch-based solutions may be converted to finding zeros of a high-order\npolynomial. Inverse kinematics solutions, examples, and evaluations are\navailable in a publicly accessible repository.\n","authors":["Alexander J. Elias","John T. Wen"],"pdf_url":"https://arxiv.org/pdf/2307.13122v2.pdf","comment":"22 pages, 14 figures. Update: Sawyer IK using polynomial method, two\n  video extensions, expanded related literature"},{"id":"http://arxiv.org/abs/2403.14056v1","updated":"2024-03-21T00:59:35Z","published":"2024-03-21T00:59:35Z","title":"Semantics from Space: Satellite-Guided Thermal Semantic Segmentation\n  Annotation for Aerial Field Robots","summary":"  We present a new method to automatically generate semantic segmentation\nannotations for thermal imagery captured from an aerial vehicle by utilizing\nsatellite-derived data products alongside onboard global positioning and\nattitude estimates. This new capability overcomes the challenge of developing\nthermal semantic perception algorithms for field robots due to the lack of\nannotated thermal field datasets and the time and costs of manual annotation,\nenabling precise and rapid annotation of thermal data from field collection\nefforts at a massively-parallelizable scale. By incorporating a\nthermal-conditioned refinement step with visual foundation models, our approach\ncan produce highly-precise semantic segmentation labels using low-resolution\nsatellite land cover data for little-to-no cost. It achieves 98.5% of the\nperformance from using costly high-resolution options and demonstrates between\n70-160% improvement over popular zero-shot semantic segmentation methods based\non large vision-language models currently used for generating annotations for\nRGB imagery. Code will be available at:\nhttps://github.com/connorlee77/aerial-auto-segment.\n","authors":["Connor Lee","Saraswati Soedarmadji","Matthew Anderson","Anthony J. Clark","Soon-Jo Chung"],"pdf_url":"https://arxiv.org/pdf/2403.14056v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2310.08864v5","updated":"2024-03-21T00:48:52Z","published":"2023-10-13T05:20:40Z","title":"Open X-Embodiment: Robotic Learning Datasets and RT-X Models","summary":"  Large, high-capacity models trained on diverse datasets have shown remarkable\nsuccesses on efficiently tackling downstream applications. In domains from NLP\nto Computer Vision, this has led to a consolidation of pretrained models, with\ngeneral pretrained backbones serving as a starting point for many applications.\nCan such a consolidation happen in robotics? Conventionally, robotic learning\nmethods train a separate model for every application, every robot, and even\nevery environment. Can we instead train generalist X-robot policy that can be\nadapted efficiently to new robots, tasks, and environments? In this paper, we\nprovide datasets in standardized data formats and models to make it possible to\nexplore this possibility in the context of robotic manipulation, alongside\nexperimental results that provide an example of effective X-robot policies. We\nassemble a dataset from 22 different robots collected through a collaboration\nbetween 21 institutions, demonstrating 527 skills (160266 tasks). We show that\na high-capacity model trained on this data, which we call RT-X, exhibits\npositive transfer and improves the capabilities of multiple robots by\nleveraging experience from other platforms. More details can be found on the\nproject website https://robotics-transformer-x.github.io.\n","authors":["Open X-Embodiment Collaboration","Abby O'Neill","Abdul Rehman","Abhiram Maddukuri","Abhishek Gupta","Abhishek Padalkar","Abraham Lee","Acorn Pooley","Agrim Gupta","Ajay Mandlekar","Ajinkya Jain","Albert Tung","Alex Bewley","Alex Herzog","Alex Irpan","Alexander Khazatsky","Anant Rai","Anchit Gupta","Andrew Wang","Anikait Singh","Animesh Garg","Aniruddha Kembhavi","Annie Xie","Anthony Brohan","Antonin Raffin","Archit Sharma","Arefeh Yavary","Arhan Jain","Ashwin Balakrishna","Ayzaan Wahid","Ben Burgess-Limerick","Beomjoon Kim","Bernhard Schölkopf","Blake Wulfe","Brian Ichter","Cewu Lu","Charles Xu","Charlotte Le","Chelsea Finn","Chen Wang","Chenfeng Xu","Cheng Chi","Chenguang Huang","Christine Chan","Christopher Agia","Chuer Pan","Chuyuan Fu","Coline Devin","Danfei Xu","Daniel Morton","Danny Driess","Daphne Chen","Deepak Pathak","Dhruv Shah","Dieter Büchler","Dinesh Jayaraman","Dmitry Kalashnikov","Dorsa Sadigh","Edward Johns","Ethan Foster","Fangchen Liu","Federico Ceola","Fei Xia","Feiyu Zhao","Freek Stulp","Gaoyue Zhou","Gaurav S. Sukhatme","Gautam Salhotra","Ge Yan","Gilbert Feng","Giulio Schiavi","Glen Berseth","Gregory Kahn","Guanzhi Wang","Hao Su","Hao-Shu Fang","Haochen Shi","Henghui Bao","Heni Ben Amor","Henrik I Christensen","Hiroki Furuta","Homer Walke","Hongjie Fang","Huy Ha","Igor Mordatch","Ilija Radosavovic","Isabel Leal","Jacky Liang","Jad Abou-Chakra","Jaehyung Kim","Jaimyn Drake","Jan Peters","Jan Schneider","Jasmine Hsu","Jeannette Bohg","Jeffrey Bingham","Jeffrey Wu","Jensen Gao","Jiaheng Hu","Jiajun Wu","Jialin Wu","Jiankai Sun","Jianlan Luo","Jiayuan Gu","Jie Tan","Jihoon Oh","Jimmy Wu","Jingpei Lu","Jingyun Yang","Jitendra Malik","João Silvério","Joey Hejna","Jonathan Booher","Jonathan Tompson","Jonathan Yang","Jordi Salvador","Joseph J. Lim","Junhyek Han","Kaiyuan Wang","Kanishka Rao","Karl Pertsch","Karol Hausman","Keegan Go","Keerthana Gopalakrishnan","Ken Goldberg","Kendra Byrne","Kenneth Oslund","Kento Kawaharazuka","Kevin Black","Kevin Lin","Kevin Zhang","Kiana Ehsani","Kiran Lekkala","Kirsty Ellis","Krishan Rana","Krishnan Srinivasan","Kuan Fang","Kunal Pratap Singh","Kuo-Hao Zeng","Kyle Hatch","Kyle Hsu","Laurent Itti","Lawrence Yunliang Chen","Lerrel Pinto","Li Fei-Fei","Liam Tan","Linxi \"Jim\" Fan","Lionel Ott","Lisa Lee","Luca Weihs","Magnum Chen","Marion Lepert","Marius Memmel","Masayoshi Tomizuka","Masha Itkina","Mateo Guaman Castro","Max Spero","Maximilian Du","Michael Ahn","Michael C. Yip","Mingtong Zhang","Mingyu Ding","Minho Heo","Mohan Kumar Srirama","Mohit Sharma","Moo Jin Kim","Naoaki Kanazawa","Nicklas Hansen","Nicolas Heess","Nikhil J Joshi","Niko Suenderhauf","Ning Liu","Norman Di Palo","Nur Muhammad Mahi Shafiullah","Oier Mees","Oliver Kroemer","Osbert Bastani","Pannag R Sanketi","Patrick \"Tree\" Miller","Patrick Yin","Paul Wohlhart","Peng Xu","Peter David Fagan","Peter Mitrano","Pierre Sermanet","Pieter Abbeel","Priya Sundaresan","Qiuyu Chen","Quan Vuong","Rafael Rafailov","Ran Tian","Ria Doshi","Roberto Martín-Martín","Rohan Baijal","Rosario Scalise","Rose Hendrix","Roy Lin","Runjia Qian","Ruohan Zhang","Russell Mendonca","Rutav Shah","Ryan Hoque","Ryan Julian","Samuel Bustamante","Sean Kirmani","Sergey Levine","Shan Lin","Sherry Moore","Shikhar Bahl","Shivin Dass","Shubham Sonawani","Shuran Song","Sichun Xu","Siddhant Haldar","Siddharth Karamcheti","Simeon Adebola","Simon Guist","Soroush Nasiriany","Stefan Schaal","Stefan Welker","Stephen Tian","Subramanian Ramamoorthy","Sudeep Dasari","Suneel Belkhale","Sungjae Park","Suraj Nair","Suvir Mirchandani","Takayuki Osa","Tanmay Gupta","Tatsuya Harada","Tatsuya Matsushima","Ted Xiao","Thomas Kollar","Tianhe Yu","Tianli Ding","Todor Davchev","Tony Z. Zhao","Travis Armstrong","Trevor Darrell","Trinity Chung","Vidhi Jain","Vincent Vanhoucke","Wei Zhan","Wenxuan Zhou","Wolfram Burgard","Xi Chen","Xiaolong Wang","Xinghao Zhu","Xinyang Geng","Xiyuan Liu","Xu Liangwei","Xuanlin Li","Yao Lu","Yecheng Jason Ma","Yejin Kim","Yevgen Chebotar","Yifan Zhou","Yifeng Zhu","Yilin Wu","Ying Xu","Yixuan Wang","Yonatan Bisk","Yoonyoung Cho","Youngwoon Lee","Yuchen Cui","Yue Cao","Yueh-Hua Wu","Yujin Tang","Yuke Zhu","Yunchu Zhang","Yunfan Jiang","Yunshuang Li","Yunzhu Li","Yusuke Iwasawa","Yutaka Matsuo","Zehan Ma","Zhuo Xu","Zichen Jeff Cui","Zichen Zhang","Zipeng Lin"],"pdf_url":"https://arxiv.org/pdf/2310.08864v5.pdf","comment":"Project website: https://robotics-transformer-x.github.io"},{"id":"http://arxiv.org/abs/2403.14049v1","updated":"2024-03-21T00:14:53Z","published":"2024-03-21T00:14:53Z","title":"A Roadmap Towards Automated and Regulated Robotic Systems","summary":"  The rapid development of generative technology opens up possibility for\nhigher level of automation, and artificial intelligence (AI) embodiment in\nrobotic systems is imminent. However, due to the blackbox nature of the\ngenerative technology, the generation of the knowledge and workflow scheme is\nuncontrolled, especially in a dynamic environment and a complex scene. This\nposes challenges to regulations in safety-demanding applications such as\nmedical scenes. We argue that the unregulated generative processes from AI is\nfitted for low level end tasks, but intervention in the form of manual or\nautomated regulation should happen post-workflow-generation and\npre-robotic-execution. To address this, we propose a roadmap that can lead to\nfully automated and regulated robotic systems. In this paradigm, the high level\npolicies are generated as structured graph data, enabling regulatory oversight\nand reusability, while the code base for lower level tasks is generated by\ngenerative models. Our approach aims the transitioning from expert knowledge to\nregulated action, akin to the iterative processes of study, practice, scrutiny,\nand execution in human tasks. We identify the generative and deterministic\nprocesses in a design cycle, where generative processes serve as a text-based\nworld simulator and the deterministic processes generate the executable system.\nWe propose State Machine Seralization Language (SMSL) to be the conversion\npoint between text simulator and executable workflow control. From there, we\nanalyze the modules involved based on the current literature, and discuss human\nin the loop. As a roadmap, this work identifies the current possible\nimplementation and future work. This work does not provide an implemented\nsystem but envisions to inspire the researchers working on the direction in the\nroadmap. We implement the SMSL and D-SFO paradigm that serve as the starting\npoint of the roadmap.\n","authors":["Yihao Liu","Mehran Armand"],"pdf_url":"https://arxiv.org/pdf/2403.14049v1.pdf","comment":"17 pages, 9 figures"}]},"2024-03-20T00:00:00Z":{"Robotics":[{"id":"http://arxiv.org/abs/2403.14041v1","updated":"2024-03-20T23:36:30Z","published":"2024-03-20T23:36:30Z","title":"\"It's Not a Replacement:\" Enabling Parent-Robot Collaboration to Support\n  In-Home Learning Experiences of Young Children","summary":"  Learning companion robots for young children are increasingly adopted in\ninformal learning environments. Although parents play a pivotal role in their\nchildren's learning, very little is known about how parents prefer to\nincorporate robots into their children's learning activities. We developed\nprototype capabilities for a learning companion robot to deliver educational\nprompts and responses to parent-child pairs during reading sessions and\nconducted in-home user studies involving 10 families with children aged 3-5.\nOur data indicates that parents want to work with robots as collaborators to\naugment parental activities to foster children's learning, introducing the\nnotion of parent-robot collaboration. Our findings offer an empirical\nunderstanding of the needs and challenges of parent-child interaction in\ninformal learning scenarios and design opportunities for integrating a\ncompanion robot into these interactions. We offer insights into how robots\nmight be designed to facilitate parent-robot collaboration, including parenting\npolicies, collaboration patterns, and interaction paradigms.\n","authors":["Hui-Ru Ho","Edward Hubbard","Bilge Mutlu"],"pdf_url":"https://arxiv.org/pdf/2403.14041v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.14029v1","updated":"2024-03-20T22:57:34Z","published":"2024-03-20T22:57:34Z","title":"Quadcopter Team Configurable Motion Guided by a Quadruped","summary":"  The paper focuses on modeling and experimental evaluation of a quadcopter\nteam configurable coordination guided by a single quadruped robot. We consider\nthe quadcopter team as particles of a two-dimensional deformable body and\npropose a two-dimensional affine transformation model for safe and\ncollision-free configurable coordination of this heterogeneous robotic system.\nThe proposed affine transformation is decomposed into translation, that is\nspecified by the quadruped global position, and configurable motion of the\nquadcopters, which is determined by a nonsingular Jacobian matrix so that the\nquadcopter team can safely navigate a constrained environment while avoiding\ncollision. We propose two methods to experimentally evaluate the proposed\nheterogeneous robot coordination model. The first method measures real\npositions of quadcopters, quadruped, and environmental objects all with respect\nto the global coordinate system. On the other hand, the second method measures\nposition with respect to the local coordinate system fixed on the dog robot\nwhich in turn enables safe planning the Jacobian matrix of the quadcopter team\nwhile the world is virtually approached the robotic system.\n","authors":["Mohammad Ghufran","Sourish Tetakayala","Jack Hughes","Aron Wilson","Hossein Rastgoftar"],"pdf_url":"https://arxiv.org/pdf/2403.14029v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.14025v1","updated":"2024-03-20T22:51:29Z","published":"2024-03-20T22:51:29Z","title":"HRI Curriculum for a Liberal Arts Education","summary":"  In this paper, we discuss the opportunities and challenges of teaching a\nhuman-robot interaction course at an undergraduate liberal arts college. We\nprovide a sample syllabus adapted from a previous version of a course.\n","authors":["Jason R. Wilson","Emily Jensen"],"pdf_url":"https://arxiv.org/pdf/2403.14025v1.pdf","comment":"Presented at the Designing an Intro to HRI Course Workshop at HRI\n  2024 (arXiv:2403.05588)"},{"id":"http://arxiv.org/abs/2403.14014v1","updated":"2024-03-20T22:24:52Z","published":"2024-03-20T22:24:52Z","title":"Crowdsourcing Task Traces for Service Robotics","summary":"  Demonstration is an effective end-user development paradigm for teaching\nrobots how to perform new tasks. In this paper, we posit that demonstration is\nuseful not only as a teaching tool, but also as a way to understand and assist\nend-user developers in thinking about a task at hand. As a first step toward\ngaining this understanding, we constructed a lightweight web interface to\ncrowdsource step-by-step instructions of common household tasks, leveraging the\nimaginations and past experiences of potential end-user developers. As evidence\nof the utility of our interface, we deployed the interface on Amazon Mechanical\nTurk and collected 207 task traces that span 18 different task categories. We\ndescribe our vision for how these task traces can be operationalized as task\nmodels within end-user development tools and provide a roadmap for future work.\n","authors":["David Porfirio","Allison Sauppé","Maya Cakmak","Aws Albarghouthi","Bilge Mutlu"],"pdf_url":"https://arxiv.org/pdf/2403.14014v1.pdf","comment":"Published in the companion proceedings of the 2023 ACM/IEEE\n  International Conference on Human-Robot Interaction"},{"id":"http://arxiv.org/abs/2403.02316v2","updated":"2024-03-20T22:05:06Z","published":"2024-03-04T18:52:15Z","title":"Designing Library of Skill-Agents for Hardware-Level Reusability","summary":"  To use new robot hardware in a new environment, it is necessary to develop a\ncontrol program tailored to that specific robot in that environment.\nConsidering the reusability of software among robots is crucial to minimize the\neffort involved in this process and maximize software reuse across different\nrobots in different environments. This paper proposes a method to remedy this\nprocess by considering hardware-level reusability, using\nLearning-from-observation (LfO) paradigm with a pre-designed skill-agent\nlibrary. The LfO framework represents the required actions in\nhardware-independent representations, referred to as task models, from\nobserving human demonstrations, capturing the necessary parameters for the\ninteraction between the environment and the robot. When executing the desired\nactions from the task models, a set of skill agents is employed to convert the\nrepresentations into robot commands. This paper focuses on the latter part of\nthe LfO framework, utilizing the set to generate robot actions from the task\nmodels, and explores a hardware-independent design approach for these skill\nagents. These skill agents are described in a hardware-independent manner,\nconsidering the relative relationship between the robot's hand position and the\nenvironment. As a result, it is possible to execute these actions on robots\nwith different hardware configurations by simply swapping the inverse\nkinematics solver. This paper, first, defines a necessary and sufficient\nskill-agent set corresponding to cover all possible actions, and considers the\ndesign principles for these skill agents in the library. We provide concrete\nexamples of such skill agents and demonstrate the practicality of using these\nskill agents by showing that the same representations can be executed on two\ndifferent robots, Nextage and Fetch, using the proposed skill-agents set.\n","authors":["Jun Takamatsu","Daichi Saito","Katsushi Ikeuchi","Atsushi Kanehira","Kazuhiro Sasabuchi","Naoki Wake"],"pdf_url":"https://arxiv.org/pdf/2403.02316v2.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.14000v1","updated":"2024-03-20T21:57:14Z","published":"2024-03-20T21:57:14Z","title":"Visual Imitation Learning of Task-Oriented Object Grasping and\n  Rearrangement","summary":"  Task-oriented object grasping and rearrangement are critical skills for\nrobots to accomplish different real-world manipulation tasks. However, they\nremain challenging due to partial observations of the objects and shape\nvariations in categorical objects. In this paper, we propose the Multi-feature\nImplicit Model (MIMO), a novel object representation that encodes multiple\nspatial features between a point and an object in an implicit neural field.\nTraining such a model on multiple features ensures that it embeds the object\nshapes consistently in different aspects, thus improving its performance in\nobject shape reconstruction from partial observation, shape similarity measure,\nand modeling spatial relations between objects. Based on MIMO, we propose a\nframework to learn task-oriented object grasping and rearrangement from single\nor multiple human demonstration videos. The evaluations in simulation show that\nour approach outperforms the state-of-the-art methods for multi- and\nsingle-view observations. Real-world experiments demonstrate the efficacy of\nour approach in one- and few-shot imitation learning of manipulation tasks.\n","authors":["Yichen Cai","Jianfeng Gao","Christoph Pohl","Tamim Asfour"],"pdf_url":"https://arxiv.org/pdf/2403.14000v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13988v1","updated":"2024-03-20T21:41:44Z","published":"2024-03-20T21:41:44Z","title":"Goal-Oriented End-User Programming of Robots","summary":"  End-user programming (EUP) tools must balance user control with the robot's\nability to plan and act autonomously. Many existing task-oriented EUP tools\nenforce a specific level of control, e.g., by requiring that users hand-craft\ndetailed sequences of actions, rather than offering users the flexibility to\nchoose the level of task detail they wish to express. We thereby created a\nnovel EUP system, Polaris, that in contrast to most existing EUP tools, uses\ngoal predicates as the fundamental building block of programs. Users can\nthereby express high-level robot objectives or lower-level checkpoints at their\nchoosing, while an off-the-shelf task planner fills in any remaining program\ndetail. To ensure that goal-specified programs adhere to user expectations of\nrobot behavior, Polaris is equipped with a Plan Visualizer that exposes the\nplanner's output to the user before runtime. In what follows, we describe our\ndesign of Polaris and its evaluation with 32 human participants. Our results\nsupport the Plan Visualizer's ability to help users craft higher-quality\nprograms. Furthermore, there are strong associations between user perception of\nthe robot and Plan Visualizer usage, and evidence that robot familiarity has a\nkey role in shaping user experience.\n","authors":["David Porfirio","Mark Roberts","Laura M. Hiatt"],"pdf_url":"https://arxiv.org/pdf/2403.13988v1.pdf","comment":"Published in the proceedings of the 2024 ACM/IEEE International\n  Conference on Human-Robot Interaction"},{"id":"http://arxiv.org/abs/2403.13960v1","updated":"2024-03-20T20:13:39Z","published":"2024-03-20T20:13:39Z","title":"Open Access NAO (OAN): a ROS2-based software framework for HRI\n  applications with the NAO robot","summary":"  This paper presents a new software framework for HRI experimentation with the\nsixth version of the common NAO robot produced by the United Robotics Group.\nEmbracing the common demand of researchers for better performance and new\nfeatures for NAO, the authors took advantage of the ability to run ROS2 onboard\non the NAO to develop a framework independent of the APIs provided by the\nmanufacturer. Such a system provides NAO with not only the basic skills of a\nhumanoid robot such as walking and reproducing movements of interest but also\nfeatures often used in HRI such as: speech recognition/synthesis, face and\nobject detention, and the use of Generative Pre-trained Transformer (GPT)\nmodels for conversation. The developed code is therefore configured as a\nready-to-use but also highly expandable and improvable tool thanks to the\npossibilities provided by the ROS community.\n","authors":["Antonio Bono","Kenji Brameld","Luigi D'Alfonso","Giuseppe Fedele"],"pdf_url":"https://arxiv.org/pdf/2403.13960v1.pdf","comment":"7 pages, 3 figures"},{"id":"http://arxiv.org/abs/2312.02352v2","updated":"2024-03-20T19:57:24Z","published":"2023-12-04T21:32:00Z","title":"Working Backwards: Learning to Place by Picking","summary":"  We present placing via picking (PvP), a method to autonomously collect\nreal-world demonstrations for a family of placing tasks in which objects must\nbe manipulated to specific contact-constrained locations. With PvP, we approach\nthe collection of robotic object placement demonstrations by reversing the\ngrasping process and exploiting the inherent symmetry of the pick and place\nproblems. Specifically, we obtain placing demonstrations from a set of grasp\nsequences of objects initially located at their target placement locations. Our\nsystem can collect hundreds of demonstrations in contact-constrained\nenvironments without human intervention by combining two modules: tactile\nregrasping and compliant control for grasps. We train a policy directly from\nvisual observations through behavioral cloning, using the\nautonomously-collected demonstrations. By doing so, the policy can generalize\nto object placement scenarios outside of the training environment without\nprivileged information (e.g., placing a plate picked up from a table). We\nvalidate our approach in home robotic scenarios that include dishwasher loading\nand table setting. Our approach yields robotic placing policies that outperform\npolicies trained with kinesthetic teaching, both in terms of performance and\ndata efficiency, while requiring no human supervision.\n","authors":["Oliver Limoyo","Abhisek Konar","Trevor Ablett","Jonathan Kelly","Francois R. Hogan","Gregory Dudek"],"pdf_url":"https://arxiv.org/pdf/2312.02352v2.pdf","comment":"Submitted to the IEEE/RSJ International Conference on Intelligent\n  Robotics and Systems (IROS'24), Abu Dhabi, UAE, Oct 14-18, 2024"},{"id":"http://arxiv.org/abs/2401.11061v2","updated":"2024-03-20T19:44:07Z","published":"2024-01-19T23:34:48Z","title":"PhotoBot: Reference-Guided Interactive Photography via Natural Language","summary":"  We introduce PhotoBot, a framework for fully automated photo acquisition\nbased on an interplay between high-level human language guidance and a robot\nphotographer. We propose to communicate photography suggestions to the user via\nreference images that are selected from a curated gallery. We leverage a visual\nlanguage model (VLM) and an object detector to characterize the reference\nimages via textual descriptions and then use a large language model (LLM) to\nretrieve relevant reference images based on a user's language query through\ntext-based reasoning. To correspond the reference image and the observed scene,\nwe exploit pre-trained features from a vision transformer capable of capturing\nsemantic similarity across marked appearance variations. Using these features,\nwe compute pose adjustments for an RGB-D camera by solving a\nperspective-n-point (PnP) problem. We demonstrate our approach using a\nmanipulator equipped with a wrist camera. Our user studies show that photos\ntaken by PhotoBot are often more aesthetically pleasing than those taken by\nusers themselves, as measured by human feedback. We also show that PhotoBot can\ngeneralize to other reference sources such as paintings.\n","authors":["Oliver Limoyo","Jimmy Li","Dmitriy Rivkin","Jonathan Kelly","Gregory Dudek"],"pdf_url":"https://arxiv.org/pdf/2401.11061v2.pdf","comment":"Submitted to the IEEE/RSJ International Conference on Intelligent\n  Robotics and Systems (IROS'24), Abu Dhabi, UAE, Oct 14-18, 2024"},{"id":"http://arxiv.org/abs/2403.04169v2","updated":"2024-03-20T19:28:56Z","published":"2024-03-07T02:58:15Z","title":"Social Robots for Sleep Health: A Scoping Review","summary":"  Poor sleep health is an increasingly concerning public healthcare crisis,\nespecially when coupled with a dwindling number of health professionals\nqualified to combat it. However, there is a growing body of scientific\nliterature on the use of digital technologies in supporting and sustaining\nindividuals' healthy sleep habits. Social robots are a relatively recent\ntechnology that has been used to facilitate health care interventions and may\nhave potential in improving sleep health outcomes, as well. Social robots'\nunique characteristics -- such as anthropomorphic physical embodiment or\neffective communication methods -- help to engage users and motivate them to\ncomply with specific interventions, thus improving the interventions' outcomes.\nThis scoping review aims to evaluate current scientific evidence for employing\nsocial robots in sleep health interventions, identify critical research gaps,\nand suggest future directions for developing and using social robots to improve\npeople's sleep health. Our analysis of the reviewed studies found them limited\ndue to a singular focus on the older adult population, use of small sample\nsizes, limited intervention durations, and other compounding factors.\nNevertheless, the reviewed studies reported several positive outcomes,\nhighlighting the potential social robots hold in this field. Although our\nreview found limited clinical evidence for the efficacy of social robots as\npurveyors of sleep health interventions, it did elucidate the potential for a\nsuccessful future in this domain if current limitations are addressed and more\nresearch is conducted.\n","authors":["Victor Nikhil Antony","Mengchi Li","Shu-Han Lin","Junxin Li","Chien-Ming Huang"],"pdf_url":"https://arxiv.org/pdf/2403.04169v2.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13941v1","updated":"2024-03-20T19:26:27Z","published":"2024-03-20T19:26:27Z","title":"Sensory Glove-Based Surgical Robot User Interface","summary":"  Robotic surgery has reached a high level of maturity and has become an\nintegral part of standard surgical care. However, existing surgeon consoles are\nbulky and take up valuable space in the operating room, present challenges for\nsurgical team coordination, and their proprietary nature makes it difficult to\ntake advantage of recent technological advances, especially in virtual and\naugmented reality. One potential area for further improvement is the\nintegration of modern sensory gloves into robotic platforms, allowing surgeons\nto control robotic arms directly with their hand movements intuitively. We\npropose one such system that combines an HTC Vive tracker, a Manus Meta Prime 3\nXR sensory glove, and God Vision wireless smart glasses. The system controls\none arm of a da Vinci surgical robot. In addition to moving the arm, the\nsurgeon can use fingers to control the end-effector of the surgical instrument.\nHand gestures are used to implement clutching and similar functions. In\nparticular, we introduce clutching of the instrument orientation, a\nfunctionality not available in the da Vinci system. The vibrotactile elements\nof the glove are used to provide feedback to the user when gesture commands are\ninvoked. A preliminary evaluation of the system shows that it has excellent\ntracking accuracy and allows surgeons to efficiently perform common surgical\ntraining tasks with minimal practice with the new interface; this suggests that\nthe interface is highly intuitive. The proposed system is inexpensive, allows\nrapid prototyping, and opens opportunities for further innovations in the\ndesign of surgical robot interfaces.\n","authors":["Leonardo Borgioli","Ki-Hwan Oh","Alberto Mangano","Alvaro Ducas","Luciano Ambrosini","Federico Pinto","Paula A Lopez","Jessica Cassiani","Milos Zefran","Liaohai Chen","Pier Cristoforo Giulianotti"],"pdf_url":"https://arxiv.org/pdf/2403.13941v1.pdf","comment":"6 pages, 5 figures, 7 tables, submitted to International Conference\n  on Intelligent Robots and Systems (IROS)2024"},{"id":"http://arxiv.org/abs/2403.13929v1","updated":"2024-03-20T19:03:26Z","published":"2024-03-20T19:03:26Z","title":"Safety-Aware Perception for Autonomous Collision Avoidance in Dynamic\n  Environments","summary":"  Autonomous collision avoidance requires accurate environmental perception;\nhowever, flight systems often possess limited sensing capabilities with\nfield-of-view (FOV) restrictions. To navigate this challenge, we present a\nsafety-aware approach for online determination of the optimal sensor-pointing\ndirection $\\psi_\\text{d}$ which utilizes control barrier functions (CBFs).\nFirst, we generate a spatial density function $\\Phi$ which leverages CBF\nconstraints to map the collision risk of all local coordinates. Then, we\nconvolve $\\Phi$ with an attitude-dependent sensor FOV quality function to\nproduce the objective function $\\Gamma$ which quantifies the total observed\nrisk for a given pointing direction. Finally, by finding the global optimizer\nfor $\\Gamma$, we identify the value of $\\psi_\\text{d}$ which maximizes the\nperception of risk within the FOV. We incorporate $\\psi_\\text{d}$ into a\nsafety-critical flight architecture and conduct a numerical analysis using\nmultiple simulated mission profiles. Our algorithm achieves a success rate of\n$88-96\\%$, constituting a $16-29\\%$ improvement compared to the best heuristic\nmethods. We demonstrate the functionality of our approach via a flight\ndemonstration using the Crazyflie 2.1 micro-quadrotor. Without a priori\nobstacle knowledge, the quadrotor follows a dynamic flight path while\nsimultaneously calculating and tracking $\\psi_\\text{d}$ to perceive and avoid\ntwo static obstacles with an average computation time of 371 $\\mu$s.\n","authors":["Ryan M. Bena","Chongbo Zhao","Quan Nguyen"],"pdf_url":"https://arxiv.org/pdf/2403.13929v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2309.15821v2","updated":"2024-03-20T18:45:54Z","published":"2023-09-27T17:45:49Z","title":"LGMCTS: Language-Guided Monte-Carlo Tree Search for Executable Semantic\n  Object Rearrangement","summary":"  We introduce a novel approach to the executable semantic object rearrangement\nproblem. In this challenge, a robot seeks to create an actionable plan that\nrearranges objects within a scene according to a pattern dictated by a natural\nlanguage description. Unlike existing methods such as StructFormer and\nStructDiffusion, which tackle the issue in two steps by first generating poses\nand then leveraging a task planner for action plan formulation, our method\nconcurrently addresses pose generation and action planning. We achieve this\nintegration using a Language-Guided Monte-Carlo Tree Search (LGMCTS).\nQuantitative evaluations are provided on two simulation datasets, and\ncomplemented by qualitative tests with a real robot.\n","authors":["Haonan Chang","Kai Gao","Kowndinya Boyalakuntla","Alex Lee","Baichuan Huang","Harish Udhaya Kumar","Jinjin Yu","Abdeslam Boularias"],"pdf_url":"https://arxiv.org/pdf/2309.15821v2.pdf","comment":"Our code and supplementary materials are accessible at\n  https://github.com/changhaonan/LG-MCTS"},{"id":"http://arxiv.org/abs/2403.13910v1","updated":"2024-03-20T18:30:12Z","published":"2024-03-20T18:30:12Z","title":"Augmented Reality Demonstrations for Scalable Robot Imitation Learning","summary":"  Robot Imitation Learning (IL) is a widely used method for training robots to\nperform manipulation tasks that involve mimicking human demonstrations to\nacquire skills. However, its practicality has been limited due to its\nrequirement that users be trained in operating real robot arms to provide\ndemonstrations. This paper presents an innovative solution: an Augmented\nReality (AR)-assisted framework for demonstration collection, empowering\nnon-roboticist users to produce demonstrations for robot IL using devices like\nthe HoloLens 2. Our framework facilitates scalable and diverse demonstration\ncollection for real-world tasks. We validate our approach with experiments on\nthree classical robotics tasks: reach, push, and pick-and-place. The real robot\nperforms each task successfully while replaying demonstrations collected via\nAR.\n","authors":["Yue Yang","Bryce Ikeda","Gedas Bertasius","Daniel Szafir"],"pdf_url":"https://arxiv.org/pdf/2403.13910v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13801v1","updated":"2024-03-20T17:58:12Z","published":"2024-03-20T17:58:12Z","title":"Natural Language as Polices: Reasoning for Coordinate-Level Embodied\n  Control with LLMs","summary":"  We demonstrate experimental results with LLMs that address robotics action\nplanning problems. Recently, LLMs have been applied in robotics action\nplanning, particularly using a code generation approach that converts complex\nhigh-level instructions into mid-level policy codes. In contrast, our approach\nacquires text descriptions of the task and scene objects, then formulates\naction planning through natural language reasoning, and outputs coordinate\nlevel control commands, thus reducing the necessity for intermediate\nrepresentation code as policies. Our approach is evaluated on a multi-modal\nprompt simulation benchmark, demonstrating that our prompt engineering\nexperiments with natural language reasoning significantly enhance success rates\ncompared to its absence. Furthermore, our approach illustrates the potential\nfor natural language descriptions to transfer robotics skills from known tasks\nto previously unseen tasks.\n","authors":["Yusuke Mikami","Andrew Melnik","Jun Miura","Ville Hautamäki"],"pdf_url":"https://arxiv.org/pdf/2403.13801v1.pdf","comment":"8 pages, 2 figures"},{"id":"http://arxiv.org/abs/2403.13783v1","updated":"2024-03-20T17:44:33Z","published":"2024-03-20T17:44:33Z","title":"A Convex Formulation of Frictional Contact for the Material Point Method\n  and Rigid Bodies","summary":"  In this paper, we introduce a novel convex formulation that seamlessly\nintegrates the Material Point Method (MPM) with articulated rigid body dynamics\nin frictional contact scenarios. We extend the linear corotational hyperelastic\nmodel into the realm of elastoplasticity and include an efficient return\nmapping algorithm. This approach is particularly effective for MPM simulations\ninvolving significant deformation and topology changes, while preserving the\nconvexity of the optimization problem. Our method ensures global convergence,\nenabling the use of large simulation time steps without compromising\nrobustness. We have validated our approach through rigorous testing and\nperformance evaluations, highlighting its superior capabilities in managing\ncomplex simulations relevant to robotics. Compared to previous MPM based\nrobotic simulators, our method significantly improves the stability of contact\nresolution -- a critical factor in robot manipulation tasks. We make our method\navailable in the open-source robotics toolkit, Drake.\n","authors":["Zeshun Zong","Chenfanfu Jiang","Xuchen Han"],"pdf_url":"https://arxiv.org/pdf/2403.13783v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13778v1","updated":"2024-03-20T17:41:35Z","published":"2024-03-20T17:41:35Z","title":"Certified Human Trajectory Prediction","summary":"  Trajectory prediction plays an essential role in autonomous vehicles. While\nnumerous strategies have been developed to enhance the robustness of trajectory\nprediction models, these methods are predominantly heuristic and do not offer\nguaranteed robustness against adversarial attacks and noisy observations. In\nthis work, we propose a certification approach tailored for the task of\ntrajectory prediction. To this end, we address the inherent challenges\nassociated with trajectory prediction, including unbounded outputs, and\nmutli-modality, resulting in a model that provides guaranteed robustness.\nFurthermore, we integrate a denoiser into our method to further improve the\nperformance. Through comprehensive evaluations, we demonstrate the\neffectiveness of the proposed technique across various baselines and using\nstandard trajectory prediction datasets. The code will be made available\nonline: https://s-attack.github.io/\n","authors":["Mohammadhossein Bahari","Saeed Saadatnejad","Amirhossein Asgari Farsangi","Seyed-Mohsen Moosavi-Dezfooli","Alexandre Alahi"],"pdf_url":"https://arxiv.org/pdf/2403.13778v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13777v1","updated":"2024-03-20T17:41:21Z","published":"2024-03-20T17:41:21Z","title":"Embedding Pose Graph, Enabling 3D Foundation Model Capabilities with a\n  Compact Representation","summary":"  This paper presents the Embedding Pose Graph (EPG), an innovative method that\ncombines the strengths of foundation models with a simple 3D representation\nsuitable for robotics applications. Addressing the need for efficient spatial\nunderstanding in robotics, EPG provides a compact yet powerful approach by\nattaching foundation model features to the nodes of a pose graph. Unlike\ntraditional methods that rely on bulky data formats like voxel grids or point\nclouds, EPG is lightweight and scalable. It facilitates a range of robotic\ntasks, including open-vocabulary querying, disambiguation, image-based\nquerying, language-directed navigation, and re-localization in 3D environments.\nWe showcase the effectiveness of EPG in handling these tasks, demonstrating its\ncapacity to improve how robots interact with and navigate through complex\nspaces. Through both qualitative and quantitative assessments, we illustrate\nEPG's strong performance and its ability to outperform existing methods in\nre-localization. Our work introduces a crucial step forward in enabling robots\nto efficiently understand and operate within large-scale 3D spaces.\n","authors":["Hugues Thomas","Jian Zhang"],"pdf_url":"https://arxiv.org/pdf/2403.13777v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2306.06192v5","updated":"2024-03-20T17:36:07Z","published":"2023-06-09T18:45:15Z","title":"Ada-NAV: Adaptive Trajectory Length-Based Sample Efficient Policy\n  Learning for Robotic Navigation","summary":"  Trajectory length stands as a crucial hyperparameter within reinforcement\nlearning (RL) algorithms, significantly contributing to the sample inefficiency\nin robotics applications. Motivated by the pivotal role trajectory length plays\nin the training process, we introduce Ada-NAV, a novel adaptive trajectory\nlength scheme designed to enhance the training sample efficiency of RL\nalgorithms in robotic navigation tasks. Unlike traditional approaches that\ntreat trajectory length as a fixed hyperparameter, we propose to dynamically\nadjust it based on the entropy of the underlying navigation policy.\nInterestingly, Ada-NAV can be applied to both existing on-policy and off-policy\nRL methods, which we demonstrate by empirically validating its efficacy on\nthree popular RL methods: REINFORCE, Proximal Policy Optimization (PPO), and\nSoft Actor-Critic (SAC). We demonstrate through simulated and real-world\nrobotic experiments that Ada-NAV outperforms conventional methods that employ\nconstant or randomly sampled trajectory lengths. Specifically, for a fixed\nsample budget, Ada-NAV achieves an 18\\% increase in navigation success rate, a\n20-38\\% reduction in navigation path length, and a 9.32\\% decrease in elevation\ncosts. Furthermore, we showcase the versatility of Ada-NAV by integrating it\nwith the Clearpath Husky robot, illustrating its applicability in complex\noutdoor environments.\n","authors":["Bhrij Patel","Kasun Weerakoon","Wesley A. Suttle","Alec Koppel","Brian M. Sadler","Tianyi Zhou","Amrit Singh Bedi","Dinesh Manocha"],"pdf_url":"https://arxiv.org/pdf/2306.06192v5.pdf","comment":"11 pages, 9 figures, 2 tables"},{"id":"http://arxiv.org/abs/2403.13730v1","updated":"2024-03-20T16:39:48Z","published":"2024-03-20T16:39:48Z","title":"Projection-free computation of robust controllable sets with constrained\n  zonotopes","summary":"  We study the problem of computing robust controllable sets for discrete-time\nlinear systems with additive uncertainty. We propose a tractable and scalable\napproach to inner- and outer-approximate robust controllable sets using\nconstrained zonotopes, when the additive uncertainty set is a symmetric,\nconvex, and compact set. Our least-squares-based approach uses novel\nclosed-form approximations of the Pontryagin difference between a constrained\nzonotopic minuend and a symmetric, convex, and compact subtrahend. Unlike\nexisting approaches, our approach does not rely on convex optimization solvers,\nand is projection-free for ellipsoidal and zonotopic uncertainty sets. We also\npropose a least-squares-based approach to compute a convex, polyhedral\nouter-approximation to constrained zonotopes, and characterize sufficient\nconditions under which all these approximations are exact. We demonstrate the\ncomputational efficiency and scalability of our approach in several case\nstudies, including the design of abort-safe rendezvous trajectories for a\nspacecraft in near-rectilinear halo orbit under uncertainty. Our approach can\ninner-approximate a 20-step robust controllable set for a 100-dimensional\nlinear system in under 15 seconds on a standard computer.\n","authors":["Abraham P. Vinod","Avishai Weiss","Stefano Di Cairano"],"pdf_url":"https://arxiv.org/pdf/2403.13730v1.pdf","comment":"22 pages, 6 figures"},{"id":"http://arxiv.org/abs/2403.13729v1","updated":"2024-03-20T16:39:17Z","published":"2024-03-20T16:39:17Z","title":"Reinforcement Learning for Online Testing of Autonomous Driving Systems:\n  a Replication and Extension Study","summary":"  In a recent study, Reinforcement Learning (RL) used in combination with\nmany-objective search, has been shown to outperform alternative techniques\n(random search and many-objective search) for online testing of Deep Neural\nNetwork-enabled systems. The empirical evaluation of these techniques was\nconducted on a state-of-the-art Autonomous Driving System (ADS). This work is a\nreplication and extension of that empirical study. Our replication shows that\nRL does not outperform pure random test generation in a comparison conducted\nunder the same settings of the original study, but with no confounding factor\ncoming from the way collisions are measured. Our extension aims at eliminating\nsome of the possible reasons for the poor performance of RL observed in our\nreplication: (1) the presence of reward components providing contrasting or\nuseless feedback to the RL agent; (2) the usage of an RL algorithm (Q-learning)\nwhich requires discretization of an intrinsically continuous state space.\nResults show that our new RL agent is able to converge to an effective policy\nthat outperforms random testing. Results also highlight other possible\nimprovements, which open to further investigations on how to best leverage RL\nfor online ADS testing.\n","authors":["Luca Giamattei","Matteo Biagiola","Roberto Pietrantuono","Stefano Russo","Paolo Tonella"],"pdf_url":"https://arxiv.org/pdf/2403.13729v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13714v1","updated":"2024-03-20T16:20:54Z","published":"2024-03-20T16:20:54Z","title":"DBA-Fusion: Tightly Integrating Deep Dense Visual Bundle Adjustment with\n  Multiple Sensors for Large-Scale Localization and Mapping","summary":"  Visual simultaneous localization and mapping (VSLAM) has broad applications,\nwith state-of-the-art methods leveraging deep neural networks for better\nrobustness and applicability. However, there is a lack of research in fusing\nthese learning-based methods with multi-sensor information, which could be\nindispensable to push related applications to large-scale and complex\nscenarios. In this paper, we tightly integrate the trainable deep dense bundle\nadjustment (DBA) with multi-sensor information through a factor graph. In the\nframework, recurrent optical flow and DBA are performed among sequential\nimages. The Hessian information derived from DBA is fed into a generic factor\ngraph for multi-sensor fusion, which employs a sliding window and supports\nprobabilistic marginalization. A pipeline for visual-inertial integration is\nfirstly developed, which provides the minimum ability of metric-scale\nlocalization and mapping. Furthermore, other sensors (e.g., global navigation\nsatellite system) are integrated for driftless and geo-referencing\nfunctionality. Extensive tests are conducted on both public datasets and\nself-collected datasets. The results validate the superior localization\nperformance of our approach, which enables real-time dense mapping in\nlarge-scale environments. The code has been made open-source\n(https://github.com/GREAT-WHU/DBA-Fusion).\n","authors":["Yuxuan Zhou","Xingxing Li","Shengyu Li","Xuanbin Wang","Shaoquan Feng","Yuxuan Tan"],"pdf_url":"https://arxiv.org/pdf/2403.13714v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2402.05840v2","updated":"2024-03-20T16:18:26Z","published":"2024-02-08T17:17:06Z","title":"uPLAM: Robust Panoptic Localization and Mapping Leveraging Perception\n  Uncertainties","summary":"  The availability of a robust map-based localization system is essential for\nthe operation of many autonomously navigating vehicles. Since uncertainty is an\ninevitable part of perception, it is beneficial for the robustness of the robot\nto consider it in typical downstream tasks of navigation stacks. In particular\nlocalization and mapping methods, which in modern systems often employ\nconvolutional neural networks (CNNs) for perception tasks, require proper\nuncertainty estimates. In this work, we present uncertainty-aware Panoptic\nLocalization and Mapping (uPLAM), which employs pixel-wise uncertainty\nestimates for panoptic CNNs as a bridge to fuse modern perception with\nclassical probabilistic localization and mapping approaches. Beyond the\nperception, we introduce an uncertainty-based map aggregation technique to\ncreate accurate panoptic maps, containing surface semantics and landmark\ninstances. Moreover, we provide cell-wise map uncertainties, and present a\nparticle filter-based localization method that employs perception\nuncertainties. Extensive evaluations show that our proposed incorporation of\nuncertainties leads to more accurate maps with reliable uncertainty estimates\nand improved localization accuracy. Additionally, we present the Freiburg\nPanoptic Driving dataset for evaluating panoptic mapping and localization\nmethods. We make our code and dataset available at:\n\\url{http://uplam.cs.uni-freiburg.de}\n","authors":["Kshitij Sirohi","Daniel Büscher","Wolfram Burgard"],"pdf_url":"https://arxiv.org/pdf/2402.05840v2.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13701v1","updated":"2024-03-20T16:06:01Z","published":"2024-03-20T16:06:01Z","title":"What Matters for Active Texture Recognition With Vision-Based Tactile\n  Sensors","summary":"  This paper explores active sensing strategies that employ vision-based\ntactile sensors for robotic perception and classification of fabric textures.\nWe formalize the active sampling problem in the context of tactile fabric\nrecognition and provide an implementation of information-theoretic exploration\nstrategies based on minimizing predictive entropy and variance of probabilistic\nmodels. Through ablation studies and human experiments, we investigate which\ncomponents are crucial for quick and reliable texture recognition. Along with\nthe active sampling strategies, we evaluate neural network architectures,\nrepresentations of uncertainty, influence of data augmentation, and dataset\nvariability. By evaluating our method on a previously published Active Clothing\nPerception Dataset and on a real robotic system, we establish that the choice\nof the active exploration strategy has only a minor influence on the\nrecognition accuracy, whereas data augmentation and dropout rate play a\nsignificantly larger role. In a comparison study, while humans achieve 66.9%\nrecognition accuracy, our best approach reaches 90.0% in under 5 touches,\nhighlighting that vision-based tactile sensors are highly effective for fabric\ntexture recognition.\n","authors":["Alina Böhm","Tim Schneider","Boris Belousov","Alap Kshirsagar","Lisa Lin","Katja Doerschner","Knut Drewing","Constantin A. Rothkopf","Jan Peters"],"pdf_url":"https://arxiv.org/pdf/2403.13701v1.pdf","comment":"7 pages, 9 figures, accepted at 2024 IEEE International Conference on\n  Robotics and Automation (ICRA)"},{"id":"http://arxiv.org/abs/2403.13695v1","updated":"2024-03-20T15:57:44Z","published":"2024-03-20T15:57:44Z","title":"Loss Regularizing Robotic Terrain Classification","summary":"  Locomotion mechanics of legged robots are suitable when pacing through\ndifficult terrains. Recognising terrains for such robots are important to fully\nyoke the versatility of their movements. Consequently, robotic terrain\nclassification becomes significant to classify terrains in real time with high\naccuracy. The conventional classifiers suffer from overfitting problem, low\naccuracy problem, high variance problem, and not suitable for live dataset. On\nthe other hand, classifying a growing dataset is difficult for convolution\nbased terrain classification. Supervised recurrent models are also not\npractical for this classification. Further, the existing recurrent\narchitectures are still evolving to improve accuracy of terrain classification\nbased on live variable-length sensory data collected from legged robots. This\npaper proposes a new semi-supervised method for terrain classification of\nlegged robots, avoiding preprocessing of long variable-length dataset. The\nproposed method has a stacked Long Short-Term Memory architecture, including a\nnew loss regularization. The proposed method solves the existing problems and\nimproves accuracy. Comparison with the existing architectures show the\nimprovements.\n","authors":["Shakti Deo Kumar","Sudhanshu Tripathi","Krishna Ujjwal","Sarvada Sakshi Jha","Suddhasil De"],"pdf_url":"https://arxiv.org/pdf/2403.13695v1.pdf","comment":"Preliminary draft of the work published in IEEE conference 2023"},{"id":"http://arxiv.org/abs/2403.13683v1","updated":"2024-03-20T15:41:32Z","published":"2024-03-20T15:41:32Z","title":"DVMNet: Computing Relative Pose for Unseen Objects Beyond Hypotheses","summary":"  Determining the relative pose of an object between two images is pivotal to\nthe success of generalizable object pose estimation. Existing approaches\ntypically approximate the continuous pose representation with a large number of\ndiscrete pose hypotheses, which incurs a computationally expensive process of\nscoring each hypothesis at test time. By contrast, we present a Deep Voxel\nMatching Network (DVMNet) that eliminates the need for pose hypotheses and\ncomputes the relative object pose in a single pass. To this end, we map the two\ninput RGB images, reference and query, to their respective voxelized 3D\nrepresentations. We then pass the resulting voxels through a pose estimation\nmodule, where the voxels are aligned and the pose is computed in an end-to-end\nfashion by solving a least-squares problem. To enhance robustness, we introduce\na weighted closest voxel algorithm capable of mitigating the impact of noisy\nvoxels. We conduct extensive experiments on the CO3D, LINEMOD, and Objaverse\ndatasets, demonstrating that our method delivers more accurate relative pose\nestimates for novel objects at a lower computational cost compared to\nstate-of-the-art methods. Our code is released at:\nhttps://github.com/sailor-z/DVMNet/.\n","authors":["Chen Zhao","Tong Zhang","Zheng Dang","Mathieu Salzmann"],"pdf_url":"https://arxiv.org/pdf/2403.13683v1.pdf","comment":"Accepted by CVPR 2024"},{"id":"http://arxiv.org/abs/2403.13674v1","updated":"2024-03-20T15:32:56Z","published":"2024-03-20T15:32:56Z","title":"Reward-Driven Automated Curriculum Learning for Interaction-Aware\n  Self-Driving at Unsignalized Intersections","summary":"  In this work, we present a reward-driven automated curriculum reinforcement\nlearning approach for interaction-aware self-driving at unsignalized\nintersections, taking into account the uncertainties associated with\nsurrounding vehicles (SVs). These uncertainties encompass the uncertainty of\nSVs' driving intention and also the quantity of SVs. To deal with this problem,\nthe curriculum set is specifically designed to accommodate a progressively\nincreasing number of SVs. By implementing an automated curriculum selection\nmechanism, the importance weights are rationally allocated across various\ncurricula, thereby facilitating improved sample efficiency and training\noutcomes. Furthermore, the reward function is meticulously designed to guide\nthe agent towards effective policy exploration. Thus the proposed framework\ncould proactively address the above uncertainties at unsignalized intersections\nby employing the automated curriculum learning technique that progressively\nincreases task difficulty, and this ensures safe self-driving through effective\ninteraction with SVs. Comparative experiments are conducted in $Highway\\_Env$,\nand the results indicate that our approach achieves the highest task success\nrate, attains strong robustness to initialization parameters of the curriculum\nselection module, and exhibits superior adaptability to diverse situational\nconfigurations at unsignalized intersections. Furthermore, the effectiveness of\nthe proposed method is validated using the high-fidelity CARLA simulator.\n","authors":["Zengqi Peng","Xiao Zhou","Lei Zheng","Yubin Wang","Jun Ma"],"pdf_url":"https://arxiv.org/pdf/2403.13674v1.pdf","comment":"8 pages, 6 figures"},{"id":"http://arxiv.org/abs/2403.13640v1","updated":"2024-03-20T14:43:51Z","published":"2024-03-20T14:43:51Z","title":"LaCE-LHMP: Airflow Modelling-Inspired Long-Term Human Motion Prediction\n  By Enhancing Laminar Characteristics in Human Flow","summary":"  Long-term human motion prediction (LHMP) is essential for safely operating\nautonomous robots and vehicles in populated environments. It is fundamental for\nvarious applications, including motion planning, tracking, human-robot\ninteraction and safety monitoring. However, accurate prediction of human\ntrajectories is challenging due to complex factors, including, for example,\nsocial norms and environmental conditions. The influence of such factors can be\ncaptured through Maps of Dynamics (MoDs), which encode spatial motion patterns\nlearned from (possibly scattered and partial) past observations of motion in\nthe environment and which can be used for data-efficient, interpretable motion\nprediction (MoD-LHMP). To address the limitations of prior work, especially\nregarding accuracy and sensitivity to anomalies in long-term prediction, we\npropose the Laminar Component Enhanced LHMP approach (LaCE-LHMP). Our approach\nis inspired by data-driven airflow modelling, which estimates laminar and\nturbulent flow components and uses predominantly the laminar components to make\nflow predictions. Based on the hypothesis that human trajectory patterns also\nmanifest laminar flow (that represents predictable motion) and turbulent flow\ncomponents (that reflect more unpredictable and arbitrary motion), LaCE-LHMP\nextracts the laminar patterns in human dynamics and uses them for human motion\nprediction. We demonstrate the superior prediction performance of LaCE-LHMP\nthrough benchmark comparisons with state-of-the-art LHMP methods, offering an\nunconventional perspective and a more intuitive understanding of human movement\npatterns.\n","authors":["Yufei Zhu","Han Fan","Andrey Rudenko","Martin Magnusson","Erik Schaffernicht","Achim J. Lilienthal"],"pdf_url":"https://arxiv.org/pdf/2403.13640v1.pdf","comment":"Accepted to the 2024 IEEE International Conference on Robotics and\n  Automation (ICRA)"},{"id":"http://arxiv.org/abs/2309.13139v3","updated":"2024-03-20T14:43:06Z","published":"2023-09-22T18:48:54Z","title":"Exposing the Unseen: Exposure Time Emulation for Offline Benchmarking of\n  Vision Algorithms","summary":"  Visual Odometry (VO) is one of the fundamental tasks in computer vision for\nrobotics. However, its performance is deeply affected by High Dynamic Range\n(HDR) scenes, omnipresent outdoor. While new Automatic-Exposure (AE) approaches\nto mitigate this have appeared, their comparison in a reproducible manner is\nproblematic. This stems from the fact that the behavior of AE depends on the\nenvironment, and it affects the image acquisition process. Consequently, AE has\ntraditionally only been benchmarked in an online manner, making the experiments\nnon-reproducible. To solve this, we propose a new methodology based on an\nemulator that can generate images at any exposure time. It leverages BorealHDR,\na unique multi-exposure stereo dataset collected over 10 km, on 55 trajectories\nwith challenging illumination conditions. Moreover, it includes\nlidar-inertial-based global maps with pose estimation for each image frame as\nwell as Global Navigation Satellite System (GNSS) data, for comparison. We show\nthat using these images acquired at different exposure times, we can emulate\nrealistic images, keeping a Root-Mean-Square Error (RMSE) below 1.78 % compared\nto ground truth images. To demonstrate the practicality of our approach for\noffline benchmarking, we compared three state-of-the-art AE algorithms on key\nelements of Visual Simultaneous Localization And Mapping (VSLAM) pipeline,\nagainst four baselines. Consequently, reproducible evaluation of AE is now\npossible, speeding up the development of future approaches. Our code and\ndataset are available online at this link:\nhttps://github.com/norlab-ulaval/BorealHDR\n","authors":["Olivier Gamache","Jean-Michel Fortin","Matěj Boxan","Maxime Vaidis","François Pomerleau","Philippe Giguère"],"pdf_url":"https://arxiv.org/pdf/2309.13139v3.pdf","comment":"8 pages, 6 figures, submitted to 2024 IEEE/RSJ International\n  Conference on Intelligent Robots and Systems (IROS 2024)"},{"id":"http://arxiv.org/abs/2302.05855v3","updated":"2024-03-20T14:37:54Z","published":"2023-02-12T04:41:59Z","title":"Investigation of Enhanced Inertial Navigation Algorithms by Functional\n  Iteration","summary":"  The defects of the traditional strapdown inertial navigation algorithms\nbecome well acknowledged and the corresponding enhanced algorithms have been\nquite recently proposed trying to mitigate both theoretical and algorithmic\ndefects. In this paper, the analytical accuracy evaluation of both the\ntraditional algorithms and the enhanced algorithms is investigated, against the\ntrue reference for the first time enabled by the functional iteration approach\nhaving provable convergence. The analyses by the help of MATLAB Symbolic\nToolbox show that the resultant error orders of all algorithms under\ninvestigation are consistent with those in the existing literatures, and the\nenhanced attitude algorithm notably reduces error orders of the traditional\ncounterpart, while the impact of the enhanced velocity algorithm on error order\nreduction is insignificant. Simulation results agree with analyses that the\nsuperiority of the enhanced algorithm over the traditional one in the\nbody-frame attitude computation scenario diminishes significantly in the entire\ninertial navigation computation scenario, while the functional iteration\napproach possesses significant accuracy superiority even under sustained lowly\ndynamic conditions.\n","authors":["Hongyan Jiang","Maoran Zhu","Yuanxin Wu"],"pdf_url":"https://arxiv.org/pdf/2302.05855v3.pdf","comment":"12 pages, 3 figs"},{"id":"http://arxiv.org/abs/2309.08854v2","updated":"2024-03-20T13:44:36Z","published":"2023-09-16T03:11:06Z","title":"Intention-Aware Planner for Robust and Safe Aerial Tracking","summary":"  Autonomous target tracking with quadrotors has wide applications in many\nscenarios, such as cinematographic follow-up shooting or suspect chasing.\nTarget motion prediction is necessary when designing the tracking planner.\nHowever, the widely used constant velocity or constant rotation assumption can\nnot fully capture the dynamics of the target. The tracker may fail when the\ntarget happens to move aggressively, such as sudden turn or deceleration. In\nthis paper, we propose an intention-aware planner by additionally considering\nthe intention of the target to enhance safety and robustness in aerial tracking\napplications. Firstly, a designated intention prediction method is proposed,\nwhich combines a user-defined potential assessment function and a state\nobservation function. A reachable region is generated to specifically evaluate\nthe turning intentions. Then we design an intention-driven hybrid A* method to\npredict the future possible positions for the target. Finally, an\nintention-aware optimization approach is designed to generate a\nspatial-temporal optimal trajectory, allowing the tracker to perceive\nunexpected situations from the target. Benchmark comparisons and real-world\nexperiments are conducted to validate the performance of our method.\n","authors":["Qiuyu Ren","Huan Yu","Jiajun Dai","Zhi Zheng","Jun Meng","Li Xu","Chao Xu","Fei Gao","Yanjun Cao"],"pdf_url":"https://arxiv.org/pdf/2309.08854v2.pdf","comment":"8 pages, 10 figures, submitted to 2024 IEEE/RSJ International\n  Conference on Intelligent Robots and Systems (IROS)"},{"id":"http://arxiv.org/abs/2306.11335v4","updated":"2024-03-20T13:18:18Z","published":"2023-06-20T07:06:04Z","title":"Surfer: Progressive Reasoning with World Models for Robotic Manipulation","summary":"  Considering how to make the model accurately understand and follow natural\nlanguage instructions and perform actions consistent with world knowledge is a\nkey challenge in robot manipulation. This mainly includes human fuzzy\ninstruction reasoning and the following of physical knowledge. Therefore, the\nembodied intelligence agent must have the ability to model world knowledge from\ntraining data. However, most existing vision and language robot manipulation\nmethods mainly operate in less realistic simulator and language settings and\nlack explicit modeling of world knowledge. To bridge this gap, we introduce a\nnovel and simple robot manipulation framework, called Surfer. It is based on\nthe world model, treats robot manipulation as a state transfer of the visual\nscene, and decouples it into two parts: action and scene. Then, the\ngeneralization ability of the model on new instructions and new scenes is\nenhanced by explicit modeling of the action and scene prediction in multi-modal\ninformation. In addition to the framework, we also built a robot manipulation\nsimulator that supports full physics execution based on the MuJoCo physics\nengine. It can automatically generate demonstration training data and test\ndata, effectively reducing labor costs. To conduct a comprehensive and\nsystematic evaluation of the robot manipulation model in terms of language\nunderstanding and physical execution, we also created a robotic manipulation\nbenchmark with progressive reasoning tasks, called SeaWave. It contains 4\nlevels of progressive reasoning tasks and can provide a standardized testing\nplatform for embedded AI agents in multi-modal environments. On average, Surfer\nachieved a success rate of 54.74% on the defined four levels of manipulation\ntasks, exceeding the best baseline performance of 47.64%.\n","authors":["Pengzhen Ren","Kaidong Zhang","Hetao Zheng","Zixuan Li","Yuhang Wen","Fengda Zhu","Mas Ma","Xiaodan Liang"],"pdf_url":"https://arxiv.org/pdf/2306.11335v4.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.11552v2","updated":"2024-03-20T13:15:39Z","published":"2024-03-18T08:03:47Z","title":"LLM3:Large Language Model-based Task and Motion Planning with Motion\n  Failure Reasoning","summary":"  Conventional Task and Motion Planning (TAMP) approaches rely on manually\ncrafted interfaces connecting symbolic task planning with continuous motion\ngeneration. These domain-specific and labor-intensive modules are limited in\naddressing emerging tasks in real-world settings. Here, we present LLM^3, a\nnovel Large Language Model (LLM)-based TAMP framework featuring a\ndomain-independent interface. Specifically, we leverage the powerful reasoning\nand planning capabilities of pre-trained LLMs to propose symbolic action\nsequences and select continuous action parameters for motion planning.\nCrucially, LLM^3 incorporates motion planning feedback through prompting,\nallowing the LLM to iteratively refine its proposals by reasoning about motion\nfailure. Consequently, LLM^3 interfaces between task planning and motion\nplanning, alleviating the intricate design process of handling domain-specific\nmessages between them. Through a series of simulations in a box-packing domain,\nwe quantitatively demonstrate the effectiveness of LLM^3 in solving TAMP\nproblems and the efficiency in selecting action parameters. Ablation studies\nunderscore the significant contribution of motion failure reasoning to the\nsuccess of LLM^3. Furthermore, we conduct qualitative experiments on a physical\nmanipulator, demonstrating the practical applicability of our approach in\nreal-world settings.\n","authors":["Shu Wang","Muzhi Han","Ziyuan Jiao","Zeyu Zhang","Ying Nian Wu","Song-Chun Zhu","Hangxin Liu"],"pdf_url":"https://arxiv.org/pdf/2403.11552v2.pdf","comment":"Submitted to IROS 2024. Codes available:\n  https://github.com/AssassinWS/LLM-TAMP"},{"id":"http://arxiv.org/abs/2307.07975v3","updated":"2024-03-20T12:30:01Z","published":"2023-07-16T07:55:35Z","title":"Pseudo-rigid body networks: learning interpretable deformable object\n  dynamics from partial observations","summary":"  Accurate prediction of deformable linear object (DLO) dynamics is challenging\nif the task at hand requires a human-interpretable yet computationally fast\nmodel. In this work, we draw inspiration from the pseudo-rigid body method\n(PRB) and model a DLO as a serial chain of rigid bodies whose internal state is\nunrolled through time by a dynamics network. This dynamics network is trained\njointly with a physics-informed encoder which maps observed motion variables to\nthe DLO's hidden state. To encourage that the state acquires a physically\nmeaningful representation, we leverage the forward kinematics of the PRB model\nas decoder. We demonstrate in robot experiments that the proposed DLO dynamics\nmodel provides physically interpretable predictions from partial observations\nwhile being on par with black-box models regarding prediction accuracy. The\nproject code is available at: http://tinyurl.com/prb-networks\n","authors":["Shamil Mamedov","A. René Geist","Jan Swevers","Sebastian Trimpe"],"pdf_url":"https://arxiv.org/pdf/2307.07975v3.pdf","comment":"This work has been submitted to the IEEE for possible publication.\n  Copyright may be transferred without notice, after which this version may no\n  longer be accessible"},{"id":"http://arxiv.org/abs/2403.13541v1","updated":"2024-03-20T12:26:02Z","published":"2024-03-20T12:26:02Z","title":"From One to Many: How Active Robot Swarm Sizes Influence Human Cognitive\n  Processes","summary":"  In robotics, understanding human interaction with autonomous systems is\ncrucial for enhancing collaborative technologies. We focus on human-swarm\ninteraction (HSI), exploring how differently sized groups of active robots\naffect operators' cognitive and perceptual reactions over different durations.\nWe analyze the impact of different numbers of active robots within a 15-robot\nswarm on operators' time perception, emotional state, flow experience, and task\ndifficulty perception. Our findings indicate that managing multiple active\nrobots when compared to one active robot significantly alters time perception\nand flow experience, leading to a faster passage of time and increased flow.\nMore active robots and extended durations cause increased emotional arousal and\nperceived task difficulty, highlighting the interaction between robot the\nnumber of active robots and human cognitive processes. These insights inform\nthe creation of intuitive human-swarm interfaces and aid in developing swarm\nrobotic systems aligned with human cognitive structures, enhancing human-robot\ncollaboration.\n","authors":["Julian Kaduk","Müge Cavdan","Knut Drewing","Heiko Hamann"],"pdf_url":"https://arxiv.org/pdf/2403.13541v1.pdf","comment":"This work has been submitted to the IEEE for possible publication.\n  Copyright may be transferred without notice, after which this version may no\n  longer be accessible"},{"id":"http://arxiv.org/abs/2403.13518v1","updated":"2024-03-20T11:38:30Z","published":"2024-03-20T11:38:30Z","title":"Motion Generation from Fine-grained Textual Descriptions","summary":"  The task of text2motion is to generate motion sequences from given textual\ndescriptions, where a model should explore the interactions between natural\nlanguage instructions and human body movements. While most existing works are\nconfined to coarse-grained motion descriptions (e.g., \"A man squats.\"),\nfine-grained ones specifying movements of relevant body parts are barely\nexplored. Models trained with coarse texts may not be able to learn mappings\nfrom fine-grained motion-related words to motion primitives, resulting in the\nfailure in generating motions from unseen descriptions. In this paper, we build\na large-scale language-motion dataset with fine-grained textual descriptions,\nFineHumanML3D, by feeding GPT-3.5-turbo with delicate prompts. Accordingly, we\ndesign a new text2motion model, FineMotionDiffuse, which makes full use of\nfine-grained textual information. Our experiments show that FineMotionDiffuse\ntrained on FineHumanML3D acquires good results in quantitative evaluation. We\nalso find this model can better generate spatially/chronologically composite\nmotions by learning the implicit mappings from simple descriptions to the\ncorresponding basic motions.\n","authors":["Kunhang Li","Yansong Feng"],"pdf_url":"https://arxiv.org/pdf/2403.13518v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13474v1","updated":"2024-03-20T10:22:22Z","published":"2024-03-20T10:22:22Z","title":"Iterative Active-Inactive Obstacle Classification for Time-Optimal\n  Collision Avoidance","summary":"  Time-optimal obstacle avoidance is a prevalent problem encountered in various\nfields, including robotics and autonomous vehicles, where the task involves\ndetermining a path for a moving vehicle to reach its goal while navigating\naround obstacles within its environment. This problem becomes increasingly\nchallenging as the number of obstacles in the environment rises. We propose an\niterative active-inactive obstacle approach, which involves identifying a\nsubset of the obstacles as \"active\", that considers solely the effect of the\n\"active\" obstacles on the path of the moving vehicle. The remaining obstacles\nare considered \"inactive\" and are not considered in the path planning process.\nThe obstacles are classified as 'active' on the basis of previous findings\nderived from prior iterations. This approach allows for a more efficient\ncalculation of the optimal path by reducing the number of obstacles that need\nto be considered. The effectiveness of the proposed method is demonstrated with\ntwo different dynamic models using the various number of obstacles. The results\nshow that the proposed method is able to find the optimal path in a timely\nmanner, while also being able to handle a large number of obstacles in the\nenvironment and the constraints on the motion of the object.\n","authors":["Mehmetcan Kaymaz","Nazim Kemal Ure"],"pdf_url":"https://arxiv.org/pdf/2403.13474v1.pdf","comment":"This paper is under review in IROS24"},{"id":"http://arxiv.org/abs/2403.13467v1","updated":"2024-03-20T10:17:39Z","published":"2024-03-20T10:17:39Z","title":"CLIPSwarm: Generating Drone Shows from Text Prompts with Vision-Language\n  Models","summary":"  This paper introduces CLIPSwarm, a new algorithm designed to automate the\nmodeling of swarm drone formations based on natural language. The algorithm\nbegins by enriching a provided word, to compose a text prompt that serves as\ninput to an iterative approach to find the formation that best matches the\nprovided word. The algorithm iteratively refines formations of robots to align\nwith the textual description, employing different steps for \"exploration\" and\n\"exploitation\". Our framework is currently evaluated on simple formation\ntargets, limited to contour shapes. A formation is visually represented through\nalpha-shape contours and the most representative color is automatically found\nfor the input word. To measure the similarity between the description and the\nvisual representation of the formation, we use CLIP [1], encoding text and\nimages into vectors and assessing their similarity. Subsequently, the algorithm\nrearranges the formation to visually represent the word more effectively,\nwithin the given constraints of available drones. Control actions are then\nassigned to the drones, ensuring robotic behavior and collision-free movement.\nExperimental results demonstrate the system's efficacy in accurately modeling\nrobot formations from natural language descriptions. The algorithm's\nversatility is showcased through the execution of drone shows in photorealistic\nsimulation with varying shapes. We refer the reader to the supplementary video\nfor a visual reference of the results.\n","authors":["Pablo Pueyo","Eduardo Montijano","Ana C. Murillo","Mac Schwager"],"pdf_url":"https://arxiv.org/pdf/2403.13467v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13455v1","updated":"2024-03-20T10:01:52Z","published":"2024-03-20T10:01:52Z","title":"FACT: Fast and Active Coordinate Initialization for Vision-based Drone\n  Swarms","summary":"  Swarm robots have sparked remarkable developments across a range of fields.\nWhile it is necessary for various applications in swarm robots, a fast and\nrobust coordinate initialization in vision-based drone swarms remains elusive.\nTo this end, our paper proposes a complete system to recover a swarm's initial\nrelative pose on platforms with size, weight, and power (SWaP) constraints. To\novercome limited coverage of field-of-view (FoV), the drones rotate in place to\nobtain observations. To tackle the anonymous measurements, we formulate a\nnon-convex rotation estimation problem and transform it into a semi-definite\nprogramming (SDP) problem, which can steadily obtain global optimal values.\nThen we utilize the Hungarian algorithm to recover relative translation and\ncorrespondences between observations and drone identities. To safely acquire\ncomplete observations, we actively search for positions and generate feasible\ntrajectories to avoid collisions. To validate the practicability of our system,\nwe conduct experiments on a vision-based drone swarm with only stereo cameras\nand inertial measurement units (IMUs) as sensors. The results demonstrate that\nthe system can robustly get accurate relative poses in real time with limited\nonboard computation resources. The source code is released.\n","authors":["Yuan Li","Anke Zhao","Yingjian Wang","Ziyi Xu","Xin Zhou","Jinni Zhou","Chao Xu","Fei Gao"],"pdf_url":"https://arxiv.org/pdf/2403.13455v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13452v1","updated":"2024-03-20T09:53:31Z","published":"2024-03-20T09:53:31Z","title":"Mobile Robot Localization: a Modular, Odometry-Improving Approach","summary":"  Despite the number of works published in recent years, vehicle localization\nremains an open, challenging problem. While map-based localization and SLAM\nalgorithms are getting better and better, they remain a single point of failure\nin typical localization pipelines. This paper proposes a modular localization\narchitecture that fuses sensor measurements with the outputs of off-the-shelf\nlocalization algorithms. The fusion filter estimates model uncertainties to\nimprove odometry in case absolute pose measurements are lost entirely. The\narchitecture is validated experimentally on a real robot navigating\nautonomously proving a reduction of the position error of more than 90% with\nrespect to the odometrical estimate without uncertainty estimation in a\ntwo-minute navigation period without position measurements.\n","authors":["Luca Mozzarelli","Luca Cattaneo","Matteo Corno","Sergio Matteo Savaresi"],"pdf_url":"https://arxiv.org/pdf/2403.13452v1.pdf","comment":"Accepted at IEEE European Control Conference 2024"},{"id":"http://arxiv.org/abs/2403.13443v1","updated":"2024-03-20T09:39:39Z","published":"2024-03-20T09:39:39Z","title":"Fast-Poly: A Fast Polyhedral Framework For 3D Multi-Object Tracking","summary":"  3D Multi-Object Tracking (MOT) captures stable and comprehensive motion\nstates of surrounding obstacles, essential for robotic perception. However,\ncurrent 3D trackers face issues with accuracy and latency consistency. In this\npaper, we propose Fast-Poly, a fast and effective filter-based method for 3D\nMOT. Building upon our previous work Poly-MOT, Fast-Poly addresses object\nrotational anisotropy in 3D space, enhances local computation densification,\nand leverages parallelization technique, improving inference speed and\nprecision. Fast-Poly is extensively tested on two large-scale tracking\nbenchmarks with Python implementation. On the nuScenes dataset, Fast-Poly\nachieves new state-of-the-art performance with 75.8% AMOTA among all methods\nand can run at 34.2 FPS on a personal CPU. On the Waymo dataset, Fast-Poly\nexhibits competitive accuracy with 63.6% MOTA and impressive inference speed\n(35.5 FPS). The source code is publicly available at\nhttps://github.com/lixiaoyu2000/FastPoly.\n","authors":["Xiaoyu Li","Dedong Liu","Lijun Zhao","Yitao Wu","Xian Wu","Jinghan Gao"],"pdf_url":"https://arxiv.org/pdf/2403.13443v1.pdf","comment":"1st on the NuScenes Tracking benchmark with 75.8 AMOTA and 34.2 FPS"},{"id":"http://arxiv.org/abs/2403.13431v1","updated":"2024-03-20T09:18:19Z","published":"2024-03-20T09:18:19Z","title":"Automatic Navigation Map Generation for Mobile Robots in Urban\n  Environments","summary":"  A fundamental prerequisite for safe and efficient navigation of mobile robots\nis the availability of reliable navigation maps upon which trajectories can be\nplanned. With the increasing industrial interest in mobile robotics, especially\nin urban environments, the process of generating navigation maps has become of\nparticular interest, being a labor intensive step of the deployment process.\nAutomating this step is challenging and becomes even more arduous when the\nperception capabilities are limited by cost considerations. This paper proposes\nan algorithm to automatically generate navigation maps using a typical\nnavigation-oriented sensor setup: a single top-mounted 3D LiDAR sensor. The\nproposed method is designed and validated with the urban environment as the\nmain use case: it is shown to be able to produce accurate maps featuring\ndifferent terrain types, positive obstacles of different heights as well as\nnegative obstacles. The algorithm is applied to data collected in a typical\nurban environment with a wheeled inverted pendulum robot, showing its\nrobustness against localization, perception and dynamic uncertainties. The\ngenerated map is validated against a human-made map.\n","authors":["Luca Mozzarelli","Simone Specchia","Matteo Corno","Sergio Matteo Savaresi"],"pdf_url":"https://arxiv.org/pdf/2403.13431v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2312.04530v2","updated":"2024-03-20T09:12:21Z","published":"2023-12-07T18:50:01Z","title":"Camera Height Doesn't Change: Unsupervised Training for Metric Monocular\n  Road-Scene Depth Estimation","summary":"  In this paper, we introduce a novel training method for making any monocular\ndepth network learn absolute scale and estimate metric road-scene depth just\nfrom regular training data, i.e., driving videos. We refer to this training\nframework as StableCamH. The key idea is to leverage cars found on the road as\nsources of scale supervision but to incorporate them in the training robustly.\nStableCamH detects and estimates the sizes of cars in the frame and aggregates\nscale information extracted from them into a camera height estimate whose\nconsistency across the entire video sequence is enforced as scale supervision.\nThis realizes robust unsupervised training of any, otherwise scale-oblivious,\nmonocular depth network to become not only scale-aware but also metric-accurate\nwithout the need for auxiliary sensors and extra supervision. Extensive\nexperiments on the KITTI and Cityscapes datasets show the effectiveness of\nStableCamH and its state-of-the-art accuracy compared with related methods. We\nalso show that StableCamH enables training on mixed datasets of different\ncamera heights, which leads to larger-scale training and thus higher\ngeneralization. Metric depth reconstruction is essential in any road-scene\nvisual modeling, and StableCamH democratizes its deployment by establishing the\nmeans to train any model as a metric depth estimator.\n","authors":["Genki Kinoshita","Ko Nishino"],"pdf_url":"https://arxiv.org/pdf/2312.04530v2.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13421v1","updated":"2024-03-20T09:07:23Z","published":"2024-03-20T09:07:23Z","title":"Caching-Augmented Lifelong Multi-Agent Path Finding","summary":"  Multi-Agent Path Finding (MAPF), which involves finding collision-free paths\nfor multiple robots, is crucial in various applications. Lifelong MAPF, where\ntargets are reassigned to agents as soon as they complete their initial\nobjectives, offers a more accurate approximation of real-world warehouse\nplanning. In this paper, we present a novel mechanism named Caching-Augmented\nLifelong MAPF (CAL-MAPF), designed to improve the performance of Lifelong MAPF.\nWe have developed a new map grid type called cache for temporary item storage\nand replacement and designed a lock mechanism for it to improve the stability\nof the planning solution. This cache mechanism was evaluated using various\ncache replacement policies and a spectrum of input task distributions. We\nidentified three main factors significantly impacting CAL-MAPF performance\nthrough experimentation: suitable input task distribution, high cache hit rate,\nand smooth traffic. Overall, CAL-MAPF has demonstrated potential for\nperformance improvements in certain task distributions, maps and agent\nconfigurations.\n","authors":["Yimin Tang","Zhenghong Yu","Yi Zheng","T. K. Satish Kumar","Jiaoyang Li","Sven Koenig"],"pdf_url":"https://arxiv.org/pdf/2403.13421v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2307.08221v2","updated":"2024-03-20T08:52:04Z","published":"2023-07-17T03:45:47Z","title":"NDT-Map-Code: A 3D global descriptor for real-time loop closure\n  detection in lidar SLAM","summary":"  Loop-closure detection, also known as place recognition, aiming to identify\npreviously visited locations, is an essential component of a SLAM system.\nExisting research on lidar-based loop closure heavily relies on dense point\ncloud and 360 FOV lidars. This paper proposes an out-of-the-box NDT (Normal\nDistribution Transform) based global descriptor, NDT-Map-Code, designed for\nboth on-road driving and underground valet parking scenarios. NDT-Map-Code can\nbe directly extracted from the NDT map without the need for a dense point\ncloud, resulting in excellent scalability and low maintenance cost. The NDT\nrepresentation is leveraged to identify representative patterns, which are\nfurther encoded according to their spatial location (bearing, range, and\nheight). Experimental results on the NIO underground parking lot dataset and\nthe KITTI dataset demonstrate that our method achieves significantly better\nperformance compared to the state-of-the-art.\n","authors":["Lizhou Liao","Wenlei Yan","Li Sun","Xinhui Bai","Zhenxing You","Hongyuan Yuan","Chunyun Fu"],"pdf_url":"https://arxiv.org/pdf/2307.08221v2.pdf","comment":"8 pages, 6 figures, 4 tables"},{"id":"http://arxiv.org/abs/2206.06112v3","updated":"2024-03-20T08:41:49Z","published":"2022-06-13T12:53:54Z","title":"Vision-State Fusion: Improving Deep Neural Networks for Autonomous\n  Robotics","summary":"  Vision-based deep learning perception fulfills a paramount role in robotics,\nfacilitating solutions to many challenging scenarios, such as acrobatic\nmaneuvers of autonomous unmanned aerial vehicles (UAVs) and robot-assisted\nhigh-precision surgery. Control-oriented end-to-end perception approaches,\nwhich directly output control variables for the robot, commonly take advantage\nof the robot's state estimation as an auxiliary input. When intermediate\noutputs are estimated and fed to a lower-level controller, i.e. mediated\napproaches, the robot's state is commonly used as an input only for egocentric\ntasks, which estimate physical properties of the robot itself. In this work, we\npropose to apply a similar approach for the first time -- to the best of our\nknowledge -- to non-egocentric mediated tasks, where the estimated outputs\nrefer to an external subject. We prove how our general methodology improves the\nregression performance of deep convolutional neural networks (CNNs) on a broad\nclass of non-egocentric 3D pose estimation problems, with minimal computational\ncost. By analyzing three highly-different use cases, spanning from grasping\nwith a robotic arm to following a human subject with a pocket-sized UAV, our\nresults consistently improve the R\\textsuperscript{2} regression metric, up to\n+0.51, compared to their stateless baselines. Finally, we validate the in-field\nperformance of a closed-loop autonomous cm-scale UAV on the human pose\nestimation task. Our results show a significant reduction, i.e., 24\\% on\naverage, on the mean absolute error of our stateful CNN, compared to a\nState-of-the-Art stateless counterpart.\n","authors":["Elia Cereda","Stefano Bonato","Mirko Nava","Alessandro Giusti","Daniele Palossi"],"pdf_url":"https://arxiv.org/pdf/2206.06112v3.pdf","comment":"This paper has been accepted for publication in the Journal of\n  Intelligent & Robotic Systems. \\copyright 2024 Springer"},{"id":"http://arxiv.org/abs/2403.13395v1","updated":"2024-03-20T08:35:57Z","published":"2024-03-20T08:35:57Z","title":"Unifying Local and Global Multimodal Features for Place Recognition in\n  Aliased and Low-Texture Environments","summary":"  Perceptual aliasing and weak textures pose significant challenges to the task\nof place recognition, hindering the performance of Simultaneous Localization\nand Mapping (SLAM) systems. This paper presents a novel model, called UMF\n(standing for Unifying Local and Global Multimodal Features) that 1) leverages\nmulti-modality by cross-attention blocks between vision and LiDAR features, and\n2) includes a re-ranking stage that re-orders based on local feature matching\nthe top-k candidates retrieved using a global representation. Our experiments,\nparticularly on sequences captured on a planetary-analogous environment, show\nthat UMF outperforms significantly previous baselines in those challenging\naliased environments. Since our work aims to enhance the reliability of SLAM in\nall situations, we also explore its performance on the widely used RobotCar\ndataset, for broader applicability. Code and models are available at\nhttps://github.com/DLR-RM/UMF\n","authors":["Alberto García-Hernández","Riccardo Giubilato","Klaus H. Strobl","Javier Civera","Rudolph Triebel"],"pdf_url":"https://arxiv.org/pdf/2403.13395v1.pdf","comment":"Accepted submission to International Conference on Robotics and\n  Automation (ICRA), 2024"},{"id":"http://arxiv.org/abs/2401.01657v3","updated":"2024-03-20T08:15:37Z","published":"2024-01-03T10:31:12Z","title":"Distributed Pose-graph Optimization with Multi-level Partitioning for\n  Collaborative SLAM","summary":"  The back-end module of Distributed Collaborative Simultaneous Localization\nand Mapping (DCSLAM) requires solving a nonlinear Pose Graph Optimization (PGO)\nunder a distributed setting, also known as SE(d)-synchronization. Most existing\ndistributed graph optimization algorithms employ a simple sequential\npartitioning scheme, which may result in unbalanced subgraph dimensions due to\nthe different geographic locations of each robot, and hence imposes extra\ncommunication load. Moreover, the performance of current Riemannian\noptimization algorithms can be further accelerated. In this letter, we propose\na novel distributed pose graph optimization algorithm combining multi-level\npartitioning with an accelerated Riemannian optimization method. Firstly, we\nemploy the multi-level graph partitioning algorithm to preprocess the naive\npose graph to formulate a balanced optimization problem. In addition, inspired\nby the accelerated coordinate descent method, we devise an Improved Riemannian\nBlock Coordinate Descent (IRBCD) algorithm and the critical point obtained is\nglobally optimal. Finally, we evaluate the effects of four common graph\npartitioning approaches on the correlation of the inter-subgraphs, and discover\nthat the Highest scheme has the best partitioning performance. Also, we\nimplement simulations to quantitatively demonstrate that our proposed algorithm\noutperforms the state-of-the-art distributed pose graph optimization protocols.\n","authors":["Cunhao Li","Peng Yi","Guanghui Guo","Yiguang Hong"],"pdf_url":"https://arxiv.org/pdf/2401.01657v3.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.01233v2","updated":"2024-03-20T07:52:35Z","published":"2024-03-02T15:32:15Z","title":"Results and Lessons Learned from Autonomous Driving Transportation\n  Services in Airfield, Crowded Indoor, and Urban Environments","summary":"  Autonomous vehicles have been actively investigated over the past few\ndecades. Several recent works show the potential of autonomous vehicles in\nurban environments with impressive experimental results. However, these works\nnote that autonomous vehicles are still occasionally inferior to expert drivers\nin complex scenarios. Furthermore, they do not focus on the possibilities of\nautonomous driving transportation services in other areas beyond urban\nenvironments. This paper presents the research results and lessons learned from\nautonomous driving transportation services in airfield, crowded indoor, and\nurban environments. We discuss how we address several unique challenges in\nthese diverse environments. We also offer an overview of remaining challenges\nthat have not received much attention but must be addressed. This paper aims to\nshare our unique experience to support researchers who are interested in\nexploring autonomous driving transportation services in various real-world\nenvironments.\n","authors":["Doosan Baek","Sanghyun Kim","Seung-Woo Seo","Sang-Hyun Lee"],"pdf_url":"https://arxiv.org/pdf/2403.01233v2.pdf","comment":"8 pages, 7 figures, 4 tables"},{"id":"http://arxiv.org/abs/2403.13366v1","updated":"2024-03-20T07:51:53Z","published":"2024-03-20T07:51:53Z","title":"Centroidal State Estimation based on the Koopman Embedding for Dynamic\n  Legged Locomotion","summary":"  In this paper, we introduce a novel approach to centroidal state estimation,\nwhich plays a crucial role in predictive model-based control strategies for\ndynamic legged locomotion. Our approach uses the Koopman operator theory to\ntransform the robot's complex nonlinear dynamics into a linear system, by\nemploying dynamic mode decomposition and deep learning for model construction.\nWe evaluate both models on their linearization accuracy and capability to\ncapture both fast and slow dynamic system responses. We then select the most\nsuitable model for estimation purposes, and integrate it within a moving\nhorizon estimator. This estimator is formulated as a convex quadratic program,\nto facilitate robust, real-time centroidal state estimation. Through extensive\nsimulation experiments on a quadruped robot executing various dynamic gaits,\nour data-driven framework outperforms conventional filtering techniques based\non nonlinear dynamics. Our estimator addresses challenges posed by force/torque\nmeasurement noise in highly dynamic motions and accurately recovers the\ncentroidal states, demonstrating the adaptability and effectiveness of the\nKoopman-based linear representation for complex locomotive behaviors.\nImportantly, our model based on dynamic mode decomposition, trained with two\nlocomotion patterns (trot and jump), successfully estimates the centroidal\nstates for a different motion (bound) without retraining.\n","authors":["Shahram Khorshidi","Murad Dawood","Maren Bennewitz"],"pdf_url":"https://arxiv.org/pdf/2403.13366v1.pdf","comment":"Submitted to IROS 2024"},{"id":"http://arxiv.org/abs/2403.13365v1","updated":"2024-03-20T07:48:32Z","published":"2024-03-20T07:48:32Z","title":"ManiPose: A Comprehensive Benchmark for Pose-aware Object Manipulation\n  in Robotics","summary":"  Robotic manipulation in everyday scenarios, especially in unstructured\nenvironments, requires skills in pose-aware object manipulation (POM), which\nadapts robots' grasping and handling according to an object's 6D pose.\nRecognizing an object's position and orientation is crucial for effective\nmanipulation. For example, if a mug is lying on its side, it's more effective\nto grasp it by the rim rather than the handle. Despite its importance, research\nin POM skills remains limited, because learning manipulation skills requires\npose-varying simulation environments and datasets. This paper introduces\nManiPose, a pioneering benchmark designed to advance the study of pose-varying\nmanipulation tasks. ManiPose encompasses: 1) Simulation environments for POM\nfeature tasks ranging from 6D pose-specific pick-and-place of single objects to\ncluttered scenes, further including interactions with articulated objects. 2) A\ncomprehensive dataset featuring geometrically consistent and\nmanipulation-oriented 6D pose labels for 2936 real-world scanned rigid objects\nand 100 articulated objects across 59 categories. 3) A baseline for POM,\nleveraging the inferencing abilities of LLM (e.g., ChatGPT) to analyze the\nrelationship between 6D pose and task-specific requirements, offers enhanced\npose-aware grasp prediction and motion planning capabilities. Our benchmark\ndemonstrates notable advancements in pose estimation, pose-aware manipulation,\nand real-robot skill transfer, setting new standards for POM research. We will\nopen-source the ManiPose benchmark with the final version paper, inviting the\ncommunity to engage with our resources, available at our\nwebsite:https://sites.google.com/view/manipose.\n","authors":["Qiaojun Yu","Ce Hao","Junbo Wang","Wenhai Liu","Liu Liu","Yao Mu","Yang You","Hengxu Yan","Cewu Lu"],"pdf_url":"https://arxiv.org/pdf/2403.13365v1.pdf","comment":"8 pages, 7 figures, submitted to 2024 IEEE/RSJ International\n  Conference on Intelligent Robots and Systems (IROS 2024)"},{"id":"http://arxiv.org/abs/2403.13358v1","updated":"2024-03-20T07:36:43Z","published":"2024-03-20T07:36:43Z","title":"GeRM: A Generalist Robotic Model with Mixture-of-experts for Quadruped\n  Robot","summary":"  Multi-task robot learning holds significant importance in tackling diverse\nand complex scenarios. However, current approaches are hindered by performance\nissues and difficulties in collecting training datasets. In this paper, we\npropose GeRM (Generalist Robotic Model). We utilize offline reinforcement\nlearning to optimize data utilization strategies to learn from both\ndemonstrations and sub-optimal data, thus surpassing the limitations of human\ndemonstrations. Thereafter, we employ a transformer-based VLA network to\nprocess multi-modal inputs and output actions. By introducing the\nMixture-of-Experts structure, GeRM allows faster inference speed with higher\nwhole model capacity, and thus resolves the issue of limited RL parameters,\nenhancing model performance in multi-task learning while controlling\ncomputational costs. Through a series of experiments, we demonstrate that GeRM\noutperforms other methods across all tasks, while also validating its\nefficiency in both training and inference processes. Additionally, we uncover\nits potential to acquire emergent skills. Additionally, we contribute the\nQUARD-Auto dataset, collected automatically to support our training approach\nand foster advancements in multi-task quadruped robot learning. This work\npresents a new paradigm for reducing the cost of collecting robot data and\ndriving progress in the multi-task learning community.\n","authors":["Wenxuan Song","Han Zhao","Pengxiang Ding","Can Cui","Shangke Lyu","Yaning Fan","Donglin Wang"],"pdf_url":"https://arxiv.org/pdf/2403.13358v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13348v1","updated":"2024-03-20T07:19:53Z","published":"2024-03-20T07:19:53Z","title":"MULAN-WC: Multi-Robot Localization Uncertainty-aware Active NeRF with\n  Wireless Coordination","summary":"  This paper presents MULAN-WC, a novel multi-robot 3D reconstruction framework\nthat leverages wireless signal-based coordination between robots and Neural\nRadiance Fields (NeRF). Our approach addresses key challenges in multi-robot 3D\nreconstruction, including inter-robot pose estimation, localization uncertainty\nquantification, and active best-next-view selection. We introduce a method for\nusing wireless Angle-of-Arrival (AoA) and ranging measurements to estimate\nrelative poses between robots, as well as quantifying and incorporating the\nuncertainty embedded in the wireless localization of these pose estimates into\nthe NeRF training loss to mitigate the impact of inaccurate camera poses.\nFurthermore, we propose an active view selection approach that accounts for\nrobot pose uncertainty when determining the next-best views to improve the 3D\nreconstruction, enabling faster convergence through intelligent view selection.\nExtensive experiments on both synthetic and real-world datasets demonstrate the\neffectiveness of our framework in theory and in practice. Leveraging wireless\ncoordination and localization uncertainty-aware training, MULAN-WC can achieve\nhigh-quality 3d reconstruction which is close to applying the ground truth\ncamera poses. Furthermore, the quantification of the information gain from a\nnovel view enables consistent rendering quality improvement with incrementally\ncaptured images by commending the robot the novel view position. Our hardware\nexperiments showcase the practicality of deploying MULAN-WC to real robotic\nsystems.\n","authors":["Weiying Wang","Victor Cai","Stephanie Gil"],"pdf_url":"https://arxiv.org/pdf/2403.13348v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13336v1","updated":"2024-03-20T06:42:12Z","published":"2024-03-20T06:42:12Z","title":"Discretizing SO(2)-Equivariant Features for Robotic Kitting","summary":"  Robotic kitting has attracted considerable attention in logistics and\nindustrial settings. However, existing kitting methods encounter challenges\nsuch as low precision and poor efficiency, limiting their widespread\napplications. To address these issues, we present a novel kitting framework\nthat improves both the precision and computational efficiency of complex\nkitting tasks. Firstly, our approach introduces a fine-grained orientation\nestimation technique in the picking module, significantly enhancing orientation\nprecision while effectively decoupling computational load from orientation\ngranularity. This approach combines an SO(2)-equivariant network with a group\ndiscretization operation to preciously predict discrete orientation\ndistributions. Secondly, we develop the Hand-tool Kitting Dataset (HKD) to\nevaluate the performance of different solutions in handling\norientation-sensitive kitting tasks. This dataset comprises a diverse\ncollection of hand tools and synthetically created kits, which reflects the\ncomplexities encountered in real-world kitting scenarios. Finally, a series of\nexperiments are conducted to evaluate the performance of the proposed method.\nThe results demonstrate that our approach offers remarkable precision and\nenhanced computational efficiency in robotic kitting tasks.\n","authors":["Jiadong Zhou","Yadan Zeng","Huixu Dong","I-Ming Chen"],"pdf_url":"https://arxiv.org/pdf/2403.13336v1.pdf","comment":"8 pages, 6 figures"},{"id":"http://arxiv.org/abs/2403.13321v1","updated":"2024-03-20T05:57:20Z","published":"2024-03-20T05:57:20Z","title":"Robotics meets Fluid Dynamics: A Characterization of the Induced Airflow\n  around a Quadrotor","summary":"  The widespread adoption of quadrotors for diverse applications, from\nagriculture to public safety, necessitates an understanding of the aerodynamic\ndisturbances they create. This paper introduces a computationally lightweight\nmodel for estimating the time-averaged magnitude of the induced flow below\nquadrotors in hover. Unlike related approaches that rely on expensive\ncomputational fluid dynamics (CFD) simulations or time-consuming empirical\nmeasurements, our method leverages classical theory from turbulent flows. By\nanalyzing over 9 hours of flight data from drones of varying sizes within a\nlarge motion capture system, we show that the combined flow from all propellers\nof the drone is well-approximated by a turbulent jet. Through the use of a\nnovel normalization and scaling, we have developed and experimentally validated\na unified model that describes the mean velocity field of the induced flow for\ndifferent drone sizes. The model accurately describes the far-field airflow in\na very large volume below the drone which is difficult to simulate in CFD. Our\nmodel, which requires only the drone's mass, propeller size, and drone size for\ncalculations, offers a practical tool for dynamic planning in multi-agent\nscenarios, ensuring safer operations near humans and optimizing sensor\nplacements.\n","authors":["Leonard Bauersfeld","Koen Muller","Dominic Ziegler","Filippo Coletti","Davide Scaramuzza"],"pdf_url":"https://arxiv.org/pdf/2403.13321v1.pdf","comment":"7+1 pages"},{"id":"http://arxiv.org/abs/2403.13318v1","updated":"2024-03-20T05:46:56Z","published":"2024-03-20T05:46:56Z","title":"Workload Estimation for Unknown Tasks: A Survey of Machine Learning\n  Under Distribution Shift","summary":"  Human-robot teams involve humans and robots collaborating to achieve tasks\nunder various environmental conditions. Successful teaming will require robots\nto adapt autonomously to a human teammate's internal state. An important\nelement of such adaptation is the ability to estimate the human teammates'\nworkload in unknown situations. Existing workload models use machine learning\nto model the relationships between physiological metrics and workload; however,\nthese methods are susceptible to individual differences and are heavily\ninfluenced by other factors. These methods cannot generalize to unknown tasks,\nas they rely on standard machine learning approaches that assume data consists\nof independent and identically distributed (IID) samples. This assumption does\nnot necessarily hold for estimating workload for new tasks. A survey of non-IID\nmachine learning techniques is presented, where commonly used techniques are\nevaluated using three criteria: portability, model complexity, and\nadaptability. These criteria are used to argue which techniques are most\napplicable for estimating workload for unknown tasks in dynamic, real-time\nenvironments.\n","authors":["Josh Bhagat Smith","Julie A. Adams"],"pdf_url":"https://arxiv.org/pdf/2403.13318v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13311v1","updated":"2024-03-20T05:23:24Z","published":"2024-03-20T05:23:24Z","title":"Multi-Robot Connected Fermat Spiral Coverage","summary":"  We introduce the Multi-Robot Connected Fermat Spiral (MCFS), a novel\nalgorithmic framework for Multi-Robot Coverage Path Planning (MCPP) that adapts\nConnected Fermat Spiral (CFS) from the computer graphics community to\nmulti-robot coordination for the first time. MCFS uniquely enables the\norchestration of multiple robots to generate coverage paths that contour around\narbitrarily shaped obstacles, a feature that is notably lacking in traditional\nmethods. Our framework not only enhances area coverage and optimizes task\nperformance, particularly in terms of makespan, for workspaces rich in\nirregular obstacles but also addresses the challenges of path continuity and\ncurvature critical for non-holonomic robots by generating smooth paths without\ndecomposing the workspace. MCFS solves MCPP by constructing a graph of isolines\nand transforming MCPP into a combinatorial optimization problem, aiming to\nminimize the makespan while covering all vertices. Our contributions include\ndeveloping a unified CFS version for scalable and adaptable MCPP, extending it\nto MCPP with novel optimization techniques for cost reduction and path\ncontinuity and smoothness, and demonstrating through extensive experiments that\nMCFS outperforms existing MCPP methods in makespan, path curvature, coverage\nratio, and overlapping ratio. Our research marks a significant step in MCPP,\nshowcasing the fusion of computer graphics and automated planning principles to\nadvance the capabilities of multi-robot systems in complex environments. Our\ncode is available at https://github.com/reso1/MCFS.\n","authors":["Jingtao Tang","Hang Ma"],"pdf_url":"https://arxiv.org/pdf/2403.13311v1.pdf","comment":"accepted to ICAPS24"},{"id":"http://arxiv.org/abs/2403.13297v1","updated":"2024-03-20T04:39:15Z","published":"2024-03-20T04:39:15Z","title":"POLICEd RL: Learning Closed-Loop Robot Control Policies with Provable\n  Satisfaction of Hard Constraints","summary":"  In this paper, we seek to learn a robot policy guaranteed to satisfy state\nconstraints. To encourage constraint satisfaction, existing RL algorithms\ntypically rely on Constrained Markov Decision Processes and discourage\nconstraint violations through reward shaping. However, such soft constraints\ncannot offer verifiable safety guarantees. To address this gap, we propose\nPOLICEd RL, a novel RL algorithm explicitly designed to enforce affine hard\nconstraints in closed-loop with a black-box environment. Our key insight is to\nforce the learned policy to be affine around the unsafe set and use this affine\nregion as a repulsive buffer to prevent trajectories from violating the\nconstraint. We prove that such policies exist and guarantee constraint\nsatisfaction. Our proposed framework is applicable to both systems with\ncontinuous and discrete state and action spaces and is agnostic to the choice\nof the RL training algorithm. Our results demonstrate the capacity of POLICEd\nRL to enforce hard constraints in robotic tasks while significantly\noutperforming existing methods.\n","authors":["Jean-Baptiste Bouvier","Kartik Nagpal","Negar Mehr"],"pdf_url":"https://arxiv.org/pdf/2403.13297v1.pdf","comment":"26 pages, 11 figures"},{"id":"http://arxiv.org/abs/2403.13294v1","updated":"2024-03-20T04:25:09Z","published":"2024-03-20T04:25:09Z","title":"Map-Aware Human Pose Prediction for Robot Follow-Ahead","summary":"  In the robot follow-ahead task, a mobile robot is tasked to maintain its\nrelative position in front of a moving human actor while keeping the actor in\nsight. To accomplish this task, it is important that the robot understand the\nfull 3D pose of the human (since the head orientation can be different than the\ntorso) and predict future human poses so as to plan accordingly. This\nprediction task is especially tricky in a complex environment with junctions\nand multiple corridors. In this work, we address the problem of forecasting the\nfull 3D trajectory of a human in such environments. Our main insight is to show\nthat one can first predict the 2D trajectory and then estimate the full 3D\ntrajectory by conditioning the estimator on the predicted 2D trajectory. With\nthis approach, we achieve results comparable or better than the\nstate-of-the-art methods three times faster. As part of our contribution, we\npresent a new dataset where, in contrast to existing datasets, the human motion\nis in a much larger area than a single room. We also present a complete robot\nsystem that integrates our human pose forecasting network on the mobile robot\nto enable real-time robot follow-ahead and present results from real-world\nexperiments in multiple buildings on campus. Our project page, including\nsupplementary material and videos, can be found at:\nhttps://qingyuan-jiang.github.io/iros2024_poseForecasting/\n","authors":["Qingyuan Jiang","Burak Susam","Jun-Jee Chao","Volkan Isler"],"pdf_url":"https://arxiv.org/pdf/2403.13294v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13284v1","updated":"2024-03-20T03:53:20Z","published":"2024-03-20T03:53:20Z","title":"Look Before You Leap: Socially Acceptable High-Speed Ground Robot\n  Navigation in Crowded Hallways","summary":"  To operate safely and efficiently, autonomous warehouse/delivery robots must\nbe able to accomplish tasks while navigating in dynamic environments and\nhandling the large uncertainties associated with the motions/behaviors of other\nrobots and/or humans. A key scenario in such environments is the hallway\nproblem, where robots must operate in the same narrow corridor as human traffic\ngoing in one or both directions. Traditionally, robot planners have tended to\nfocus on socially acceptable behavior in the hallway scenario at the expense of\nperformance. This paper proposes a planner that aims to address the consequent\n\"robot freezing problem\" in hallways by allowing for \"peek-and-pass\" maneuvers.\nWe then go on to demonstrate in simulation how this planner improves robot time\nto goal without violating social norms. Finally, we show initial hardware\ndemonstrations of this planner in the real world.\n","authors":["Lakshay Sharma","Jonathan P. How"],"pdf_url":"https://arxiv.org/pdf/2403.13284v1.pdf","comment":"Submitted to IROS 2024"},{"id":"http://arxiv.org/abs/2403.13281v1","updated":"2024-03-20T03:42:03Z","published":"2024-03-20T03:42:03Z","title":"Waypoint-Based Reinforcement Learning for Robot Manipulation Tasks","summary":"  Robot arms should be able to learn new tasks. One framework here is\nreinforcement learning, where the robot is given a reward function that encodes\nthe task, and the robot autonomously learns actions to maximize its reward.\nExisting approaches to reinforcement learning often frame this problem as a\nMarkov decision process, and learn a policy (or a hierarchy of policies) to\ncomplete the task. These policies reason over hundreds of fine-grained actions\nthat the robot arm needs to take: e.g., moving slightly to the right or\nrotating the end-effector a few degrees. But the manipulation tasks that we\nwant robots to perform can often be broken down into a small number of\nhigh-level motions: e.g., reaching an object or turning a handle. In this paper\nwe therefore propose a waypoint-based approach for model-free reinforcement\nlearning. Instead of learning a low-level policy, the robot now learns a\ntrajectory of waypoints, and then interpolates between those waypoints using\nexisting controllers. Our key novelty is framing this waypoint-based setting as\na sequence of multi-armed bandits: each bandit problem corresponds to one\nwaypoint along the robot's motion. We theoretically show that an ideal solution\nto this reformulation has lower regret bounds than standard frameworks. We also\nintroduce an approximate posterior sampling solution that builds the robot's\nmotion one waypoint at a time. Results across benchmark simulations and two\nreal-world experiments suggest that this proposed approach learns new tasks\nmore quickly than state-of-the-art baselines. See videos here:\nhttps://youtu.be/MMEd-lYfq4Y\n","authors":["Shaunak A. Mehta","Soheil Habibian","Dylan P. Losey"],"pdf_url":"https://arxiv.org/pdf/2403.13281v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13274v1","updated":"2024-03-20T03:17:07Z","published":"2024-03-20T03:17:07Z","title":"UNO Push: Unified Nonprehensile Object Pushing via Non-Parametric\n  Estimation and Model Predictive Control","summary":"  Nonprehensile manipulation through precise pushing is an essential skill that\nhas been commonly challenged by perception and physical uncertainties, such as\nthose associated with contacts, object geometries, and physical properties. For\nthis, we propose a unified framework that jointly addresses system modeling,\naction generation, and control. While most existing approaches either heavily\nrely on a priori system information for analytic modeling, or leverage a large\ndataset to learn dynamic models, our framework approximates a system transition\nfunction via non-parametric learning only using a small number of exploratory\nactions (ca. 10). The approximated function is then integrated with model\npredictive control to provide precise pushing manipulation. Furthermore, we\nshow that the approximated system transition functions can be robustly\ntransferred across novel objects while being online updated to continuously\nimprove the manipulation accuracy. Through extensive experiments on a real\nrobot platform with a set of novel objects and comparing against a\nstate-of-the-art baseline, we show that the proposed unified framework is a\nlight-weight and highly effective approach to enable precise pushing\nmanipulation all by itself. Our evaluation results illustrate that the system\ncan robustly ensure millimeter-level precision and can straightforwardly work\non any novel object.\n","authors":["Gaotian Wang","Kejia Ren","Kaiyu Hang"],"pdf_url":"https://arxiv.org/pdf/2403.13274v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13266v1","updated":"2024-03-20T03:03:22Z","published":"2024-03-20T03:03:22Z","title":"Enhancing Security in Multi-Robot Systems through Co-Observation\n  Planning, Reachability Analysis, and Network Flow","summary":"  This paper addresses security challenges in multi-robot systems (MRS) where\nadversaries may compromise robot control, risking unauthorized access to\nforbidden areas. We propose a novel multi-robot optimal planning algorithm that\nintegrates mutual observations and introduces reachability constraints for\nenhanced security. This ensures that, even with adversarial movements,\ncompromised robots cannot breach forbidden regions without missing scheduled\nco-observations. The reachability constraint uses ellipsoidal\nover-approximation for efficient intersection checking and gradient\ncomputation. To enhance system resilience and tackle feasibility challenges, we\nalso introduce sub-teams. These cohesive units replace individual robot\nassignments along each route, enabling redundant robots to deviate for\nco-observations across different trajectories, securing multiple sub-teams\nwithout requiring modifications. We formulate the cross-trajectory\nco-observation plan by solving a network flow coverage problem on the\ncheckpoint graph generated from the original unsecured MRS trajectories,\nproviding the same security guarantees against plan-deviation attacks. We\ndemonstrate the effectiveness and robustness of our proposed algorithm, which\nsignificantly strengthens the security of multi-robot systems in the face of\nadversarial threats.\n","authors":["Ziqi Yang","Roberto Tron"],"pdf_url":"https://arxiv.org/pdf/2403.13266v1.pdf","comment":"12 pages, 6 figures, submitted to IEEE Transactions on Control of\n  Network Systems"},{"id":"http://arxiv.org/abs/2403.13251v1","updated":"2024-03-20T02:31:23Z","published":"2024-03-20T02:31:23Z","title":"A Rule-Compliance Path Planner for Lane-Merge Scenarios Based on\n  Responsibility-Sensitive Safety","summary":"  Lane merging is one of the critical tasks for self-driving cars, and how to\nperform lane-merge maneuvers effectively and safely has become one of the\nimportant standards in measuring the capability of autonomous driving systems.\nHowever, due to the ambiguity in driving intentions and right-of-way issues,\nthe lane merging process in autonomous driving remains deficient in terms of\nmaintaining or ceding the right-of-way and attributing liability, which could\nresult in protracted durations for merging and problems such as trajectory\noscillation. Hence, we present a rule-compliance path planner (RCPP) for\nlane-merge scenarios, which initially employs the extended\nresponsibility-sensitive safety (RSS) to elucidate the right-of-way, followed\nby the potential field-based sigmoid planner for path generation. In the\nsimulation, we have validated the efficacy of the proposed algorithm. The\nalgorithm demonstrated superior performance over previous approaches in aspects\nsuch as merging time (Saved 72.3%), path length (reduced 53.4%), and\neliminating the trajectory oscillation.\n","authors":["Pengfei Lin","Ehsan Javanmardi","Yuze Jiang","Manabu Tsukada"],"pdf_url":"https://arxiv.org/pdf/2403.13251v1.pdf","comment":"Submitted to IEEE IROS 2024"},{"id":"http://arxiv.org/abs/2403.13245v1","updated":"2024-03-20T02:16:54Z","published":"2024-03-20T02:16:54Z","title":"Federated reinforcement learning for robot motion planning with\n  zero-shot generalization","summary":"  This paper considers the problem of learning a control policy for robot\nmotion planning with zero-shot generalization, i.e., no data collection and\npolicy adaptation is needed when the learned policy is deployed in new\nenvironments. We develop a federated reinforcement learning framework that\nenables collaborative learning of multiple learners and a central server, i.e.,\nthe Cloud, without sharing their raw data. In each iteration, each learner\nuploads its local control policy and the corresponding estimated normalized\narrival time to the Cloud, which then computes the global optimum among the\nlearners and broadcasts the optimal policy to the learners. Each learner then\nselects between its local control policy and that from the Cloud for next\niteration. The proposed framework leverages on the derived zero-shot\ngeneralization guarantees on arrival time and safety. Theoretical guarantees on\nalmost-sure convergence, almost consensus, Pareto improvement and optimality\ngap are also provided. Monte Carlo simulation is conducted to evaluate the\nproposed framework.\n","authors":["Zhenyuan Yuan","Siyuan Xu","Minghui Zhu"],"pdf_url":"https://arxiv.org/pdf/2403.13245v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13235v1","updated":"2024-03-20T01:57:24Z","published":"2024-03-20T01:57:24Z","title":"AMCO: Adaptive Multimodal Coupling of Vision and Proprioception for\n  Quadruped Robot Navigation in Outdoor Environments","summary":"  We present AMCO, a novel navigation method for quadruped robots that\nadaptively combines vision-based and proprioception-based perception\ncapabilities. Our approach uses three cost maps: general knowledge map;\ntraversability history map; and current proprioception map; which are derived\nfrom a robot's vision and proprioception data, and couples them to obtain a\ncoupled traversability cost map for navigation. The general knowledge map\nencodes terrains semantically segmented from visual sensing, and represents a\nterrain's typically expected traversability. The traversability history map\nencodes the robot's recent proprioceptive measurements on a terrain and its\nsemantic segmentation as a cost map. Further, the robot's present\nproprioceptive measurement is encoded as a cost map in the current\nproprioception map. As the general knowledge map and traversability history map\nrely on semantic segmentation, we evaluate the reliability of the visual\nsensory data by estimating the brightness and motion blur of input RGB images\nand accordingly combine the three cost maps to obtain the coupled\ntraversability cost map used for navigation. Leveraging this adaptive coupling,\nthe robot can depend on the most reliable input modality available. Finally, we\npresent a novel planner that selects appropriate gaits and velocities for\ntraversing challenging outdoor environments using the coupled traversability\ncost map. We demonstrate AMCO's navigation performance in different real-world\noutdoor environments and observe 10.8%-34.9% reduction w.r.t. two stability\nmetrics, and up to 50% improvement in terms of success rate compared to current\nnavigation methods.\n","authors":["Mohamed Elnoor","Kasun Weerakoon","Adarsh Jagan Sathyamoorthy","Tianrui Guan","Vignesh Rajagopal","Dinesh Manocha"],"pdf_url":"https://arxiv.org/pdf/2403.13235v1.pdf","comment":"8 pages"},{"id":"http://arxiv.org/abs/2403.12245v2","updated":"2024-03-20T01:48:46Z","published":"2024-03-18T20:51:08Z","title":"Improving Out-of-Distribution Generalization of Learned Dynamics by\n  Learning Pseudometrics and Constraint Manifolds","summary":"  We propose a method for improving the prediction accuracy of learned robot\ndynamics models on out-of-distribution (OOD) states. We achieve this by\nleveraging two key sources of structure often present in robot dynamics: 1)\nsparsity, i.e., some components of the state may not affect the dynamics, and\n2) physical limits on the set of possible motions, in the form of nonholonomic\nconstraints. Crucially, we do not assume this structure is known a priori, and\ninstead learn it from data. We use contrastive learning to obtain a distance\npseudometric that uncovers the sparsity pattern in the dynamics, and use it to\nreduce the input space when learning the dynamics. We then learn the unknown\nconstraint manifold by approximating the normal space of possible motions from\nthe data, which we use to train a Gaussian process (GP) representation of the\nconstraint manifold. We evaluate our approach on a physical differential-drive\nrobot and a simulated quadrotor, showing improved prediction accuracy on OOD\ndata relative to baselines.\n","authors":["Yating Lin","Glen Chou","Dmitry Berenson"],"pdf_url":"https://arxiv.org/pdf/2403.12245v2.pdf","comment":"Accept to ICRA 2024, 6 pages + references"},{"id":"http://arxiv.org/abs/2403.13221v1","updated":"2024-03-20T00:56:27Z","published":"2024-03-20T00:56:27Z","title":"A Contact Model based on Denoising Diffusion to Learn Variable Impedance\n  Control for Contact-rich Manipulation","summary":"  In this paper, a novel approach is proposed for learning robot control in\ncontact-rich tasks such as wiping, by developing Diffusion Contact Model (DCM).\nPrevious methods of learning such tasks relied on impedance control with\ntime-varying stiffness tuning by performing Bayesian optimization by\ntrial-and-error with robots. The proposed approach aims to reduce the cost of\nrobot operation by predicting the robot contact trajectories from the variable\nstiffness inputs and using neural models. However, contact dynamics are\ninherently highly nonlinear, and their simulation requires iterative\ncomputations such as convex optimization. Moreover, approximating such\ncomputations by using finite-layer neural models is difficult. To overcome\nthese limitations, the proposed DCM used the denoising diffusion models that\ncould simulate the complex dynamics via iterative computations of multi-step\ndenoising, thus improving the prediction accuracy. Stiffness tuning experiments\nconducted in simulated and real environments showed that the DCM achieved\ncomparable performance to a conventional robot-based optimization method while\nreducing the number of robot trials.\n","authors":["Masashi Okada","Mayumi Komatsu","Tadahiro Taniguchi"],"pdf_url":"https://arxiv.org/pdf/2403.13221v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2312.14115v2","updated":"2024-03-20T00:23:39Z","published":"2023-12-21T18:40:34Z","title":"LingoQA: Video Question Answering for Autonomous Driving","summary":"  Autonomous driving has long faced a challenge with public acceptance due to\nthe lack of explainability in the decision-making process. Video\nquestion-answering (QA) in natural language provides the opportunity for\nbridging this gap. Nonetheless, evaluating the performance of Video QA models\nhas proved particularly tough due to the absence of comprehensive benchmarks.\nTo fill this gap, we introduce LingoQA, a benchmark specifically for autonomous\ndriving Video QA. The LingoQA trainable metric demonstrates a 0.95 Spearman\ncorrelation coefficient with human evaluations. We introduce a Video QA dataset\nof central London consisting of 419k samples that we release with the paper. We\nestablish a baseline vision-language model and run extensive ablation studies\nto understand its performance.\n","authors":["Ana-Maria Marcu","Long Chen","Jan Hünermann","Alice Karnsund","Benoit Hanotte","Prajwal Chidananda","Saurabh Nair","Vijay Badrinarayanan","Alex Kendall","Jamie Shotton","Elahe Arani","Oleg Sinavski"],"pdf_url":"https://arxiv.org/pdf/2312.14115v2.pdf","comment":"Benchmark and dataset are available at\n  https://github.com/wayveai/LingoQA/"}]},"2024-03-19T00:00:00Z":{"Robotics":[{"id":"http://arxiv.org/abs/2403.13208v1","updated":"2024-03-19T23:57:55Z","published":"2024-03-19T23:57:55Z","title":"CaDRE: Controllable and Diverse Generation of Safety-Critical Driving\n  Scenarios using Real-World Trajectories","summary":"  Simulation is an indispensable tool in the development and testing of\nautonomous vehicles (AVs), offering an efficient and safe alternative to road\ntesting by allowing the exploration of a wide range of scenarios. Despite its\nadvantages, a significant challenge within simulation-based testing is the\ngeneration of safety-critical scenarios, which are essential to ensure that AVs\ncan handle rare but potentially fatal situations. This paper addresses this\nchallenge by introducing a novel generative framework, CaDRE, which is\nspecifically designed for generating diverse and controllable safety-critical\nscenarios using real-world trajectories. Our approach optimizes for both the\nquality and diversity of scenarios by employing a unique formulation and\nalgorithm that integrates real-world data, domain knowledge, and black-box\noptimization techniques. We validate the effectiveness of our framework through\nextensive testing in three representative types of traffic scenarios. The\nresults demonstrate superior performance in generating diverse and high-quality\nscenarios with greater sample efficiency than existing reinforcement learning\nand sampling-based methods.\n","authors":["Peide Huang","Wenhao Ding","Jonathan Francis","Bingqing Chen","Ding Zhao"],"pdf_url":"https://arxiv.org/pdf/2403.13208v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13198v1","updated":"2024-03-19T23:18:40Z","published":"2024-03-19T23:18:40Z","title":"Towards Robots That Know When They Need Help: Affordance-Based\n  Uncertainty for Large Language Model Planners","summary":"  Large language models (LLMs) showcase many desirable traits for intelligent\nand helpful robots. However, they are also known to hallucinate predictions.\nThis issue is exacerbated in consumer robotics where LLM hallucinations may\nresult in robots confidently executing plans that are contrary to user goals,\nrelying more frequently on human assistance, or preventing the robot from\nasking for help at all. In this work, we present LAP, a novel approach for\nutilizing off-the-shelf LLM's, alongside scene and object Affordances, in\nrobotic Planners that minimize harmful hallucinations and know when to ask for\nhelp. Our key finding is that calculating and leveraging a scene affordance\nscore, a measure of whether a given action is possible in the provided scene,\nhelps to mitigate hallucinations in LLM predictions and better align the LLM's\nconfidence measure with the probability of success. We specifically propose and\ntest three different affordance scores, which can be used independently or in\ntandem to improve performance across different use cases. The most successful\nof these individual scores involves prompting an LLM to determine if a given\naction is possible and safe in the given scene and uses the LLM's response to\ncompute the score. Through experiments in both simulation and the real world,\non tasks with a variety of ambiguities, we show that LAP significantly\nincreases success rate and decreases the amount of human intervention required\nrelative to prior art. For example, in our real-world testing paradigm, LAP\ndecreases the human help rate of previous methods by over 33% at a success rate\nof 70%.\n","authors":["James F. Mullen Jr.","Dinesh Manocha"],"pdf_url":"https://arxiv.org/pdf/2403.13198v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13188v1","updated":"2024-03-19T22:57:03Z","published":"2024-03-19T22:57:03Z","title":"Reflectivity Is All You Need!: Advancing LiDAR Semantic Segmentation","summary":"  LiDAR semantic segmentation frameworks predominantly leverage geometry-based\nfeatures to differentiate objects within a scan. While these methods excel in\nscenarios with clear boundaries and distinct shapes, their performance declines\nin environments where boundaries are blurred, particularly in off-road\ncontexts. To address this, recent strides in 3D segmentation algorithms have\nfocused on harnessing raw LiDAR intensity measurements to improve prediction\naccuracy. Despite these efforts, current learning-based models struggle to\ncorrelate the intricate connections between raw intensity and factors such as\ndistance, incidence angle, material reflectivity, and atmospheric conditions.\nBuilding upon our prior work, this paper delves into the advantages of\nemploying calibrated intensity (also referred to as reflectivity) within\nlearning-based LiDAR semantic segmentation frameworks. We initially establish\nthat incorporating reflectivity as an input enhances the existing LiDAR\nsemantic segmentation model. Furthermore, we present findings that enable the\nmodel to learn to calibrate intensity can boost its performance. Through\nextensive experimentation on the off-road dataset Rellis-3D, we demonstrate\nnotable improvements. Specifically, converting intensity to reflectivity\nresults in a 4% increase in mean Intersection over Union (mIoU) when compared\nto using raw intensity in Off-road scenarios. Additionally, we also investigate\nthe possible benefits of using calibrated intensity in semantic segmentation in\nurban environments (SemanticKITTI) and cross-sensor domain adaptation.\n","authors":["Kasi Viswanath","Peng Jiang","Srikanth Saripalli"],"pdf_url":"https://arxiv.org/pdf/2403.13188v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13177v1","updated":"2024-03-19T22:06:37Z","published":"2024-03-19T22:06:37Z","title":"User-customizable Shared Control for Fine Teleoperation via Virtual\n  Reality","summary":"  Shared control can ease and enhance a human operator's ability to teleoperate\nrobots, particularly for intricate tasks demanding fine control over multiple\ndegrees of freedom. However, the arbitration process dictating how much\nautonomous assistance to administer in shared control can confuse novice\noperators and impede their understanding of the robot's behavior. To overcome\nthese adverse side-effects, we propose a novel formulation of shared control\nthat enables operators to tailor the arbitration to their unique capabilities\nand preferences. Unlike prior approaches to customizable shared control where\nusers could indirectly modify the latent parameters of the arbitration function\nby issuing a feedback command, we instead make these parameters observable and\ndirectly editable via a virtual reality (VR) interface. We present our\nuser-customizable shared control method for a teleoperation task in SE(3),\nknown as the buzz wire game. A user study is conducted with participants\nteleoperating a robotic arm in VR to complete the game. The experiment spanned\ntwo weeks per subject to investigate longitudinal trends. Our findings reveal\nthat users allowed to interactively tune the arbitration parameters across\ntrials generalize well to adaptations in the task, exhibiting improvements in\nprecision and fluency over direct teleoperation and conventional shared\ncontrol.\n","authors":["Rui Luo","Mark Zolotas","Drake Moore","Taskin Padir"],"pdf_url":"https://arxiv.org/pdf/2403.13177v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13170v1","updated":"2024-03-19T21:49:26Z","published":"2024-03-19T21:49:26Z","title":"On Designing Consistent Covariance Recovery from a Deep Learning Visual\n  Odometry Engine","summary":"  Deep learning techniques have significantly advanced in providing accurate\nvisual odometry solutions by leveraging large datasets. However, generating\nuncertainty estimates for these methods remains a challenge. Traditional sensor\nfusion approaches in a Bayesian framework are well-established, but deep\nlearning techniques with millions of parameters lack efficient methods for\nuncertainty estimation.\n  This paper addresses the issue of uncertainty estimation for pre-trained\ndeep-learning models in monocular visual odometry. We propose formulating a\nfactor graph on an implicit layer of the deep learning network to recover\nrelative covariance estimates, which allows us to determine the covariance of\nthe Visual Odometry (VO) solution. We showcase the consistency of the deep\nlearning engine's covariance approximation with an empirical analysis of the\ncovariance model on the EUROC datasets to demonstrate the correctness of our\nformulation.\n","authors":["Jagatpreet Singh Nir","Dennis Giaya","Hanumant Singh"],"pdf_url":"https://arxiv.org/pdf/2403.13170v1.pdf","comment":"Submitted to IROS 2024"},{"id":"http://arxiv.org/abs/2403.13147v1","updated":"2024-03-19T20:50:20Z","published":"2024-03-19T20:50:20Z","title":"Meta-Learning for Fast Adaptation in Intent Inferral on a Robotic Hand\n  Orthosis for Stroke","summary":"  We propose MetaEMG, a meta-learning approach for fast adaptation in intent\ninferral on a robotic hand orthosis for stroke. One key challenge in machine\nlearning for assistive and rehabilitative robotics with disabled-bodied\nsubjects is the difficulty of collecting labeled training data. Muscle tone and\nspasticity often vary significantly among stroke subjects, and hand function\ncan even change across different use sessions of the device for the same\nsubject. We investigate the use of meta-learning to mitigate the burden of data\ncollection needed to adapt high-capacity neural networks to a new session or\nsubject. Our experiments on real clinical data collected from five stroke\nsubjects show that MetaEMG can improve the intent inferral accuracy with a\nsmall session- or subject-specific dataset and very few fine-tuning epochs. To\nthe best of our knowledge, we are the first to formulate intent inferral on\nstroke subjects as a meta-learning problem and demonstrate fast adaptation to a\nnew session or subject for controlling a robotic hand orthosis with EMG\nsignals.\n","authors":["Pedro Leandro La Rotta","Jingxi Xu","Ava Chen","Lauren Winterbottom","Wenxi Chen","Dawn Nilsen","Joel Stein","Matei Ciocarlie"],"pdf_url":"https://arxiv.org/pdf/2403.13147v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13144v1","updated":"2024-03-19T20:41:06Z","published":"2024-03-19T20:41:06Z","title":"Interactive Robot-Environment Self-Calibration via Compliant Exploratory\n  Actions","summary":"  Calibrating robots into their workspaces is crucial for manipulation tasks.\nExisting calibration techniques often rely on sensors external to the robot\n(cameras, laser scanners, etc.) or specialized tools. This reliance complicates\nthe calibration process and increases the costs and time requirements.\nFurthermore, the associated setup and measurement procedures require\nsignificant human intervention, which makes them more challenging to operate.\nUsing the built-in force-torque sensors, which are nowadays a default component\nin collaborative robots, this work proposes a self-calibration framework where\nrobot-environmental spatial relations are automatically estimated through\ncompliant exploratory actions by the robot itself. The self-calibration\napproach converges, verifies its own accuracy, and terminates upon completion,\nautonomously purely through interactive exploration of the environment's\ngeometries. Extensive experiments validate the effectiveness of our\nself-calibration approach in accurately establishing the robot-environment\nspatial relationships without the need for additional sensing equipment or any\nhuman intervention.\n","authors":["Podshara Chanrungmaneekul","Kejia Ren","Joshua T. Grace","Aaron M. Dollar","Kaiyu Hang"],"pdf_url":"https://arxiv.org/pdf/2403.13144v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13132v1","updated":"2024-03-19T20:04:35Z","published":"2024-03-19T20:04:35Z","title":"Wearable Roller Rings to Enable Robot Dexterous In-Hand Manipulation\n  through Active Surfaces","summary":"  In-hand manipulation is a crucial ability for reorienting and repositioning\nobjects within grasps. The main challenges are not only the complexity in the\ncomputational models, but also the risks of grasp instability caused by active\nfinger motions, such as rolling, sliding, breaking, and remaking contacts.\nBased on the idea of manipulation without lifting a finger, this paper presents\nthe development of Roller Rings (RR), a modular robotic attachment with active\nsurfaces that is wearable by both robot and human hands. By installing and\nangling the RRs on grasping systems, such that their spatial motions are not\nco-linear, we derive a general differential motion model for the object\nactuated by the active surfaces. Our motion model shows that complete in-hand\nmanipulation skill sets can be provided by as few as only 2 RRs through\nnon-holonomic object motions, while more RRs can enable enhanced manipulation\ndexterity with fewer motion constraints. Through extensive experiments, we wear\nRRs on both a robot hand and a human hand to evaluate their manipulation\ncapabilities, and show that the RRs can be employed to manipulate arbitrary\nobject shapes to provide dexterous in-hand manipulation.\n","authors":["Hayden Webb","Podshara Chanrungmaneekul","Shenli Yuan","Kaiyu Hang"],"pdf_url":"https://arxiv.org/pdf/2403.13132v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13129v1","updated":"2024-03-19T19:58:54Z","published":"2024-03-19T19:58:54Z","title":"Better Call SAL: Towards Learning to Segment Anything in Lidar","summary":"  We propose $\\texttt{SAL}$ ($\\texttt{S}$egment $\\texttt{A}$nything in\n$\\texttt{L}$idar) method consisting of a text-promptable zero-shot model for\nsegmenting and classifying any object in Lidar, and a pseudo-labeling engine\nthat facilitates model training without manual supervision. While the\nestablished paradigm for $\\textit{Lidar Panoptic Segmentation}$ (LPS) relies on\nmanual supervision for a handful of object classes defined a priori, we utilize\n2D vision foundation models to generate 3D supervision \"for free\". Our\npseudo-labels consist of instance masks and corresponding CLIP tokens, which we\nlift to Lidar using calibrated multi-modal data. By training our model on these\nlabels, we distill the 2D foundation models into our Lidar $\\texttt{SAL}$\nmodel. Even without manual labels, our model achieves $91\\%$ in terms of\nclass-agnostic segmentation and $44\\%$ in terms of zero-shot LPS of the fully\nsupervised state-of-the-art. Furthermore, we outperform several baselines that\ndo not distill but only lift image features to 3D. More importantly, we\ndemonstrate that $\\texttt{SAL}$ supports arbitrary class prompts, can be easily\nextended to new datasets, and shows significant potential to improve with\nincreasing amounts of self-labeled data.\n","authors":["Aljoša Ošep","Tim Meinhardt","Francesco Ferroni","Neehar Peri","Deva Ramanan","Laura Leal-Taixé"],"pdf_url":"https://arxiv.org/pdf/2403.13129v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13124v1","updated":"2024-03-19T19:54:32Z","published":"2024-03-19T19:54:32Z","title":"Cooperative Modular Manipulation with Numerous Cable-Driven Robots for\n  Assistive Construction and Gap Crossing","summary":"  Soldiers in the field often need to cross negative obstacles, such as rivers\nor canyons, to reach goals or safety. Military gap crossing involves on-site\ntemporary bridges construction. However, this procedure is conducted with\ndangerous, time and labor intensive operations, and specialized machinery. We\nenvision a scalable robotic solution inspired by advancements in\nforce-controlled and Cable Driven Parallel Robots (CDPRs); this solution can\naddress the challenges inherent in this transportation problem, achieving fast,\nefficient, and safe deployment and field operations. We introduce the embodied\nvision in Co3MaNDR, a solution to the military gap crossing problem, a\ndistributed robot consisting of several modules simultaneously pulling on a\ncentral payload, controlling the cables' tensions to achieve complex\nobjectives, such as precise trajectory tracking or force amplification.\nHardware experiments demonstrate teleoperation of a payload, trajectory\nfollowing, and the sensing and amplification of operators' applied physical\nforces during slow operations. An operator was shown to manipulate a 27.2 kg\n(60 lb) payload with an average force utilization of 14.5\\% of its weight.\nResults indicate that the system can be scaled up to heavier payloads without\ncompromising performance or introducing superfluous complexity. This research\nlays a foundation to expand CDPR technology to uncoordinated and unstable\nmobile platforms in unknown environments.\n","authors":["Kevin Murphy","Joao C. V. Soares","Justin K. Yim","Dustin Nottage","Ahmet Soylemezoglu","Joao Ramos"],"pdf_url":"https://arxiv.org/pdf/2403.13124v1.pdf","comment":"8 pages, 9 figures. Submit to IROS 2024"},{"id":"http://arxiv.org/abs/2305.03001v2","updated":"2024-03-19T19:40:44Z","published":"2023-05-04T17:19:47Z","title":"OSDaR23: Open Sensor Data for Rail 2023","summary":"  To achieve a driverless train operation on mainline railways, actual and\npotential obstacles for the train's driveway must be detected automatically by\nappropriate sensor systems. Machine learning algorithms have proven to be\npowerful tools for this task during the last years. However, these algorithms\nrequire large amounts of high-quality annotated data containing\nrailway-specific objects as training data. Unfortunately, all of the publicly\navailable datasets that tackle this requirement are restricted in some way.\nTherefore, this paper presents OSDaR23, a multi-sensor dataset of 45\nsubsequences acquired in Hamburg, Germany, in September 2021, that was created\nto foster driverless train operation on mainline railways. The sensor setup\nconsists of multiple calibrated and synchronized infrared (IR) and visual (RGB)\ncameras, lidars, a radar, and position and acceleration sensors mounted on the\nfront of a rail vehicle. In addition to the raw data, the dataset contains\n204091 polyline, polygonal, rectangle, and cuboid annotations in total for 20\ndifferent object classes. It is the first publicly available multi-sensor\ndataset annotated with a variety of object classes that are relevant for the\nrailway context. OSDaR23, available at data.fid-move.de/dataset/osdar23, can\nalso be used for tasks beyond collision prediction, which are listed in this\npaper.\n","authors":["Rustam Tagiew","Martin Köppel","Karsten Schwalbe","Patrick Denzler","Philipp Neumaier","Tobias Klockau","Martin Boekhoff","Pavel Klasek","Roman Tilly"],"pdf_url":"https://arxiv.org/pdf/2305.03001v2.pdf","comment":"7 pages, 11 images, 5 tables"},{"id":"http://arxiv.org/abs/2311.00112v2","updated":"2024-03-19T19:37:22Z","published":"2023-10-31T19:39:44Z","title":"Hierarchical Optimization-based Control for Whole-body Loco-manipulation\n  of Heavy Objects","summary":"  In recent years, the field of legged robotics has seen growing interest in\nenhancing the capabilities of these robots through the integration of\narticulated robotic arms. However, achieving successful loco-manipulation,\nespecially involving interaction with heavy objects, is far from\nstraightforward, as object manipulation can introduce substantial disturbances\nthat impact the robot's locomotion. This paper presents a novel framework for\nlegged loco-manipulation that considers whole-body coordination through a\nhierarchical optimization-based control framework. First, an online\nmanipulation planner computes the manipulation forces and manipulated object\ntask-based reference trajectory. Then, pose optimization aligns the robot's\ntrajectory with kinematic constraints. The resultant robot reference trajectory\nis executed via a linear MPC controller incorporating the desired manipulation\nforces into its prediction model. Our approach has been validated in simulation\nand hardware experiments, highlighting the necessity of whole-body optimization\ncompared to the baseline locomotion MPC when interacting with heavy objects.\nExperimental results with Unitree Aliengo, equipped with a custom-made robotic\narm, showcase its ability to lift and carry an 8kg payload and manipulate\ndoors.\n","authors":["Alberto Rigo","Muqun Hu","Satyandra K. Gupta","Quan Nguyen"],"pdf_url":"https://arxiv.org/pdf/2311.00112v2.pdf","comment":"7 pages, 7 figures"},{"id":"http://arxiv.org/abs/2310.09442v2","updated":"2024-03-19T19:11:32Z","published":"2023-10-13T23:23:39Z","title":"Learning Agile Locomotion and Adaptive Behaviors via RL-augmented MPC","summary":"  In the context of legged robots, adaptive behavior involves adaptive\nbalancing and adaptive swing foot reflection. While adaptive balancing\ncounteracts perturbations to the robot, adaptive swing foot reflection helps\nthe robot to navigate intricate terrains without foot entrapment. In this\npaper, we manage to bring both aspects of adaptive behavior to quadruped\nlocomotion by combining RL and MPC while improving the robustness and agility\nof blind legged locomotion. This integration leverages MPC's strength in\npredictive capabilities and RL's adeptness in drawing from past experiences.\nUnlike traditional locomotion controls that separate stance foot control and\nswing foot trajectory, our innovative approach unifies them, addressing their\nlack of synchronization. At the heart of our contribution is the synthesis of\nstance foot control with swing foot reflection, improving agility and\nrobustness in locomotion with adaptive behavior. A hallmark of our approach is\nrobust blind stair climbing through swing foot reflection. Moreover, we\nintentionally designed the learning module as a general plugin for different\nrobot platforms. We trained the policy and implemented our approach on the\nUnitree A1 robot, achieving impressive results: a peak turn rate of 8.5 rad/s,\na peak running speed of 3 m/s, and steering at a speed of 2.5 m/s. Remarkably,\nthis framework also allows the robot to maintain stable locomotion while\nbearing an unexpected load of 10 kg, or 83\\% of its body mass. We further\ndemonstrate the generalizability and robustness of the same policy where it\nrealizes zero-shot transfer to different robot platforms like Go1 and AlienGo\nrobots for load carrying. Code is made available for the use of the research\ncommunity at https://github.com/DRCL-USC/RL_augmented_MPC.git\n","authors":["Yiyu Chen","Quan Nguyen"],"pdf_url":"https://arxiv.org/pdf/2310.09442v2.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13093v1","updated":"2024-03-19T18:42:22Z","published":"2024-03-19T18:42:22Z","title":"Graph Neural Network-based Multi-agent Reinforcement Learning for\n  Resilient Distributed Coordination of Multi-Robot Systems","summary":"  Existing multi-agent coordination techniques are often fragile and vulnerable\nto anomalies such as agent attrition and communication disturbances, which are\nquite common in the real-world deployment of systems like field robotics. To\nbetter prepare these systems for the real world, we present a graph neural\nnetwork (GNN)-based multi-agent reinforcement learning (MARL) method for\nresilient distributed coordination of a multi-robot system. Our method,\nMulti-Agent Graph Embedding-based Coordination (MAGEC), is trained using\nmulti-agent proximal policy optimization (PPO) and enables distributed\ncoordination around global objectives under agent attrition, partial\nobservability, and limited or disturbed communications. We use a multi-robot\npatrolling scenario to demonstrate our MAGEC method in a ROS 2-based simulator\nand then compare its performance with prior coordination approaches. Results\ndemonstrate that MAGEC outperforms existing methods in several experiments\ninvolving agent attrition and communication disturbance, and provides\ncompetitive results in scenarios without such anomalies.\n","authors":["Anthony Goeckner","Yueyuan Sui","Nicolas Martinet","Xinliang Li","Qi Zhu"],"pdf_url":"https://arxiv.org/pdf/2403.13093v1.pdf","comment":"This work has been submitted to the IEEE for possible publication.\n  Copyright may be transferred without notice, after which this version may no\n  longer be accessible"},{"id":"http://arxiv.org/abs/2403.13090v1","updated":"2024-03-19T18:38:50Z","published":"2024-03-19T18:38:50Z","title":"Digital Twin-Driven Reinforcement Learning for Obstacle Avoidance in\n  Robot Manipulators: A Self-Improving Online Training Framework","summary":"  The evolution and growing automation of collaborative robots introduce more\ncomplexity and unpredictability to systems, highlighting the crucial need for\nrobot's adaptability and flexibility to address the increasing complexities of\ntheir environment. In typical industrial production scenarios, robots are often\nrequired to be re-programmed when facing a more demanding task or even a few\nchanges in workspace conditions. To increase productivity, efficiency and\nreduce human effort in the design process, this paper explores the potential of\nusing digital twin combined with Reinforcement Learning (RL) to enable robots\nto generate self-improving collision-free trajectories in real time. The\ndigital twin, acting as a virtual counterpart of the physical system, serves as\na 'forward run' for monitoring, controlling, and optimizing the physical system\nin a safe and cost-effective manner. The physical system sends data to\nsynchronize the digital system through the video feeds from cameras, which\nallows the virtual robot to update its observation and policy based on real\nscenarios. The bidirectional communication between digital and physical systems\nprovides a promising platform for hardware-in-the-loop RL training through\ntrial and error until the robot successfully adapts to its new environment. The\nproposed online training framework is demonstrated on the Unfactory Xarm5\ncollaborative robot, where the robot end-effector aims to reach the target\nposition while avoiding obstacles. The experiment suggest that proposed\nframework is capable of performing policy online training, and that there\nremains significant room for improvement.\n","authors":["Yuzhu Sun","Mien Van","Stephen McIlvanna","Nguyen Minh Nhat","Kabirat Olayemi","Jack Close","Seán McLoone"],"pdf_url":"https://arxiv.org/pdf/2403.13090v1.pdf","comment":"7 pages"},{"id":"http://arxiv.org/abs/2403.13085v1","updated":"2024-03-19T18:32:10Z","published":"2024-03-19T18:32:10Z","title":"Subgoal Diffuser: Coarse-to-fine Subgoal Generation to Guide Model\n  Predictive Control for Robot Manipulation","summary":"  Manipulation of articulated and deformable objects can be difficult due to\ntheir compliant and under-actuated nature. Unexpected disturbances can cause\nthe object to deviate from a predicted state, making it necessary to use\nModel-Predictive Control (MPC) methods to plan motion. However, these methods\nneed a short planning horizon to be practical. Thus, MPC is ill-suited for\nlong-horizon manipulation tasks due to local minima. In this paper, we present\na diffusion-based method that guides an MPC method to accomplish long-horizon\nmanipulation tasks by dynamically specifying sequences of subgoals for the MPC\nto follow. Our method, called Subgoal Diffuser, generates subgoals in a\ncoarse-to-fine manner, producing sparse subgoals when the task is easily\naccomplished by MPC and more dense subgoals when the MPC method needs more\nguidance. The density of subgoals is determined dynamically based on a learned\nestimate of reachability, and subgoals are distributed to focus on challenging\nparts of the task. We evaluate our method on two robot manipulation tasks and\nfind it improves the planning performance of an MPC method, and also\noutperforms prior diffusion-based methods.\n","authors":["Zixuan Huang","Yating Lin","Fan Yang","Dmitry Berenson"],"pdf_url":"https://arxiv.org/pdf/2403.13085v1.pdf","comment":"ICRA 2024"},{"id":"http://arxiv.org/abs/2403.11788v2","updated":"2024-03-19T18:20:59Z","published":"2024-03-18T13:46:32Z","title":"Locomotion Generation for a Rat Robot based on Environmental Changes via\n  Reinforcement Learning","summary":"  This research focuses on developing reinforcement learning approaches for the\nlocomotion generation of small-size quadruped robots. The rat robot NeRmo is\nemployed as the experimental platform. Due to the constrained volume,\nsmall-size quadruped robots typically possess fewer and weaker sensors,\nresulting in difficulty in accurately perceiving and responding to\nenvironmental changes. In this context, insufficient and imprecise feedback\ndata from sensors makes it difficult to generate adaptive locomotion based on\nreinforcement learning. To overcome these challenges, this paper proposes a\nnovel reinforcement learning approach that focuses on extracting effective\nperceptual information to enhance the environmental adaptability of small-size\nquadruped robots. According to the frequency of a robot's gait stride, key\ninformation of sensor data is analyzed utilizing sinusoidal functions derived\nfrom Fourier transform results. Additionally, a multifunctional reward\nmechanism is proposed to generate adaptive locomotion in different tasks.\nExtensive simulations are conducted to assess the effectiveness of the proposed\nreinforcement learning approach in generating rat robot locomotion in various\nenvironments. The experiment results illustrate the capability of the proposed\napproach to maintain stable locomotion of a rat robot across different\nterrains, including ramps, stairs, and spiral stairs.\n","authors":["Xinhui Shan","Yuhong Huang","Zhenshan Bing","Zitao Zhang","Xiangtong Yao","Kai Huang","Alois Knoll"],"pdf_url":"https://arxiv.org/pdf/2403.11788v2.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.13079v1","updated":"2024-03-19T18:15:35Z","published":"2024-03-19T18:15:35Z","title":"Current-Based Impedance Control for Interacting with Mobile Manipulators","summary":"  As robots shift from industrial to human-centered spaces, adopting mobile\nmanipulators, which expand workspace capabilities, becomes crucial. In these\nsettings, seamless interaction with humans necessitates compliant control. Two\ncommon methods for safe interaction, admittance, and impedance control, require\nforce or torque sensors, often absent in lower-cost or lightweight robots. This\npaper presents an adaption of impedance control that can be used on\ncurrent-controlled robots without the use of force or torque sensors and its\napplication for compliant control of a mobile manipulator. A calibration method\nis designed that enables estimation of the actuators' current/torque ratios and\nfrictions, used by the adapted impedance controller, and that can handle model\nerrors. The calibration method and the performance of the designed controller\nare experimentally validated using the Kinova GEN3 Lite arm. Results show that\nthe calibration method is consistent and that the designed controller for the\narm is compliant while also being able to track targets with five-millimeter\nprecision when no interaction is present. Additionally, this paper presents two\noperational modes for interacting with the mobile manipulator: one for guiding\nthe robot around the workspace through interacting with the arm and another for\nexecuting a tracking task, both maintaining compliance to external forces.\nThese operational modes were tested in real-world experiments, affirming their\npractical applicability and effectiveness.\n","authors":["Jelmer de Wolde","Luzia Knoedler","Gianluca Garofalo","Javier Alonso-Mora"],"pdf_url":"https://arxiv.org/pdf/2403.13079v1.pdf","comment":"8 pages, 13 figures, under review for IROS 2024"},{"id":"http://arxiv.org/abs/2310.00481v2","updated":"2024-03-19T18:05:18Z","published":"2023-09-30T20:26:00Z","title":"LANCAR: Leveraging Language for Context-Aware Robot Locomotion in\n  Unstructured Environments","summary":"  Navigating robots through unstructured terrains is challenging, primarily due\nto the dynamic environmental changes. While humans adeptly navigate such\nterrains by using context from their observations, creating a similar\ncontext-aware navigation system for robots is difficult. The essence of the\nissue lies in the acquisition and interpretation of contextual information, a\ntask complicated by the inherent ambiguity of human language. In this work, we\nintroduce LANCAR, which addresses this issue by combining a context translator\nwith reinforcement learning (RL) agents for context-aware locomotion. LANCAR\nallows robots to comprehend contextual information through Large Language\nModels (LLMs) sourced from human observers and convert this information into\nactionable contextual embeddings. These embeddings, combined with the robot's\nsensor data, provide a complete input for the RL agent's policy network. We\nprovide an extensive evaluation of LANCAR under different levels of contextual\nambiguity and compare with alternative methods. The experimental results\nshowcase the superior generalizability and adaptability across different\nterrains. Notably, LANCAR shows at least a 7.4% increase in episodic reward\nover the best alternatives, highlighting its potential to enhance robotic\nnavigation in unstructured environments. More details and experiment videos\ncould be found in http://raaslab.org/projects/LLM_Context_Estimation/.\n","authors":["Chak Lam Shek","Xiyang Wu","Wesley A. Suttle","Carl Busart","Erin Zaroukian","Dinesh Manocha","Pratap Tokekar","Amrit Singh Bedi"],"pdf_url":"https://arxiv.org/pdf/2310.00481v2.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.12959v1","updated":"2024-03-19T17:58:02Z","published":"2024-03-19T17:58:02Z","title":"WHAC: World-grounded Humans and Cameras","summary":"  Estimating human and camera trajectories with accurate scale in the world\ncoordinate system from a monocular video is a highly desirable yet challenging\nand ill-posed problem. In this study, we aim to recover expressive parametric\nhuman models (i.e., SMPL-X) and corresponding camera poses jointly, by\nleveraging the synergy between three critical players: the world, the human,\nand the camera. Our approach is founded on two key observations. Firstly,\ncamera-frame SMPL-X estimation methods readily recover absolute human depth.\nSecondly, human motions inherently provide absolute spatial cues. By\nintegrating these insights, we introduce a novel framework, referred to as\nWHAC, to facilitate world-grounded expressive human pose and shape estimation\n(EHPS) alongside camera pose estimation, without relying on traditional\noptimization techniques. Additionally, we present a new synthetic dataset,\nWHAC-A-Mole, which includes accurately annotated humans and cameras, and\nfeatures diverse interactive human motions as well as realistic camera\ntrajectories. Extensive experiments on both standard and newly established\nbenchmarks highlight the superiority and efficacy of our framework. We will\nmake the code and dataset publicly available.\n","authors":["Wanqi Yin","Zhongang Cai","Ruisi Wang","Fanzhou Wang","Chen Wei","Haiyi Mei","Weiye Xiao","Zhitao Yang","Qingping Sun","Atsushi Yamashita","Ziwei Liu","Lei Yang"],"pdf_url":"https://arxiv.org/pdf/2403.12959v1.pdf","comment":"Homepage: https://wqyin.github.io/projects/WHAC/"},{"id":"http://arxiv.org/abs/2403.13042v1","updated":"2024-03-19T17:57:09Z","published":"2024-03-19T17:57:09Z","title":"TAPTR: Tracking Any Point with Transformers as Detection","summary":"  In this paper, we propose a simple and strong framework for Tracking Any\nPoint with TRansformers (TAPTR). Based on the observation that point tracking\nbears a great resemblance to object detection and tracking, we borrow designs\nfrom DETR-like algorithms to address the task of TAP. In the proposed\nframework, in each video frame, each tracking point is represented as a point\nquery, which consists of a positional part and a content part. As in DETR, each\nquery (its position and content feature) is naturally updated layer by layer.\nIts visibility is predicted by its updated content feature. Queries belonging\nto the same tracking point can exchange information through self-attention\nalong the temporal dimension. As all such operations are well-designed in\nDETR-like algorithms, the model is conceptually very simple. We also adopt some\nuseful designs such as cost volume from optical flow models and develop simple\ndesigns to provide long temporal information while mitigating the feature\ndrifting issue. Our framework demonstrates strong performance with\nstate-of-the-art performance on various TAP datasets with faster inference\nspeed.\n","authors":["Hongyang Li","Hao Zhang","Shilong Liu","Zhaoyang Zeng","Tianhe Ren","Feng Li","Lei Zhang"],"pdf_url":"https://arxiv.org/pdf/2403.13042v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.06420v2","updated":"2024-03-19T17:52:09Z","published":"2024-03-11T04:13:26Z","title":"RLingua: Improving Reinforcement Learning Sample Efficiency in Robotic\n  Manipulations With Large Language Models","summary":"  Reinforcement learning (RL) has demonstrated its capability in solving\nvarious tasks but is notorious for its low sample efficiency. In this paper, we\npropose RLingua, a framework that can leverage the internal knowledge of large\nlanguage models (LLMs) to reduce the sample complexity of RL in robotic\nmanipulations. To this end, we first present a method for extracting the prior\nknowledge of LLMs by prompt engineering so that a preliminary rule-based robot\ncontroller for a specific task can be generated in a user-friendly manner.\nDespite being imperfect, the LLM-generated robot controller is utilized to\nproduce action samples during rollouts with a decaying probability, thereby\nimproving RL's sample efficiency. We employ TD3, the widely-used RL baseline\nmethod, and modify the actor loss to regularize the policy learning towards the\nLLM-generated controller. RLingua also provides a novel method of improving the\nimperfect LLM-generated robot controllers by RL. We demonstrate that RLingua\ncan significantly reduce the sample complexity of TD3 in four robot tasks of\npanda_gym and achieve high success rates in 12 sampled sparsely rewarded robot\ntasks in RLBench, where the standard TD3 fails. Additionally, We validated\nRLingua's effectiveness in real-world robot experiments through Sim2Real,\ndemonstrating that the learned policies are effectively transferable to real\nrobot tasks. Further details about our work are available at our project\nwebsite https://rlingua.github.io.\n","authors":["Liangliang Chen","Yutian Lei","Shiyu Jin","Ying Zhang","Liangjun Zhang"],"pdf_url":"https://arxiv.org/pdf/2403.06420v2.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.12945v1","updated":"2024-03-19T17:48:38Z","published":"2024-03-19T17:48:38Z","title":"DROID: A Large-Scale In-The-Wild Robot Manipulation Dataset","summary":"  The creation of large, diverse, high-quality robot manipulation datasets is\nan important stepping stone on the path toward more capable and robust robotic\nmanipulation policies. However, creating such datasets is challenging:\ncollecting robot manipulation data in diverse environments poses logistical and\nsafety challenges and requires substantial investments in hardware and human\nlabour. As a result, even the most general robot manipulation policies today\nare mostly trained on data collected in a small number of environments with\nlimited scene and task diversity. In this work, we introduce DROID (Distributed\nRobot Interaction Dataset), a diverse robot manipulation dataset with 76k\ndemonstration trajectories or 350 hours of interaction data, collected across\n564 scenes and 84 tasks by 50 data collectors in North America, Asia, and\nEurope over the course of 12 months. We demonstrate that training with DROID\nleads to policies with higher performance and improved generalization ability.\nWe open source the full dataset, policy learning code, and a detailed guide for\nreproducing our robot hardware setup.\n","authors":["Alexander Khazatsky","Karl Pertsch","Suraj Nair","Ashwin Balakrishna","Sudeep Dasari","Siddharth Karamcheti","Soroush Nasiriany","Mohan Kumar Srirama","Lawrence Yunliang Chen","Kirsty Ellis","Peter David Fagan","Joey Hejna","Masha Itkina","Marion Lepert","Yecheng Jason Ma","Patrick Tree Miller","Jimmy Wu","Suneel Belkhale","Shivin Dass","Huy Ha","Arhan Jain","Abraham Lee","Youngwoon Lee","Marius Memmel","Sungjae Park","Ilija Radosavovic","Kaiyuan Wang","Albert Zhan","Kevin Black","Cheng Chi","Kyle Beltran Hatch","Shan Lin","Jingpei Lu","Jean Mercat","Abdul Rehman","Pannag R Sanketi","Archit Sharma","Cody Simpson","Quan Vuong","Homer Rich Walke","Blake Wulfe","Ted Xiao","Jonathan Heewon Yang","Arefeh Yavary","Tony Z. Zhao","Christopher Agia","Rohan Baijal","Mateo Guaman Castro","Daphne Chen","Qiuyu Chen","Trinity Chung","Jaimyn Drake","Ethan Paul Foster","Jensen Gao","David Antonio Herrera","Minho Heo","Kyle Hsu","Jiaheng Hu","Donovon Jackson","Charlotte Le","Yunshuang Li","Kevin Lin","Roy Lin","Zehan Ma","Abhiram Maddukuri","Suvir Mirchandani","Daniel Morton","Tony Nguyen","Abigail O'Neill","Rosario Scalise","Derick Seale","Victor Son","Stephen Tian","Emi Tran","Andrew E. Wang","Yilin Wu","Annie Xie","Jingyun Yang","Patrick Yin","Yunchu Zhang","Osbert Bastani","Glen Berseth","Jeannette Bohg","Ken Goldberg","Abhinav Gupta","Abhishek Gupta","Dinesh Jayaraman","Joseph J Lim","Jitendra Malik","Roberto Martín-Martín","Subramanian Ramamoorthy","Dorsa Sadigh","Shuran Song","Jiajun Wu","Michael C. Yip","Yuke Zhu","Thomas Kollar","Sergey Levine","Chelsea Finn"],"pdf_url":"https://arxiv.org/pdf/2403.12945v1.pdf","comment":"Project website: https://droid-dataset.github.io/"},{"id":"http://arxiv.org/abs/2403.12943v1","updated":"2024-03-19T17:47:37Z","published":"2024-03-19T17:47:37Z","title":"Vid2Robot: End-to-end Video-conditioned Policy Learning with\n  Cross-Attention Transformers","summary":"  While large-scale robotic systems typically rely on textual instructions for\ntasks, this work explores a different approach: can robots infer the task\ndirectly from observing humans? This shift necessitates the robot's ability to\ndecode human intent and translate it into executable actions within its\nphysical constraints and environment. We introduce Vid2Robot, a novel\nend-to-end video-based learning framework for robots. Given a video\ndemonstration of a manipulation task and current visual observations, Vid2Robot\ndirectly produces robot actions. This is achieved through a unified\nrepresentation model trained on a large dataset of human video and robot\ntrajectory. The model leverages cross-attention mechanisms to fuse prompt video\nfeatures to the robot's current state and generate appropriate actions that\nmimic the observed task. To further improve policy performance, we propose\nauxiliary contrastive losses that enhance the alignment between human and robot\nvideo representations. We evaluate Vid2Robot on real-world robots,\ndemonstrating a 20% improvement in performance compared to other\nvideo-conditioned policies when using human demonstration videos. Additionally,\nour model exhibits emergent capabilities, such as successfully transferring\nobserved motions from one object to another, and long-horizon composition, thus\nshowcasing its potential for real-world applications. Project website:\nvid2robot.github.io\n","authors":["Vidhi Jain","Maria Attarian","Nikhil J Joshi","Ayzaan Wahid","Danny Driess","Quan Vuong","Pannag R Sanketi","Pierre Sermanet","Stefan Welker","Christine Chan","Igor Gilitschenski","Yonatan Bisk","Debidatta Dwibedi"],"pdf_url":"https://arxiv.org/pdf/2403.12943v1.pdf","comment":"Robot learning: Imitation Learning, Robot Perception, Sensing &\n  Vision, Grasping & Manipulation"},{"id":"http://arxiv.org/abs/2403.12920v1","updated":"2024-03-19T17:23:44Z","published":"2024-03-19T17:23:44Z","title":"Semantic Layering in Room Segmentation via LLMs","summary":"  In this paper, we introduce Semantic Layering in Room Segmentation via LLMs\n(SeLRoS), an advanced method for semantic room segmentation by integrating\nLarge Language Models (LLMs) with traditional 2D map-based segmentation. Unlike\nprevious approaches that solely focus on the geometric segmentation of indoor\nenvironments, our work enriches segmented maps with semantic data, including\nobject identification and spatial relationships, to enhance robotic navigation.\nBy leveraging LLMs, we provide a novel framework that interprets and organizes\ncomplex information about each segmented area, thereby improving the accuracy\nand contextual relevance of room segmentation. Furthermore, SeLRoS overcomes\nthe limitations of existing algorithms by using a semantic evaluation method to\naccurately distinguish true room divisions from those erroneously generated by\nfurniture and segmentation inaccuracies. The effectiveness of SeLRoS is\nverified through its application across 30 different 3D environments. Source\ncode and experiment videos for this work are available at:\nhttps://sites.google.com/view/selros.\n","authors":["Taehyeon Kim","Byung-Cheol Min"],"pdf_url":"https://arxiv.org/pdf/2403.12920v1.pdf","comment":null},{"id":"http://arxiv.org/abs/2403.12910v1","updated":"2024-03-19T17:08:24Z","published":"2024-03-19T17:08:24Z","title":"Yell At Your Robot: Improving On-the-Fly from Language Corrections","summary":"  Hierarchical policies that combine language and low-level control have been\nshown to perform impressively long-horizon robotic tasks, by leveraging either\nzero-shot high-level planners like pretrained language and vision-language\nmodels (LLMs/VLMs) or models trained on annotated robotic demonstrations.\nHowever, for complex and dexterous skills, attaining high success rates on\nlong-horizon tasks still represents a major challenge -- the longer the task\nis, the more likely it is that some stage will fail. Can humans help the robot\nto continuously improve its long-horizon task performance through intuitive and\nnatural feedback? In this paper, we make the following observation: high-level\npolicies that index into sufficiently rich and expressive low-level\nlanguage-conditioned skills can be readily supervised with human feedback in\nthe form of language corrections. We show that even fine-grained corrections,\nsuch as small movements (\"move a bit to the left\"), can be effectively\nincorporated into high-level policies, and that such corrections can be readily\nobtained from humans observing the robot and making occasional suggestions.\nThis framework enables robots not only to rapidly adapt to real-time language\nfeedback, but also incorporate this feedback into an iterative training scheme\nthat improves the high-level policy's ability to correct errors in both\nlow-level execution and high-level decision-making purely from verbal feedback.\nOur evaluation on real hardware shows that this leads to significant\nperformance improvement in long-horizon, dexterous manipulation tasks without\nthe need for any additional teleoperation. Videos and code are available at\nhttps://yay-robot.github.io/.\n","authors":["Lucy Xiaoyang Shi","Zheyuan Hu","Tony Z. Zhao","Archit Sharma","Karl Pertsch","Jianlan Luo","Sergey Levine","Chelsea Finn"],"pdf_url":"https://arxiv.org/pdf/2403.12910v1.pdf","comment":"Project website: https://yay-robot.github.io/"}]}}